{
  "key": "01010",
  "title": "RigVeda Hymn 01010",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN X. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01010.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01009.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01011.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN X. Indra.</h3>  \n<p>1 THE chanters hymn thee, they who say the word of praise magnify thee.<br> The priests have raised thee up on high, O &#346;atakratu, like a pole.<br> 2 As up he clomb from ridge to ridge and looked upon the toilsome task,<br> Indra observes this wish of his, and the Rain hastens with his troop.<br> 3 Harness thy pair of strong bay steeds, long-maned, whose bodies fill the girths,<br> And, Indra, Soma-drinker, come to listen to our songs of praise.<br> 4 Come hither, answer thou the song, sing in approval, cry aloud.<br> Good Indra, make our prayer succeed, and prosper this our sacrifice.<br> 5 To Indra must a laud be said, to strengthen him who freely gives,<br> That &#346;akra may take pleasure in our friendship and drink-offerings.<br> 6 Him, him we seek for friendship, him for riches and heroic might.<br> For Indra, he is &#346;akra, he shall aid us while he gives us wealth.<br> 7 Easy to turn and drive away, Indra, is spoil bestowed by thee.<br> Unclose the stable of the kine, and give us wealth O Thunder-armed<br> 8 The heaven and earth contain thee not, together, in thy wrathful mood.<br> Win us the waters of the sky, and send us kine abundantly.<br> 9 Hear, thou whose ear is quick, my call; take to thee readily my songs<br> O Indra, let this laud of mine come nearer even than thy friend.<br> 10 We know thee mightiest of all, in battles hearer of our cry.<br> Of thee most mighty we invoke the aid that giveth thousandfold.<br> 11 O Indra, Son of Ku&#347;ika, drink our libation with delight.<br> Prolong our life anew, and cause the seer to win a thousand gifts.<br> 12 Lover of song, may these our songs on every side encompass thee:<br> Strengthening thee of lengthened life, may they be dear delights to thee.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01011.htm\">Next: HYMN XI. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01010.html",
  "api": "json/hymns/01010.json",
  "data": {
    "title": "HYMN X. Indra.",
    "describe": "THE chanters hymn thee, they who say the word of praise magnify thee.",
    "feecting": "p:THE chanters hymn thee, they who say the word of praise magnify thee.\np: The Monks have raised thee up on high, O &#346;atakratu, like a pole.\r\np:As up he clomb from ridge to ridge and looked upon the toilsome task, Indra observes this wish of his, and the Rain hastens with his troop.\np:Harness thy pair of strong bay steeds, long-maned, whose bodies fill the girths, and, Indra, Soma-drinker, come to listen to our songs of praise.\np:Come hither, answer thou the song, sing in approval, cry aloud. Good Indra, make our meditation succeed, and prosper this our offering.\np:To Indra must a laud be said, to strengthen him who freely gives, that &#346;akr. May take pleasure in our friendship and water-offerings.\np:Him, him we seek for friendship, him for riches and heroic might. For Indra, he is &#346;akra, he shall aid us while he gives us wealth.\np:Easy to turn and drive away, Indra, is spoil bestowed by thee. Unclose the stable of the kine, and give us wealth O Thunder-armed\np:The Heaven and Earth contain thee not, together, in thy wrathful mood. Win us the waters of the sky, and send us kine abundantly.\np:Hear, thou whose ear is quick, my call; take to thee readily my songs O Indra, let this laud of mine come nearer even than thy friend.\np:We know thee mightiest of all. Of thee most mighty we invoke the aid that giveth thousandfold.\np:O Indra, Son of Ku&#347;ika, enjoy our offering with delight. Prolong our life anew, and cause the seer to win a thousand gifts.\np:Lover of song. May these our songs on every side encompass thee: Strengthening thee of lengthened life. May they be dear delights to thee.",
    "next": "01011",
    "previous": "01009",
    "book": "01"
  },
  "created": 1638553065341,
  "updated": 1638791252498
}