{
  "key": "01024",
  "title": "RigVeda Hymn 01024",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN XXIV. Varu&#7751;a and Others.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01024.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01023.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01025.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXIV. Varu&#7751;a and Others.</h3>  \n<p>1 WHO now is he, what God among Immortals, of whose auspicious name we may bethink us?<br> Who shall to mighty Aditi restore us, that I may see my Father and my Mother?<br> 2 Agni the God the first among the Immortals,&#151;of his auspicious name let us bethink us.<br> He shall to mighty Aditi restore us, that I may see my Father and my Mother.<br> 3 To thee, O Savitar, the Lord of precious things, who helpest us<br> Continually, for our share we come&#151;<br> 4 Wealth, highly lauded ere reproach hath fallen on it, which is laid,<br> Free from all hatred, in thy hands<br> 5 Through thy protection may we come to even the height of affluence<br> Which Bhaga hath dealt out to us.<br> 6 Ne&#146;er have those birds that fly through air attained to thy high dominion or thy might or spirit;<br> Nor these the waters that flow on for ever, nor hills, abaters of the wind's wild fury.<br> 7 Varu&#7751;a, King, of hallowed might, sustaineth erect the Tree's stem in the baseless region.<br> Its rays, whose root is high above, stream downward. Deep may they sink within us, and be hidden.<br> 8 King Varu&#7751;a hath made a spacious pathway, a pathway for the Sun wherein to travel.<br> Where no way was he made him set his footstep, and warned afar whate&#146;er afflicts the spirit.<br> 9 A hundred balms are thine, O King, a thousand; deep and wide-reaching also be thy favours.<br> Far from us, far away drive thou Destruction. Put from us e&#146;en the sin we have committed.<br> 10 Whither by day depart the constellations that shine at night, set high in heaven above us?<br> Varu&#7751;a's holy laws remain unweakened, and through the night the Moon moves on in splendor<br> 11 I ask this of thee with my prayer adoring; thy worshipper craves this with his oblation.<br> Varu&#7751;a, stay thou here and be not angry; steal not our life from us, O thou Wide-Ruler.<br> 12 Nightly and daily this one thing they tell me, this too the thought of mine own heart repeateth.<br> May he to whom prayed fettered &#346;una&#7717;&#347;epa, may he the Sovran Varu&#7751;a release us.<br> 13 Bound to three pillars captured &#346;una&#7717;&#347;epa thus to the &#256;ditya made his supplication.<br> Him may the Sovran Varu&#7751;a deliver, wise, ne&#146;er deceived, loosen the bonds that bind him.<br> 14 With bending down, oblations, sacrifices, O Varu&#7751;a, we deprecate thine anger:<br> Wise Asura, thou King of wide dominion, loosen the bonds of sins by us committed.<br> 15 Loosen the bonds, O Varu&#7751;a, that hold me, loosen the bonds above, between, and under.<br> So in thy holy law may we made sinless belong to Aditi, O thou &#256;ditya.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01025.htm\">Next: HYMN XXV. Varu&#7751;a.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01024.html",
  "api": "json/hymns/01024.json",
  "data": {
    "title": "HYMN XXIV. Varu&#7751;a and Others.",
    "describe": "WHO now is he, of whose auspicious name we may bethink us?",
    "feecting": "p:WHO now is he, of whose auspicious name we may bethink us? Who shall restore us, that . May see my Father and my Mother?\np:Indra, the first among the Immortals,&#151;of his auspicious name let us bethink us.\np: He shall restore us, that . May see my Father and my Mother.\r\np:To thee, O Indra, the Lord of precious things, who helpest us continually, for our share we come&#151;\np:Wealth, highly lauded ere reproach hath fallen on it, which is laid, free from all hatred, in thy hands\np:Through thy protectio. May we come to even the height of affluence.\np:Ne&#146;er have those birds that fly through air attained to thy high dominion or thy might or spirit; Nor these the waters that flow on forever, nor hills, abaters of the wind's wild fury.\np:Varu&#7751;a, King, of hallowed might, sustaineth erect the Tree's stem in the baseless region. Its rays, whose root is high above, stream downward. Dee. May they sink within us, and be hidden.\np:King Varu&#7751;a hath made a spacious pathway, a pathway for the Sun wherein to travel. Where no way was he made him set his footstep, and warned afar whate&#146;er afflicts the spirit.\np:A hundred balms are thine, O King, a thousand; deep and wide-reaching also be thy favours. Far from us, far away drive thou destruction. Put from us e&#146;en the sin we have committed.\np:Whither by day depart the constellations that shine at night, set high in Heaven above us? Varu&#7751;a's holy laws remain unweakened, and through the night the Moon moves on in splendor\np:I ask this of thee with my meditation adoring; thy worshipper craves this with his oblation. Varu&#7751;a, stay thou here and be not angry; steal not our life from us, O thou Wide-Ruler.\np:Nightly and daily this one thing they tell me, this too the thought of mine own heart repeateth. May he to whom prayed fettered &#346;una&#7717;&#347;epa. May he the Sovran Varu&#7751;a release us.\np:Bound to three pillars captured &#346;una&#7717;&#347;epa thus to the &#256;ditya made his supplication. Hi. May the Sovran Varu&#7751;a deliver, wise, ne&#146;er deceived, loosen the bonds that bind him.\np:With bending down, oblations, O Varu&#7751;a, we deprecate thine anger: Wise Devas, thou King of wide dominion, loosen the bonds of sins by us committed.\np:Loosen the bonds, O Varu&#7751;a, that hold me, loosen the bonds above, between, and under. So in thy holy la. May we made sinless belong to Aditi, O thou &#256;ditya.",
    "next": "01025",
    "previous": "01023",
    "book": "01"
  },
  "created": 1638553139222,
  "updated": 1638791591166
}