{
  "key": "01027",
  "title": "RigVeda Hymn 01027",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN XXVII. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01027.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01026.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01028.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXVII. Agni.</h3>  \n<p>1 WITH worship will I glorify thee, Agni, like a long-tailed steed,<br> Imperial Lord of sacred rites.<br> 2 May the far-striding Son of Strength, bringer of great felicity,<br> Who pours his gifts like rain, be ours.<br> 3 Lord of all life, from near; from far, do thou, O Agni evermore<br> Protect us from the sinful man.<br> 4 O Agni, graciously announce this our oblation to the Gods,<br> And this our newest song of praise.<br> 5 Give us a share of strength most high, a share of strength that is below,<br> A share of strength that is between.<br> 6 Thou dealest gifts, resplendent One; nigh, as with waves of Sindhu, thou<br> Swift streamest to the worshipper.<br> 7 That man is lord of endless strength whom thou protectest in the fight,<br> Agni, or urgest to the fray.<br> 8 Him, whosoever he may be, no man may vanquish, mighty One:<br> Nay, very glorious power is his.<br> 9 May he who dwells with all mankind bear us with war-steeds through the fight,<br> And with the singers win the spoil.<br> 10 Help, thou who knowest lauds, this work, this eulogy to Rudra, him<br> Adorable in every house.<br> 11 May this our God, great, limitless, smoke-bannered excellently bright,<br> Urge us to strength and holy thought.<br> 12 Like some rich Lord of men may he, Agni the banner of the Gods,<br> Refulgent, hear us through our lauds.<br> 13 Glory to Gods, the mighty and the lesser glory to Gods the younger and the elder!<br> Let us, if we have power, pay the God worship: no better prayer than this, ye Gods, acknowledge.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01028.htm\">Next: HYMN XXVIII. Indra, Etc.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01027.html",
  "api": "json/hymns/01027.json",
  "data": {
    "title": "HYMN XXVII. Agni.",
    "describe": "WITH worship will I glorify thee, Agni, like a long-tailed steed, Imperial Lord of sacred rites.",
    "feecting": "p:WITH worship will I glorify thee, Agni, like a long-tailed steed, Imperial Lord of sacred rites.\np:May the far-striding Son of Strength, bringer of great felicity, who pours his gifts like rain, be ours.\np:Lord of all life, from near; from far, do thou, O Agni evermore protect us from the sinful man.\np:O Agni, graciously announce this our oblation to the Devas, and this our newest song of praise.\np:Give us a share of strength most high, a share of strength that is below, a share of strength that is between.\np:Thou dealest gifts, resplendent One; nigh, as with waves of Sindhu, thou Swift streamest to the worshipper.\np:That man is lord of endless strength whom thou protectest in the fight, Agni, or urgest to the fray.\np:Him, whosoever h. May be, no ma. May vanquish, mighty One: Nay, very glorious power is his.\np:May he who dwells with all mankind bear us with war-steeds through the fight, and with the singers win the spoil.\np:Help, thou who knowest lauds, this work, this eulogy to Soma, him Adorable in every house.\np:May this our Deva, great, limitless, smoke-bannered excellently bright, Urge us to strength and holy thought.\np:Like some rich Lord of me. May he, Agni the banner of the Devas, Refulgent, hear us through our lauds.\np:Glory to Devas, the mighty and the lesser glory to Devas the younger and the elder! Let us, if we have power, pay the Deva worship: no better offering than this, ye Devas, acknowledge.",
    "next": "01028",
    "previous": "01026",
    "book": "01"
  },
  "created": 1638553154994,
  "updated": 1638642698046
}