{
  "key": "01029",
  "title": "RigVeda Hymn 01029",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN XXIX. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01029.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01028.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01030.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXIX. Indra.</h3>  \n<p>1 O SOMA DRINKER, ever true, utterly hopeless though we be,<br> Do thou, O Indra, give us hope of beauteous horses and of kine,<br> In thousands, O most wealthy One.<br> 2 O Lord of Strength, whose jaws are strong, great deeds are thine, the powerful:<br> Do thou, O Indra, give us hope of beauteous horses and of kine,<br> In thousands, O most wealthy One.<br> 3 Lull thou asleep, to wake no more, the pair who on each other look<br> Do thou, O Indra, give us hope of beauteous horses and of kine,<br> In thousands, O most wealthy One.<br> 4 Hero, let hostile spirits sleep, and every gentler genius wake:<br> Do thou, O Indra, give us hope of beauteous horses and of kine,<br> In thousands, O most wealthy One.<br> 5 Destroy this ass, O Indra, who in tones discordant brays to thee:<br> Do thou, O Indra, give us hope of beauteous horses and of kine,<br> In thousands, O most wealthy One.<br> 6 Far distant on the forest fall the tempest in a circling course!<br> Do thou, O Indra, give us hope of beauteous horses and of kine,<br> In thousands, O most wealthy One.<br> 7 Slay each reviler, and destroy him who in secret injures us:<br> Do thou, O Indra, give us hope of beauteous horses and of kine<br> In thousands, O most wealthy One.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01030.htm\">Next: HYMN XXX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01029.html",
  "api": "json/hymns/01029.json",
  "data": {
    "title": "HYMN XXIX. Indra.",
    "describe": "O Indra, ever true, utterly hopeless though we be, Do thou, O Indra, give us hope, in thousands, O most wealthy One.",
    "feecting": "p:O Indra, ever true, utterly hopeless though we be, Do thou, O Indra, give us hope, in thousands, O most wealthy One.\np:O Lord of Strength, O Indra, give us hope, in thousands, O most wealthy One.\np:Lull thou asleep, to wake no more, the pair who on each other look Do thou, O Indra, give us hope, in thousands, O most wealthy One.\np:Hero, let hostile spirits sleep, and every gentler genius wake.\np:Do thou, O Indra, give us hope, in thousands, O most wealthy One.\np:O Indra, who in tones discordant brays to thee: Do thou, O Indra, give us hope, in thousands, O most wealthy One.\np:Far distant on the forest fall the tempest in a circling course! Do thou, O Indra, give us hope, in thousands, O most wealthy One.\np:Destroy him who in secret injures us: Do thou, O Indra, give us hope In thousands, O most wealthy One.",
    "next": "01030",
    "previous": "01028",
    "book": "01"
  },
  "created": 1638553165507,
  "updated": 1638791780239
}