{
  "key": "01032",
  "title": "RigVeda Hymn 01032",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN XXXII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01032.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01031.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01033.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXII. Indra.</h3>  \n<p>1 I WILL declare the manly deeds of Indra, the first that he achieved, the Thunder-wielder.<br> He slew the Dragon, then disclosed the waters, and cleft the channels of the mountain torrents.<br> 2 He slew the Dragon lying on the mountain: his heavenly bolt of thunder Tva&#7779;&#7789;ar fashioned.<br> Like lowing kine in rapid flow descending the waters glided downward to the ocean.<br> 3 Impetuous as a bull, he chose the Soma and in three sacred beakers drank the juices.<br> Maghavan grasped the thunder for his weapon, and smote to death this firstborn of the dragons.<br> 4 When, Indra, thou hadst slain the dragon's firstborn, and overcome the charms of the enchanters,<br> Then, giving life to Sun and Dawn and Heaven, thou foundest not one foe to stand against thee.<br> 5 Indra with his own great and deadly thunder smote into pieces V&#7771;tra, worst of V&#7771;tras.<br> As trunks of trees, what time the axe hath felled them, low on the earth so lies the prostrate Dragon.<br> 6 He, like a mad weak warrior, challenged Indra, the great impetuous many-slaying Hero.<br> He, brooking not the clashing of the weapons, crushed&#151;Indra's foe&#151;the shattered forts in falling.<br> 7 Footless and handless still he challenged Indra, who smote him with his bolt between the shoulders.<br> Emasculate yet claiming manly vigour, thus V&#7771;tra lay with scattered limbs dissevered.<br> 8 There as he lies like a bank-bursting river, the waters taking courage flow above him.<br> The Dragon lies beneath the feet of torrents which V&#7771;tra with his greatness had encompassed.<br> 9 Then humbled was the strength of V&#7771;tra's mother: Indra hath cast his deadly bolt against her.<br> The mother was above, the son was under and like a cow beside her calf lay Danu.<br> 10 Rolled in the midst of never-ceasing currents flowing without a rest for ever onward.<br> The waters bear off V&#7771;tra's nameless body: the foe of Indra sank to during darkness.<br> 11 Guarded by Ahi stood the thralls of D&#257;sas, the waters stayed like kine held by the robber.<br> But he, when he had smitten V&#7771;tra, opened the cave wherein the floods had been imprisoned.<br> 12 A horse's tail wast thou when he, O Indra, smote on thy bolt; thou, God without a second,<br> Thou hast won back the kine, hast won the Soma; thou hast let loose to flow the Seven Rivers.<br> 13 Nothing availed him lightning, nothing thunder, hailstorm or mist which had spread around him:<br> When Indra and the Dragon strove in battle, Maghavan gained the victory for ever.<br> 14 Whom sawest thou to avenge the Dragon, Indra, that fear possessed thy heart when thou hadst slain him;<br> That, like a hawk affrighted through the regions, thou crossedst nine-and-ninety flowing rivers?<br> 15 Indra is King of all that moves and moves not, of creatures tame and horned, the Thunder-wielder.<br> Over all living men he rules as Sovran, containing all as spokes within the felly.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01033.htm\">Next: HYMN XXXIII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01032.html",
  "api": "json/hymns/01032.json",
  "data": {
    "key": "01032",
    "title": "HYMN XXXII. Indra.",
    "describe": "I WILL declare the manly deeds of Indra, the first that he achieved, the Thunder-wielder.",
    "feecting": "p:I WILL declare the manly deeds of Indra, the first that he achieved, the Thunder-wielder.\np: He  disclosed the waters, and cleft the channels of the mountain torrents.\r\np:His heavenly bolt of thunder Tvaṣṭar fashioned. Like lowing kine in rapid flow descending the waters glided downward to the ocean.\np:Indra grasped the thunder for his weapon, and smote to death this firstborn of the dragons.\np:When, Indra overcome the charms of the enchanters, then, giving life to Sun and Dawn and Heaven, thou foundest not one foe to stand against thee.\np:As trunks of trees, what time the axe hath felled them, low on the Earth so lies the prostrate Dragon.\np:He, challenged Indra, the great impetuous many-subduing Hero. He, brooking not the clashing of the weapons, crushed—Indra's foe—the shattered forts in falling.\np:Footless and handless still he challenged Indra, who smote him with his bolt between the shoulders. Emasculate yet claiming manly vigour, thus Vṛtra lay.\np:There as he lies like a bank-bursting river, the waters taking courage flow above him. The Dragon lies beneath the feet of torrents which Vṛtra with his greatness had encompassed.\np:Then humbled was the strength of Vṛtra's mother. The mother was above, the son was under and like a cow beside her calf lay Danu.\np:Rolled in the midst of never-ceasing currents flowing without a rest forever onward. The waters bear off Vṛtra's nameless body: the foe of Indra sank to during darkness.\np:Guarded by Ahi stood the thralls of Dāsas, the waters stayed like kine held by the robber. But he, when he had smitten Vṛtra, opened the cave wherein the floods had been imprisoned.\np:A horse's tail wast thou when he, O Indra, smote on thy bolt; thou, Deva without a second, Thou hast won back the kine, thou hast let loose to flow the Seven Rivers.\np:Nothing availed him lightning, nothing thunder, hailstorm or mist which had spread around him: When Indra and the Dragon strove in battle, Indra gained the victory forever.\np:Whom sawest thou to avenge the Dragon, Indra, that fear possessed thy heart when thou hadst slain him; That, like a hawk affrighted through the regions, thou crossedst nine-and-ninety flowing rivers?\np:Indra is King of all that moves and moves not, of creatures tame and horned, the Thunder-wielder. Over all living men he rules as Sovran, containing all as spokes within the felly.",
    "meta": {
      "next": "01033",
      "previous": "01031",
      "book": "01",
      "original": "https://sacred-texts.com/hin/rigveda/rv01032.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv01032.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "01032",
            "title": "HYMN XXXII. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638553181568,
  "updated": 1667440426462
}