{
  "key": "01047",
  "title": "RigVeda Hymn 01047",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN XLVII. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01047.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01046.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01048.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XLVII. A&#347;vins.</h3>  \n<p>1 A&#346;VINS, for you who strengthen Law this sweetest Soma hath been shed.<br> Drink this expressed ere yesterday and give riches to him who offers it.<br> 2 Come, O ye A&#347;vins, mounted on your triple car three-seated, beautiful of form<br> To you at sacrifice the Ka&#7751;vas send the prayer: graciously listen to their call.<br> 3 O A&#347;vins, ye who strengthen Law, drink ye this sweetest Soma juice.<br> Borne on your wealth-fraught car come ye this day to him who offers, ye of wondrous deeds.<br> 4 Omniscient A&#347;vins, on the thrice-heaped grass bedew with the sweet juice the sacrifice.<br> The sons of Ka&#7751;va, striving heavenward, call on you with draughts of Soma juice out-poured.<br> 5 O A&#347;vins, with those aids wherewith ye guarded Ka&#7751;va carefully,<br> Keep us, O Lords of Splendour: drink the Soma juice, ye strengtheners of holy law.<br> 6 O Mighty Ones, ye gave Sud&#257;s abundant food, brought on your treasure-laden car;<br> So now vouchsafe to us the wealth which many crave, either from heaven or from the sea.<br> 7 N&#257;satyas, whether ye be far away or close to Turva&#347;a,<br> Borne on your lightly-rolling chariot come to us, together with the sunbeams come.<br> 8 So let your coursers, ornaments of sacrifice, bring you to our libations here.<br> Bestowing food on him who acts and gives aright, sit, Chiefs, upon the sacred grass.<br> 9 Come, O N&#257;satyas, on your car decked with a sunbright canopy,<br> Whereon ye ever bring wealth to the worshipper, to drink the Soma's pleasant juice.<br> 10 With lauds and songs of praise we call them down to us, that they, most rich, may succour us;<br> For ye have ever in the Ka&#7751;vas' well-loved house, O A&#347;vins, drunk the Soma juice.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01048.htm\">Next: HYMN XLVIII. Dawn.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/01047.html",
  "api": "hymns/01047json",
  "data": {
    "title": "HYMN XLVII. Aśvins.",
    "describe": "AŚVINS, for you who strengthen Law this sweetest Soma hath been shed.",
    "feecting": "p:AŚVINS, for you who strengthen Law this sweetest Soma hath been shed.\np: Drink this expressed ere yesterday and give riches to him who offers it.\r\np:Come, O ye Aśvins, mounted on your triple car three-seated, beautiful of form To you at offerings the Kaṇvas send the prayer: graciously listen to their call.\np:O Aśvins, ye who strengthen Law, drink ye this sweetest Soma juice. Borne on your wealth-fraught car come ye this day to him who offers, ye of wondrous deeds.\np:Omniscient Aśvins, on the thrice-heaped grass bedew with the sweet juice the offering. The sons of Kaṇva, striving heavenward, call on you with draughts of Soma juice out-poured.\np:O Aśvins, with those aids wherewith ye guarded Kaṇva carefully, Keep us, O Lords of Splendour: drink the Soma juice, ye strengtheners of holy law.\np:O Mighty Ones, ye gave Sudās abundant food, brought on your treasure-laden car; So now vouchsafe to us the wealth which many crave, either from Heaven or from the sea.\np:Nāsatyas, whether ye be far away or close to Turvaśa, Borne on your lightly-rolling chariot come to us, together with the sunbeams come.\np:So let your coursers bring you to our libations here. Bestowing food on him who acts and gives aright, sit, Chiefs, upon the sacred grass.\np:Come, O Nāsatyas, on your car decked with a sunbright canopy, Whereon ye ever bring wealth to the worshipper, 's pleasant juice.\np:With lauds and songs of praise we call them down to us, that they, most rich. May succour us; For ye have ever in the Kaṇvas' well-loved house, O Aśvins.",
    "next": "01048",
    "previous": "01046",
    "book": "01"
  },
  "created": 1638553261293
}