{
  "key": "01046",
  "title": "RigVeda Hymn 01046",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN XLVI. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01046.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01045.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01047.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XLVI. A&#347;vins.</h3>  \n<p>1 Now Morning with her earliest light shines forth, dear Daughter of the Sky:<br> High, A&#347;vins, I extol your praise,<br> 2 Sons of the Sea, mighty to save discoverers of riches, ye<br> Gods with deep thought who find out wealth.<br> 3 Your giant coursers hasten on over the region all in flames, <br> When your car flies with winged steeds.<br> 4 He, liberal, lover of the flood, Lord of the House, the vigilant,<br> Chiefs! with oblations feeds you full.<br> 5 Ye have regard unto our hymns, N&#257;satyas, thinking of our words:<br> Drink boldly of the Soma juice.<br> 6 Vouchsafe to us, O A&#347;vin Pair, such strength as, with attendant light,<br> May through the darkness carry us.<br> 7 Come in the ship of these our hymns to bear you to the hither shore<br> O A&#347;vins, harness ye the car.<br> 8 The heaven's wide vessel is your own on the flood's shore your chariot waits<br> Drops, with the hymn, have been prepared.<br> 9 Ka&#7751;vas, the drops are in the heaven; the wealth is at the waters' place:<br> Where will ye manifest your form?<br> 10 Light came to lighten up the branch, the Sun appeared as it were gold:<br> And with its tongue shone forth the dark.<br> 11 The path of sacrifice was made to travel to the farther goal:<br> The road of heaven was manifest.<br> 12 The singer of their praise awaits whatever grace the A&#347;vins give,<br> who save when Soma gladdens them.<br> 13 Ye dwellers with Vivasv&#257;n come, auspicious, as to Manu erst;<br> come to the Soma and our praise.<br> 14 O circumambient A&#347;vins, Dawn follows the brightness of your way:<br> Approve with beams our solemn rites.<br> 15 Drink ye of our libations, grant protection, O ye A&#347;vins Twain,<br> With aids which none may interrupt.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01047.htm\">Next: HYMN XLVII. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01046.html",
  "api": "json/hymns/01046.json",
  "data": {
    "title": "HYMN XLVI. A&#347;vins.",
    "describe": "Now Morning with her earliest light shines forth, dear Daughter of the Sky: High, A&#347;",
    "feecting": "p:Now Morning with her earliest light shines forth, dear Daughter of the Sky: High, A&#347;vins, I extol your praise,\np:Sons of the Sea, mighty to save discoverers of riches, ye Devas with deep thought who find out wealth.\np:Your giant coursers hasten on over the region all in flames,  When your car flies with winged steeds.\np:He, liberal, lover of the flood, Lord of the House, the vigilant, Chiefs! with oblations feeds you full.\np:Ye have regard unto our hymns, N&#257;satyas, thinking of our words: Drink boldly of the Soma juice.\np:Vouchsafe to us, O A&#347;vin Pair, such strength as, with attendant light, May through the darkness carry us.\np:Come in the ship of these our hymns to bear you to the hither shore O A&#347;vins, harness ye the car.\np:The Heaven's wide vessel is your own on the flood's shore your chariot waits Drops, with the hymn, have been prepared.\np:Ka&#7751;vas, the drops are in the Heaven; the wealth is at the waters' place: Where will ye manifest your form?\np:Light came to lighten up the branch, the Sun appeared as it were gold: And with its tongue shone forth the dark.\np:The path of offering was made to travel to the farther goal: The road of Heaven was manifest.\np:The singer of their praise awaits whatever grace the A&#347;vins givepath of offering.\np:Ye dwellers with Vivasv&#257;n come, auspicious come to our offering.\np:O circumambient A&#347;vins, Dawn follows the brightness of your way: Approve with beams our solemn rites.\np:Drink ye of our libations, grant protection, O ye A&#347;vins Twain, with aids which non. May interrupt.",
    "next": "01047",
    "previous": "01045",
    "book": "01"
  },
  "created": 1638553255993,
  "updated": 1638647789898
}