{
  "key": "01055",
  "title": "RigVeda Hymn 01055",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01055.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01054.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01056.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LV. Indra.</h3>  \n<p>1 THOUGH e&#146;en this heaven's wide space and earth have spread them out, nor heaven nor earth may be in greatness Indra's match.<br> Awful and very mighty, causing woe to men, he whets his thunderbolt for sharpness, as a bull.<br> 2 Like as the watery ocean, so doth he receive the rivers spread on all sides in their ample width.<br> He bears him like a bull to drink of Soma juice, and will, as Warrior from of old, be praised for might.<br> 3 Thou swayest, Indra, all kinds of great manly power, so as to bend, as&#146;t were, even that famed mountain down.<br> Foremost among the Gods is he through hero might, set in the van, the Strong One, for each arduous deed.<br> 4 He only in the wood is praised by worshippers, when he shows forth to men his own fair Indra-power.<br> A friendly Bull is he, a Bull to be desired when Maghavan auspiciously sends forth his voice.<br> 5 Yet verily the Warrior in his vigorous strength stirreth up with his might great battles for mankind;<br> And men have faith in Indra, the resplendent One, what time he hurleth down his bolt, his dart of death.<br> 6 Though, fain for glory, and with strength increased on earth, he with great might destroys the dwellings made with art,<br> He makes the lights of heaven shine forth secure, he bids, exceeding wise, the floods flow for his worshipper.<br> 7 Drinker of Soma, let thy heart incline to give; bring thy Bays hitherward, O thou who hearest praise.<br> Those charioteers of thine, best skilled to draw the rein, the rapid sunbeams, Indra, lead thee not astray.<br> 8 Thou bearest in both hands treasure that never fails; the famed One in his body holds unvanquished might.<br> O Indra, in thy members many powers abide, like wells surrounded by the ministering priests.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01056.htm\">Next: HYMN LVI. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01055.html",
  "api": "json/hymns/01055.json",
  "data": {
    "title": "HYMN LV. Indra.",
    "describe": "THOUGH e&#146;",
    "feecting": "p:THOUGH e&#146;en this Heaven's wide space and Earth have spread them out, nor Heaven nor Eart. May be in greatness Indra's match.\np: He whets his thunderbolt for sharpness, as a bull.\r\np:Like as the watery ocean, so doth he receive the rivers spread on all sides in their ample width. He bears him like a bullH, and will, as Warrior from of old, be praised for might.\np:Thou swayest, Indra, all kinds of great manly power, so as to bend, as&#146;t were, even that famed mountain down. Foremost among the Devas is he through hero might, set in the van, the Strong One, for each arduous deed.\np:He only in the wood is praised by worshippers, when he shows forth to men his own fair Indra-power. A friendly Bull is he, a Bull to be desired when Indra auspiciously sends forth his voice.\np:Yet verily the Warrior in his vigorous strength stirreth up with his might great battles for mankind; And men have faith in Indra, the resplendent One, what time he hurleth down his bolt, his dart of death.\np:Though, fain for glory, and with strength increased on Earth, he with great might destroys the dwellings made with art. He makes the lights of Heaven shine forth secure, he bids, exceeding wise, the floods flow for his worshipper.\np:Let thy heart incline to give; bring thy Bays hitherward, O thou who hearest praise. Those charioteers of thine, best skilled to draw the rein, the rapid sunbeams, Indra, lead thee not astray.\np:Thou bearest in both hands treasure that never fails; the famed One in his body holds unvanquished might. O Indra, in thy members many powers abide, like wells surrounded by the ministering monks.",
    "next": "01056",
    "previous": "01054",
    "book": "01"
  },
  "created": 1638553303353,
  "updated": 1638647072119
}