{
  "key": "01058",
  "title": "RigVeda Hymn 01058",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LVIII. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01058.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01057.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01059.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LVIII. Agni.</h3>  \n<p>1 NE&#146;ER waxeth faint the Immortal, Son of Strength, since he, the Herald, hath become Vivasv&#257;n's messenger.<br> On paths most excellent he measured out mid-air: he with oblation calls to service of the Gods.<br> 2 Never decaying, seizing his appropriate food, rapidly, eagerly through the dry wood he spreads.<br> His back, as he is sprinkled, glistens like a horse: loud hath he roared and shouted like the heights of heaven?<br> 3 Set high in place o&#146;er all that Vasus, Rudras do, immortal, Lord of riches, seated as High Priest;<br> Hastening like a car to men, to those who live, the God without delay gives boons to be desired.<br> 4 Urged by the wind be spreads through dry wood as he lists, armed with his tongues for sickles, with a mighty roar.<br> Black is thy path, Agni, changeless, with glittering waves! when like a bull thou rushest eager to the trees.<br> 5 With teeth of flame, wind-driven, through the wood he speeds, triumphant like a bull among the herd of cows,<br> With bright strength roaming to the everlasting air: things fixed, things moving quake before him as he flies.<br> 6 The Bh&#7771;gus established thee among mankind for men, like as a treasure, beauteous, easy to invoke;<br> Thee, Agni, as a herald and choice-worthy guest, as an auspicious Friend to the Celestial Race.<br> 7 Agni, the seven tongues' deftest Sacrificer, him whom the priests elect at solemn worship,<br> The Herald, messenger of all the Vasus, I serve with dainty food, I ask for riches.<br> 8 Grant, Son of Strength, thou rich in friends, a refuge without a flaw this day to us thy praisers.<br> O Agni, Son of Strength, with forts of iron preserve thou from distress the man who lauds thee.<br> 9 Be thou a refuge, Bright One, to the singer, a shelter, Bounteous Lord, to those who worship.<br> Preserve the singer from distress, O Agni. May he, enriched with prayer, come soon and early.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01059.htm\">Next: HYMN LIX. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01058.html",
  "api": "hymns/01058json",
  "data": {
    "title": "HYMN LVIII. Agni.",
    "describe": "NE’ER waxeth faint the Immortal, Son of Strength, since he, the Herald, hath become Vivasvān's messenger.",
    "feecting": "p:NE’ER waxeth faint the Immortal, Son of Strength, since he, the Herald, hath become Vivasvān's messenger.\np: On paths most excellent he measured out mid-air: he with oblation calls to service of the Devas.\r\np:Never decaying, seizing his appropriate food, rapidly, eagerly through the dry wood he spreads. His back, as he is sprinkled, glistens like a horse: loud hath he roared and shouted like the heights of Heaven?\np:Set high in place o’er all that Devas, Somas do, immortal, Lord of riches, seated as High Monk; Hastening like a car to men, to those who live without delay gives boons to be desired.\np:Urged by the wind be spreads through dry wood as he lists, armed with his tongues for sickles, with a mighty roar. Black is thy path, Agni, changeless, with glittering waves! When like a bull thou rushest eager to the trees.\np:With teeth of flame, wind-driven, through the wood he speeds, triumphant like a bull among the herd of cows, with bright strength roaming to the everlasting air: things fixed, things moving quake before him as he flies.\np:The Bhṛgus established thee among mankind for men, like as a treasure, beauteous, easy to invoke; Thee, Agni, as a herald and choice-worthy guest, as an auspicious Friend to the Celestial Race.\np:Agni, the seven tongues', him whom the monks elect at solemn worship, the Herald, messenger of all the Devas, I serve with dainty food, I ask for riches.\np:Grant, Son of Strength, thou rich in friends, a refuge without a flaw this day to us thy praisers. O Agni, Son of Strength, with forts of iron preserve thou from distress the man who lauds thee.\np:Be thou a refuge, Bright One, to the singer, a shelter, Bounteous Lord, to those who worship. Preserve the singer from distress, O Agni. May he, enriched with meditation, come soon and early.",
    "next": "01059",
    "previous": "01057",
    "book": "01"
  },
  "created": 1638553319339
}