{
  "key": "01050",
  "title": "RigVeda Hymn 01050",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN L. S&#363;rya.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01050.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01049.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01051.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN L. S&#363;rya.</h3>  \n<p>1 HIS bright rays bear him up aloft, the God who knoweth all that lives,<br> S&#363;rya, that all may look on him.<br> 2 The constellations pass away, like thieves, together with their beams,<br> Before the all-beholding Sun.<br> 3 His herald rays are seen afar refulgent o&#146;er the world of men,<br> Like flames of fire that burn and blaze.<br> 4 Swift and all beautiful art thou, O S&#363;rya, maker of the light,<br> Illuming all the radiant realm.<br> 5 Thou goest to the hosts of Gods, thou comest hither to mankind,<br> Hither all light to be beheld.<br> 6 With that same eye of thine wherewith thou lookest brilliant Varu&#7751;a,<br> Upon the busy race of men,<br> 7 Traversing sky and wide mid-air, thou metest with thy beams our days,<br> Sun, seeing all things that have birth.<br> 8 Seven Bay Steeds harnessed to thy car bear thee, O thou farseeing One,<br> God, S&#363;rya, with the radiant hair.<br> 9 S&#363;rya hath yoked the pure bright Seven, the daughters of the car; with these,<br> His own dear team, he goeth forth.<br> 10 Looking upon the loftier light above the darkness we have come<br> To S&#363;rya, God among the Gods, the light that is most excellent.<br> 11 Rising this day, O rich in friends, ascending to the loftier heaven,<br> S&#363;rya remove my heart's disease, take from me this my yellow hue.<br> 12 To parrots and to starlings let us give away my yellowness,<br> Or this my yellowness let us transfer to Harit&#257;la trees.<br> 13 With all his conquering vigour this &#256;ditya hath gone up on high,<br> Giving my foe into mine hand: let me not be my foeman's prey.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01051.htm\">Next: HYMN LI. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01050.html",
  "api": "json/hymns/01050.json",
  "data": {
    "key": "01050",
    "title": "HYMN L. Sūrya.",
    "describe": "HIS bright rays bear him up aloft who knoweth all that lives, Sūrya, that al.",
    "feecting": "p:HIS bright rays bear him up aloft who knoweth all that lives, Sūrya, that al. May look on him.\np:The constellations pass away, like thieves, together with their beams, before the all-beholding Sun.\np:His herald rays are seen afar refulgent o’er the world of men, like flames of fire that burn and blaze.\np:Swift and all beautiful art thou, O Sūrya, maker of the light, Illuming all the radiant realm.\np:Thou goest to the hosts of Devas, thou comest hither to mankind, Hither all light to be beheld.\np:With that same eye of thine wherewith thou lookest brilliant Indra, Upon the busy race of men,\np:Traversing sky and wide mid-air, thou metest with thy beams our days, Sun, seeing all things that have birth.\np:Seven Bay Steeds harnessed to thy car bear thee, O thou farseeing One, Deva, Sūrya, with the radiant hair.\np:Sūrya hath yoked the pure bright Seven, the daughters of the car; with these, His own dear team, he goeth forth.\np:Looking upon the loftier light above the darkness we have come To Sūrya, God among the Devas, the light that is most excellent.\np:Rising this day, O rich in friends, ascending to the loftier Heaven, Sūrya remove my heart's disease, take from me this my yellow hue.\np:To parrots and to starlings let us give away my yellowness, or this my yellowness let us transfer to Haritāla trees.\np:With all his conquering vigour this Āditya hath gone up on high, giving my foe into mine hand: let me not be my foeman's prey.",
    "meta": {
      "next": "01051",
      "previous": "01049",
      "book": "01",
      "source": "https://sacred-texts.com/hin/rigveda/rv01050.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv01050.htm"
    },
    "deities": [
      {
        "name": "O Sūrya",
        "hymns": [
          {
            "key": "01050",
            "title": "HYMN L. Sūrya."
          }
        ]
      },
      {
        "name": "O thou",
        "hymns": [
          {
            "key": "01050",
            "title": "HYMN L. Sūrya."
          }
        ]
      },
      {
        "name": "O rich",
        "hymns": [
          {
            "key": "01050",
            "title": "HYMN L. Sūrya."
          }
        ]
      }
    ]
  },
  "created": 1638553277060,
  "updated": 1638830291659
}