{
  "key": "01061",
  "title": "RigVeda Hymn 01061",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LXI. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01061.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01060.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01062.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXI. Indra.</h3>  \n<p>1 EVEN to him, swift, strong and high. exalted, I bring my song of praise as dainty viands,<br> My thought to him resistless, praise-deserving, prayers offered most especially to Indra.<br> 2 Praise, like oblation, I present, and utter aloud my song, my fair hymn to the Victor.<br> For Indra, who is Lord of old, the singers have decked their lauds with heart and mind and spirit.<br> 3 To him then with my lips mine adoration, winning heaven's light, most excellent, I offer,<br> To magnify with songs of invocation and with fair hymns the Lord, most bounteous Giver.<br> 4 Even for him I frame a laud, as fashions the wright a chariot for the man who needs it,&#151;<br> Praises to him who gladly hears our praises, a hymn well-formed, all-moving, to wise Indra.<br> 5 So with my tongue I deck, to please that Indra, my hymn, as &#146;twere a horse, through love of glory,<br> To reverence the Hero, bounteous Giver, famed far and wide, destroyer of the castles.<br> 6 Even for him hath Tva&#7779;&#7789;ar forged the thunder, most deftly wrought, celestial, for the battle,<br> Wherewith he reached the vital parts of V&#7771;tra, striking-the vast, the mighty with the striker.<br> 7 As soon as, at libations of his mother, great Vi&#7779;&#7751;u had drunk up the draught, he plundered.<br> The dainty cates, the cooked mess; but One stronger transfixed the wild boar, shooting through the mountain.<br> 8 To him, to Indra, when he slew the Dragon, the Dames, too, Consorts of the Gods, wove praises.<br> The mighty heaven and earth hath he encompassed: thy greatness heaven and earth, combined, exceed not.<br> 9 Yea, of a truth, his magnitude surpasseth the magnitude of earth, mid-air, and heaven.<br> Indra, approved by all men, self-resplendent, waxed in his home, loud-voiced and strong for battle.<br> 10 Through his own strength Indra with bolt of thunder cut piece-meal V&#7771;tra, drier up of waters.<br> He let the floods go free, like cows imprisoned, for glory, with a heart inclined to bounty.<br> 11 The rivers played, through his impetuous splendour, since with his bolt he compassed them on all sides.<br> Using his might and favouring him who worshipped, he made a ford, victorious, for Turv&#299;ti.<br> 12 Vast, with thine ample power, with eager movement, against this V&#7771;tra cast thy bolt of thunder.<br> Rend thou his joints, as of an ox, dissevered, with bolt oblique, that floods of rain may follow.<br> 13 Sing with new lauds his exploits wrought aforetime, the deeds of him, yea, him who moveth swiftly,<br> When, hurling forth his weapons in the battle, he with impetuous wrath lays low the foemen.<br> 14 When he, yea, he, comes forth the firm. Set mountains and the whole heaven and earth, tremble for terror.<br> May Nodhas, ever praising the protection of that dear Friend, gain quickly strength heroic.<br> 15 Now unto him of these things hath been given what he who rules alone o&#146;er much, electeth.<br> Indra hath helped Eta&#347;a, Soma-presser, contending in the race of steeds with S&#363;rya.<br> 16 Thus to thee, Indra, yoker of Bay Coursers, the Gotamas have brought their prayers to please thee.<br> Bestow upon them thought, decked with all beauty. May he, enriched with prayer, come soon and early.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01062.htm\">Next: HYMN LXII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01061.html",
  "api": "json/hymns/01061.json",
  "data": {
    "title": "HYMN LXI. Indra.",
    "describe": "EVEN to him, swift, strong and high.",
    "feecting": "p:EVEN to him, swift, strong and high. exalted, I bring my song of praise as dainty offerings, My thought to him resistless, praise-deserving, prayers offered most especially to Indra.\np:Praise, like oblation, I present, and utter aloud my song, my fair hymn to the Victor.\np: For Indra, who is Lord of old, the singers have decked their lauds with heart and mind and spirit.\r\np:To him then with my lips mine adoration, winning Heaven's light, most excellent, I offer, to magnify with songs of invocation and with fair hymns the Lord, most bounteous Giver.\np:Even for him I frame a laud, as fashions the wright a chariot for the man who needs it,&#151; Praises to him who gladly hears our praises, a hymn well-formed, all-moving, to wise Indra.\np:So with my tongue I deck, to please that Indra, my hymn, as &#146;twere a horse, through love of glory, to reverence the Hero, bounteous Giver, famed far and wide, destroyer of the castles.\np:Even for him hath Tva&#7779;&#7789;ar forged the thunder, most deftly wrought, celestial, for the battle, Wherewith he reached the vital parts of V&#7771;tra, striking-the vast, the mighty with the striker.\np:As soon as, at libations of his mother, great Vi&#7779;&#7751;u had drunk up the draught, he plundered. The dainty cates, the cooked mess; but One stronger transfixed the wild boar, shooting through the mountain.\np:To him, to Indra, Consorts of the Devas, wove praises. The mighty Heaven and Earth hath he encompassed: thy greatness Heaven and Earth, combined, exceed not.\np:Yea, of a truth, his magnitude surpasseth the magnitude of Earth, mid-air, and Heaven. Indra, approved by all men, self-resplendent, waxed in his home, loud-voiced and strong for battle.\np:Through his own strength Indra with bolt of thunder cut piece-meal V&#7771;tra, drier up of waters. He let the floods go free, like cows imprisoned, for glory, with a heart inclined to bounty.\np:The rivers played, through his impetuous splendour, since with his bolt he compassed them on all sides. Using his might and favouring him who worshipped, he made a ford, victorious, for Turv&#299;ti.\np:Vast, with thine ample power, with eager movement, against this V&#7771;tra cast thy bolt of thunder. Rend thou  with bolt oblique, that floods of rai. May follow.\np:Sing with new lauds his exploits wrought aforetime, the deeds of him, yea, him who moveth swiftly, when, hurling forth his weapons in the battle, he with impetuous wrath lays low the foemen.\np:When he, yea, he, comes forth the firm. Set mountains and the whole Heaven and Earth. Ever praising the protection of that dear Friend, gain quickly strength heroic.\np:Now unto him of these things hath been given what he who rules alone o&#146;er much, electeth. Indra hath helped Eta&#347;a contending in the race of steeds with S&#363;rya.\np:Thus to thee, Indra, yoker of Bay Coursers, we have brought our offerings to thee. Bestory upon us thought, decked with all beauty. May he, enriched with meditation, come soon and early.",
    "next": "01062",
    "previous": "01060",
    "book": "01"
  },
  "created": 1638553335118,
  "updated": 1638791591212
}