{
  "key": "01069",
  "title": "RigVeda Hymn 01069",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LXIX. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01069.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01068.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01070.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXIX. Agni.</h3>  \n<p>1. BRIGHT, splendid, like Dawn's lover, he hath filled the two joined worlds as with the light of heaven.<br> When born, with might thou hast encompassed them: Father of Gods, and yet their Son wast thou.<br> 2 Agni, the Sage, the humble, who discerns like the cow's udder, the sweet taste of food,<br> Like a bliss-giver to be drawn to men, sits gracious in the middle of the house.<br> 3 Born in the dwelling like a lovely son, pleased, like a strong steed, he bears on the folk.<br> What time the men and I, with heroes, call, may Agni then gain all through Godlike power.<br> 4 None breaks these holy laws of thine when thou hast granted audience to these chieftains here.<br> This is thy boast, thou smotest with thy peers, and joined with heroes dravest off disgrace.<br> 5 Like the Dawn's lover, spreading light, well-known as hued like morn, may he remember me.<br> They, bearing of themselves, unbar the doors: they all ascend to the fair place of heaven.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01070.htm\">Next: HYMN LXX. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01069.html",
  "api": "json/hymns/01069.json",
  "data": {
    "title": "HYMN LXIX. Agni.",
    "describe": "BRIGHT, splendid, like Dawn's lover, he hath filled the two joined worlds as with the light of Heaven.",
    "feecting": "p:BRIGHT, splendid, like Dawn's lover, he hath filled the two joined worlds as with the light of Heaven.\np: When born, with might thou hast encompassed them: Father of Devas, and yet their Son wast thou.\r\np:Agni, the Sage, the humble, who discerns like the cow's udder, the sweet taste of food, like a bliss-giver to be drawn to men, sits gracious in the middle of the house.\np:Born in the dwelling like a lovely son, pleased, like a strong steed, he bears on the folk. What time the men and I, with heroes, call. May Agni then gain all through Godlike power.\np:None breaks these holy laws of thine when thou hast granted audience to these chieftains here. This is thy boast, thou smotest with thy peers, and joined with heroes dravest off disgrace.\np:Like the Dawn's lover, spreading light, well-known as hued like morn. May he remember me. They, bearing of themselves, unbar the doors: they all ascend to the fair place of Heaven.",
    "next": "01070",
    "previous": "01068",
    "book": "01"
  },
  "created": 1638553377221,
  "updated": 1638647789924
}