{
  "key": "01062",
  "title": "RigVeda Hymn 01062",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LXII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01062.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01061.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01063.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXII. Indra.</h3>  \n<p>1. LIKE A&#7749;giras a gladdening laud we ponder to him who loveth song, exceeding mighty.<br> Let us sing glory to the far-famed Hero who must be praised with fair hymns by the singer.<br> 2 Unto the great bring ye great adoration, a chant with praise to him exceeding mighty,<br> Through whom our sires, A&#7749;girases, singing praises and knowing well the places, found the cattle.<br> 3 When Indra and the A&#7749;girases desired it, Saram&#257; found provision for her offspring.<br> B&#7771;haspati cleft the mountain, found the cattle: the heroes shouted with the kine in triumph.<br> 4 Mid shout, loud shout, and roar, with the Navagvas, seven singers, hast thou, heavenly, rent the mountain;<br> Thou hast, with speeders, with Da&#347;agvas, Indra, &#346;akra, with thunder rent obstructive Vala.<br> 5 Praised by A&#7749;girases, thou, foe-destroyer, hast, with the Dawn, Sun, rays, dispelled the darkness.<br> Thou Indra, hast spread out the earth's high ridges, and firmly fixed the region under heaven.<br> 6 This is the deed most worthy of all honour, the fairest marvel of the Wonder-Worker,<br> That, nigh where heaven bends down, he made four rivers flow full with waves that carry down sweet water.<br> 7 Unwearied, won with lauding hymns, he parted of old the ancient Pair, united ever.<br> In highest sky like Bhaga, he the doer of marvels set both Dames and earth and heaven.<br> 8 Still born afresh, young Dames, each in her manner, unlike in hue, the Pair in alternation<br> Round heaven and earth from ancient time have travelled, Night with her dark limbs, Dawn with limbs of splendour.<br> 9 Rich in good actions, skilled in operation, the Son with might maintains his perfect friendship.<br> Thou in the raw cows, black of hue or ruddy, storest the ripe milk glossy white in colour.<br> 10 Their paths, of old connected, rest uninjured; they with great might preserve the immortal statutes.<br> For many thousand holy works the Sisters wait on the haughty Lord like wives and matrons.<br> 11 Thoughts ancient, seeking wealth, with adoration, with newest lauds have sped to thee, O Mighty.<br> As yearning wives cleave to their yearning husband, so cleave our hymns to thee, O Lord most potent.<br> 12 Strong God, the riches which thy hands have holden from days of old have perished not nor wasted.<br> Splendid art thou, O Indra, wise, unbending: strengthen us with might, O Lord of Power.<br> 13 O mighty Indra, Gotama's son Nodhas hath fashioned this new prayer to thee Eternal,<br> Sure leader, yoker of the Tawny Coursers. May he, enriched with prayer, come soon and early.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01063.htm\">Next: HYMN LXIII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01062.html",
  "api": "json/hymns/01062.json",
  "data": {
    "title": "HYMN LXII. Indra.",
    "describe": "LIKE A&#7749;",
    "feecting": "p:LIKE A&#7749;giras a gladdening laud we ponder to him who loveth song, exceeding mighty.\np: Let us sing glory to the far-famed Hero who must be praised with fair hymns by the singer.\r\np:Unto the great bring ye great adoration, a chant with praise to him exceeding mighty, Through whom our sires, A&#7749;girases, singing praises and knowing well the places, found the cattle.\np:When Indra and the A&#7749;girases desired it, Saram&#257; found provision for her offspring. B&#7771;haspati cleft the mountain, found the cattle: the heroes shouted with the kine in triumph.\np:Mid shout, loud shout, and roar, with the Navagvas, seven singers, hast thou, heavenly, rent the mountain; Thou hast, with speeders, with Da&#347;agvas, Indra, &#346;akra, with thunder rent obstructive Vala.\np:Praised by A&#7749;girases, thou dispelled the darkness. Thou Indra, hast spread out the Earth's high ridges, and firmly fixed the region under Heaven.\np:This is the deed most worthy of all honour, the fairest marvel of the Wonder-Worker, that, nigh where Heaven bends down, he made four rivers flow full with waves that carry down sweet water.\np:Unwearied, won with lauding hymns. In highest sky like Bhaga, he the doer of marvels set both Earth and Heaven.\np:Still born afresh in alternation Round Heaven and Earth from ancient time have travelled, Night with dark limbs, Dawn with limbs of splendour.\np:Rich in good actions, skilled in operation, the Son with might maintains his perfect friendship. Thou in the raw cows, black of hue or ruddy, storest the ripe milk glossy white in colour.\np:Their paths, of old connected, rest uninjured; they with great might preserve the immortal statutes. For many thousand holy works the Sisters wait on the haughty Lord like wives and matrons.\np:Thoughts ancient, seeking wealth, with adoration, with newest lauds have sped to thee, O Mighty. As yearning wives cleave to their yearning husband, so cleave our hymns to thee, O Lord most potent.\np:Strong Deva, the riches which thy hands have holden from days of old have perished not nor wasted. Splendid art thou, O Indra, wise, unbending: strengthen us with might, O Lord of Power.\np:O mighty Indra, Sure leader, yoker of the Tawny Coursers. May he, enriched with meditation, come soon and early.",
    "next": "01063",
    "previous": "01061",
    "book": "01"
  },
  "created": 1638553340385,
  "updated": 1638646518855
}