{
  "key": "01064",
  "title": "RigVeda Hymn 01064",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LXIV. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01064.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01063.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01065.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXIV. Maruts.</h3>  \n<p>1. BRING for the manly host, wise and majestical, O Nodhas, for the Maruts bring thou a pure gift.<br> I deck my songs as one deft-handed, wise in mind prepares the water that hath power in solemn rites.<br> 2 They spring to birth, the lofty Ones, the Bulls of Heaven, divine, the youths of Rudra, free from spot and stain;<br> The purifiers, shining brightly even as suns, awful of form like giants, scattering rain-drops down.<br> 3 Young Rudras, demon-slayers, never growing old, they have waxed, even as mountains, irresistible.<br> They make all beings tremble with their mighty strength, even the very strongest, both of earth and heaven.<br> 4 With glittering ornaments they deck them forth for show; for beauty on their breasts they bind their chains of gold.<br> The lances on their shoulders pound to pieces; they were born together, of themselves, the Men of Heaven.<br> 5 Loud roarers, giving strength, devourers of the foe, they make the winds, they make the lightnings with their powers.<br> The restless shakers drain the udders of the sky, and ever wandering round fill the earth full with milk.<br> 6 The bounteous Maruts with the fatness dropping milk fill full the waters which avail in solemn rites.<br> They lead, as &#146;twere, the Strong Horse forth, that it may rain: they milk the thundering, the never-failing spring.<br> 7 Mighty, with wondrous power and marvellously bright, selfstrong like mountains, ye glide swiftly on your way.<br> Like the wild elephants ye eat the forests up when ye assume your strength among the bright red flames.<br> 8 Exceeding wise they roar like lions mightily, they, all-possessing, are beauteous as antelopes;<br> Stirring the darkness with lances and spotted deer, combined as priests, with serpents' fury through their might.<br> 9 Heroes who march in companies, befriending man, with serpents' ire through strength, ye greet the earth and heaven.<br> Upon the seats, O Maruts, of your chariots, upon the cars stands lightning visible as light.<br> 10 Lords of all riches, dwelling in the home of wealth, endowed with mighty vigour, singers loud of voice,<br> Heroes, of powers infinite, armed with strong men's rings, the archers, they have laid the arrow on their arms.<br> 11 They who with golden fellies make the rain increase drive forward the big clouds like wanderers on the way.<br> Self-moving, brisk, unwearied, they o&#146;erthrow the firm; the Maruts with bright lances make all things to reel.<br> 12 The progeny of Rudra we invoke with prayer, the brisk, the bright, the worshipful, the active Ones<br> To the strong band of Maruts cleave for happiness, the chasers of the sky, impetuous, vigorous.<br> 13 Maruts, the man whom ye have guarded with your help, he verily in strength surpasseth all mankind.<br> Spoil with his steeds he gaineth, treasure with his men; he winneth honourable strength and prospereth.<br> 14 O Maruts, to the worshippers give glorious strength invincible in battle, brilliant, bringing wealth,<br> Praiseworthy, known to all men. May we foster well, during a hundred winters, son and progeny.<br> 15 Will ye then, O ye Maruts, grant us riches, durable, rich in men, defying onslaught.<br> A hundred, thousandfold, ever increasing? May he, enriched with prayer, come soon and early.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01065.htm\">Next: HYMN LXV. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01064.html",
  "api": "json/hymns/01064.json",
  "data": {
    "key": "01064",
    "title": "HYMN LXIV. Devas.",
    "describe": "BRING for the manly host, wise and majestical, for the Devas bring thou a pure gift.",
    "feecting": "p:BRING for the manly host, wise and majestical, for the Devas bring thou a pure gift.\np: I deck my songs as one deft-handed, wise in mind prepares the water that hath power in solemn rites.\r\np:They spring to birth, the lofty Ones, the Bulls of Heaven, divine, the youths of Soma, free from spot and . purifiers, shining brightly even as suns, awful of form like giants, scattering rain-drops down.\np:Young Somas, demon-slayers, never growing old, they have waxed, even as mountains, irresistible. They make all beings tremble with their mighty strength, even the very strongest, both of Earth and Heaven.\np:With glittering ornaments they deck them forth for show; for beauty on their breasts they bind their chains of gold. The lances on their shoulders pound to pieces; they were born together, of themselves, the Men of Heaven.\np:Loud roarers, giving strength, they make the winds, they make the lightnings with their powers. The restless shakers drain the udders of the sky, and ever wandering round fill the Earth full with milk.\np:The bounteous Devas fill full the waters which avail in solemn rites. They lead, as ’twere, the Strong Horse forth, that he may rain: they milk the thundering, the never-failing spring.\np:Mighty, with wondrous power and marvellously bright, selfstrong like mountains, ye glide swiftly on your way. Like the wild elephants ye eat the forests up when ye assume your strength among the bright red flames.\np:Exceeding wise they roar like lions mightily, they, all-possessing, are beauteous as antelopes; Stirring the darkness with lances and spotted deer, combined as monks, with serpents' fury through their might.\np:Heroes who march in companies, befriending man, with serpents' ire through strength, ye greet the Earth and Heaven. Upon the seats, O Devas, of your chariots, upon the cars stands lightning visible as light.\np:Lords of all riches, dwelling in the home of wealth, endowed with mighty vigour, singers loud of voice. Heroes, of powers infinite, armed with strong men's rings, the archers, they have laid the arrow on their arms.\np:They who with golden fellies make the rain increase drive forward the big clouds like wanderers on the way. Self-moving, brisk, unwearied, they o’erthrow the firm; the Devas with bright lances make all things to reel.\np:The progeny of Soma we invoke with prayer, the brisk, the bright, the worshipful, the active Ones. To the strong band of Devas cleave for happiness, the chasers of the sky, impetuous, vigorous.\np:Devas, the man whom ye have guarded with your help, he verily in strength surpasseth all mankind. Spoil with his steeds he gaineth, treasure with his men; he winneth honourable strength and prospereth.\np:O Devas, to the worshippers give glorious strength invincible in battle, brilliant, bringing wealth, Praiseworthy, known to all men. May we foster well, during a hundred winters, son and progeny.\np:Will ye then, O ye Devas, grant us riches, durable, rich in men, defying onslaught. A hundred, thousandfold, ever increasing? May he, enriched with meditation, come soon and early.",
    "meta": {
      "next": "01065",
      "previous": "01063",
      "book": "01",
      "original": "https://sacred-texts.com/hin/rigveda/rv01064.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv01064.htm"
    },
    "deities": [
      {
        "name": "O Devas",
        "hymns": [
          {
            "key": "01064",
            "title": "HYMN LXIV. Devas."
          },
          {
            "key": "01064",
            "title": "HYMN LXIV. Devas."
          }
        ]
      },
      {
        "name": "O ye ",
        "hymns": [
          {
            "key": "01064",
            "title": "HYMN LXIV. Devas."
          }
        ]
      }
    ]
  },
  "created": 1638553350907,
  "updated": 1667442751897
}