{
  "key": "01087",
  "title": "RigVeda Hymn 01087",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LXXXVII. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01087.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01086.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01088.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXVII. Maruts.</h3>  \n<p>1. LOUD Singers, never humbled, active, full of strength, immovable, impetuous, manliest, best-beloved,<br> They have displayed themselves with glittering ornaments, a few in number only, like the heavens with stars.<br> 2 When, Maruts, on the steeps ye pile the moving cloud, ye are like birds on whatsoever path it be.<br> Clouds everywhere shed forth the rain upon your cars. Drop fatness, honey-hued, for him who sings your praise.<br> 3 Earth at their racings trembles as if weak and worn, when on their ways they yoke their cars for victory.<br> They, sportive, loudly roaring, armed with glittering spears, shakers of all, themselves admire their mightiness.<br> 4 Self-moving is that youthful band, with spotted steeds; thus it hath lordly sway, endued with power and might.<br> Truthful art thou, and blameless, searcher out of sin: so thou, Strong Host, wilt be protector of this prayer.<br> 5 We speak by our descent from our primeval Sire; our tongue, when we behold the Soma, stirs itself.<br> When, shouting, they had joined Indra in toil of fight, then only they obtained their sacrificial names.<br> 6 Splendours they gained for glory, they who wear bright rings; rays they obtained, and men to celebrate their praise.<br> Armed with their swords, impetuous and fearing naught, they have possessed the Maruts&#146; own beloved home.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01088.htm\">Next: HYMN LXXXVIII. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01087.html",
  "api": "json/hymns/01087.json",
  "data": {
    "title": "HYMN LXXXVII. Devas.",
    "describe": "LOUD Singers, never humbled, active, full of strength, immovable, impetuous, manliest, best-beloved, they have displayed themselves with glittering ornaments, a few in number only, like the heavens with stars.",
    "feecting": "p:LOUD Singers, never humbled, active, full of strength, immovable, impetuous, manliest, best-beloved, they have displayed themselves with glittering ornaments, a few in number only, like the heavens with stars.\np:When, Devas, on the steeps ye pile the moving cloud, ye are like birds on whatsoever path it be.\np: Clouds everywhere shed forth the rain upon your cars. Drop fatness, honey-hued, for him who sings your praise.\r\np:Earth at their racings trembles as if weak and worn, when on their ways they yoke their cars for victory. They, sportive, loudly roaring, armed with glittering spears, shakers of all, themselves admire their mightiness.\np:Self-moving is that youthful band, with spotted steeds; thus it hath lordly sway, endued with power and might. Truthful art thou, and blameless, searcher out of sin: so thou, Strong Host, wilt be protector of this prayer.\np:We speak by our descent from our primeval Sire; our tongue, when we behold the Soma, stirs itself. When, shouting, they had joined Indra in toil of fight, then only they obtained their sacrificial names.\np:Splendours they gained for glory, they who wear bright rings; rays they obtained, and men to celebrate their praise. Armed with their swords, impetuous and fearing naught, they have possessed the Devas&#146; own beloved home.",
    "next": "01088",
    "previous": "01086",
    "book": "01"
  },
  "created": 1638553471998,
  "updated": 1638647072150
}