{
  "key": "01088",
  "title": "RigVeda Hymn 01088",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LXXXVIII. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01088.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01087.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01089.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXVIII. Maruts.</h3>  \n<p>1. COME hither, Maruts, on your lightning laden cars, sounding with sweet songs, armed with lances, winged with steeds.<br> Fly unto us with noblest food, like birds, O ye of mighty power.<br> 2 With their red-hued or, haply, tawny coursers which speed their chariots on, they come for glory.<br> Brilliant like gold is he who holds the thunder. Earth have they smitten with the chariot's felly.<br> 3 For beauty ye have swords upon your bodies. As they stir woods so may they stir our spirits.<br> For your sake, O ye Maruts very mighty and well-born, have they set the stone, in motion.<br> 4 The days went round you and came back O yearners, back, to this prayer and to this solemn worship.<br> The Gotamas making their prayer with singing have pushed the well's lid up to drink the water.<br> 5 No hymn way ever known like this aforetime which Gotama sang forth for you, O Maruts,<br> What time upon your golden wheels he saw you, wild boars rushing about with tusks of iron.<br> 6 To you this freshening draught of Soma rusheth, O Maruts, like the voice of one who prayeth.<br> It rusheth freely from our hands as these libations wont to flow.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01089.htm\">Next: HYMN LXXXIX. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01088.html",
  "api": "json/hymns/01088.json",
  "data": {
    "title": "HYMN LXXXVIII. Devas.",
    "describe": "COME hither, Devas, on your lightning laden cars, sounding with sweet songs, armed with lances, winged with steeds.",
    "feecting": "p:COME hither, Devas, on your lightning laden cars, sounding with sweet songs, armed with lances, winged with steeds.\np: Fly unto us with noblest food, like birds, O ye of mighty power.\r\np:With their red-hued or, haply, tawny coursers which speed their chariots on, they come for glory. Brilliant like gold is he who holds the thunder. Earth have they smitten with the chariot's felly.\np:For beauty ye have swords upon your bodies. As they stir woods s. May they stir our spirits. For your sake, O ye Devas very mighty and well-born, have they set the stone, in motion.\np:The days went round you and came back O yearners, back, to this prayer and to this solemn worship. The Gotamas making their prayer with singing have pushed the well's lid up to drink the water.\np:No hymn way ever known like this aforetime which Gotama sang forth for you, O Devas, What time upon your golden wheels he saw you, wild boars rushing about with tusks of iron.\np:To you this freshening draught of Soma rusheth, O Devas, like the voice of one who prayeth. It rusheth freely from our hands as these libations wont to flow.",
    "next": "01089",
    "previous": "01087",
    "book": "01"
  },
  "created": 1638553477255,
  "updated": 1638647072151
}