{
  "key": "01085",
  "title": "RigVeda Hymn 01085",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LXXXV. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01085.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01084.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01086.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXV. Maruts.</h3>  \n<p>1. THEY who are glancing forth, like women, on their way, doers of mighty deeds, swift racers, Rudra's Sons,<br> The Maruts have made heaven and earth increase and grow: in sacrifices they delight, the strong and wild.<br> 2 Grown to their perfect strength greatness have they attained; the Rudras have established their abode in heaven.<br> Singing their song of praise and generating might, they have put glory on, the Sons whom P&#7771;&#347;ni bare.<br> 3 When, Children of the Cow, they shine in bright attire, and on their fair limbs lay their golden ornaments,<br> They drive away each adversary from their path, and, following their traces, fatness floweth down,<br> 4 When, mighty Warriors, ye who glitter with your spears, o&#146;erthrowing with your strength e&#146;en what is ne&#146;er o&#146;erthrown,<br> When, O ye Maruts, ye the host that send the rain, had harnessed to your cars the thought-fleet spotted deer.<br> 5 When ye have harnessed to your cars the spotted deer, urging the thunderbolt, O Maruts, to the fray,<br> Forth rush the torrents of the dark red stormy cloud, and moisten, like a skin, the earth with water-floods.<br> 6 Let your swift-gliding coursers bear you hitherward with their fleet pinions. Come ye forward with your arms.<br> Sit on the grass; a wide seat hath been made for you: delight yourselves, O Maruts, in the pleasant food.<br> 7 Strong in their native strength to greatness have they grown, stepped to the firmament and made their dwelling wide.<br> When Vi&#7779;&#7751;u saved the Soma bringing wild delight, the Maruts sate like birds on their dear holy grass.<br> 8 In sooth like heroes fain for fight they rush about, like combatants fame-seeking have they striven in war.<br> Before the Maruts every creature is afraid: the men are like to Kings, terrible to behold.<br> 9 When Tva&#7779;&#7789;ar deft of hand had turned the thunderbolt, golden, with thousand edges, fashioned more skilfully,<br> Indra received it to perform heroic deeds. V&#7771;tra he slew, and forced the flood of water forth.<br> 10 They with their vigorous strength pushed the well up on high, and clove the cloud in twain though it was passing strong.<br> The Maruts, bounteous Givers, sending forth their voice, in the wild joy of Soma wrought their glorious deeds.<br> 11 They drave the cloud transverse directed hitherward, and poured the fountain forth for thirsting Gotama.<br> Shining with varied light they come to him with help: they with their might fulfilled the longing of the sage.<br> 12 The shelters which ye have for him who lauds you, bestow them threefold on the man who offers.<br> Extend the same boons unto us, ye Maruts. Give us, O Heroes, wealth with noble offspring.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01086.htm\">Next: HYMN LXXXVI. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01085.html",
  "api": "json/hymns/01085.json",
  "data": {
    "title": "HYMN LXXXV. Devas.",
    "describe": "THEY who are glancing forth, like women, on their way, doers of mighty deeds, swift racers, Soma's Sons, the Devas have made Heaven and Earth increase and grow: in offers they delight, the strong and wild.",
    "feecting": "p:THEY who are glancing forth, like women, on their way, doers of mighty deeds, swift racers, Soma's Sons, the Devas have made Heaven and Earth increase and grow: in offers they delight, the strong and wild.\np:Grown to their perfect strength greatness have they attained; the Somas have established their abode in Heaven.\np: Singing their song of praise and generating might, they have put glory on, the Sons whom P&#7771;&#347;ni bare.\r\np:When, Children of the Cow, they shine in bright attire, and on their fair limbs lay their golden ornaments, they drive away each adversary from their path, and, following their traces, fatness floweth down,\np:When, mighty Warriors, ye who glitter with your spears, o&#146;erthrowing with your strength e&#146;en what is ne&#146;er o&#146;erthrown, when, O ye Devas, ye the host that send the rain, had harnessed to your cars the thought-fleet spotted deer.\np:When ye have harnessed to your cars the spotted deer, urging the thunderbolt, O Devas, to the fray, forth rush the torrents of the dark red stormy cloud, and moisten, like a skin, the Earth with water-floods.\np:Let your swift-gliding coursers bear you hitherward with their fleet pinions. Come ye forward with your arms. Sit on the grass; a wide seat hath been made for you: delight yourselves, O Devas, in the pleasant food.\np:Strong in their native strength to greatness have they grown, stepped to the Firmament and made their dwelling wide. When Vi&#7779;&#7751;u saved the Soma bringing wild delight, the Devas sate like birds on their dear holy grass.\np:In sooth like heroes fain for fight they rush about, like combatants fame-seeking have they striven in war. Before the Devas every creature is afraid: the men are like to Kings, terrible to behold.\np:When Tva&#7779;&#7789;ar deft of hand had turned the thunderbolt, golden, with thousand edges, fashioned more skilfully, Indra received it to perform heroic deeds. V&#7771;tra he slew, and forced the flood of water forth.\np:They with their vigorous strength pushed the well up on high, and clove the cloud in twain though it was passing strong. The Devas, bounteous Givers, sending forth their voice, in the wild joy of Soma wrought their glorious deeds.\np:They drave the cloud transverse directed hitherward, and poured the fountain forth for thirsting Gotama. Shining with varied light they come to him with help: they with their might fulfilled the longing of the sage.\np:The shelters which ye have for him who lauds you, bestow them threefold on the man who offers. Extend the same boons unto us, ye Devas. Give us, O Heroes, wealth with noble offspring.",
    "next": "01086",
    "previous": "01084",
    "book": "01"
  },
  "created": 1638553461479,
  "updated": 1638791780303
}