{
  "key": "01086",
  "title": "RigVeda Hymn 01086",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LXXXVI. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01086.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01085.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01087.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXVI. Maruts.</h3>  \n<p>1. THE best of guardians hath that man within whose dwelling place ye drink,<br> O Maruts, giants of the sky.<br> 2 Honoured with sacrifice or with the worship of the sages&#146; hymns,<br> O Maruts, listen to the call.<br> 3 Yea, the strong man to whom ye have vouchsafed to give a sage, shall move<br> Into a stable rich in kine.<br> 4 Upon this hero's sacred grass Soma is poured in daily rites:<br> Praise and delight are sung aloud.<br> 5 Let the strong Maruts hear him, him surpassing all men: strength be his<br> That reaches even to the Sun.<br> 6 For, through the swift Gods&#146; loving help, in many an autumn, Maruts, we<br> Have offered up our sacrifice.<br> 7 Fortunate shall that mortal be, O Maruts most adorable,<br> Whose offerings ye bear away.<br> 8 O Heroes truly strong, ye know the toil of him who sings your praise,<br> The heart's desire of him who loves.<br> 9 O ye of true strength, make this thing manifest by your greatness: strike<br> The demon with your thunderbolt.<br> 10 Conceal the horrid darkness, drive far from us each devouring fiend.<br> Create the light for which we long.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01087.htm\">Next: HYMN LXXXVII. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01086.html",
  "api": "json/hymns/01086.json",
  "data": {
    "title": "HYMN LXXXVI. Devas.",
    "describe": "THE best of guardians hath that man within whose dwelling place ye drink, O Devas, giants of the sky.",
    "feecting": "p:THE best of guardians hath that man within whose dwelling place ye drink, O Devas, giants of the sky.\np:Honoured with offering or with the worship of the sages&#146; hymns, O Devas, listen to the call.\np:Yea, the strong man to whom ye have vouchsafed to give a sage, shall move Into a stable rich in kine.\np:Upon this hero's sacred grass Soma is poured in daily rites: Praise and delight are sung aloud.\np:Let the strong Devas hear him, him surpassing all men: strength be his That reaches even to the Sun.\np:For, through the swift Devas&#146; loving help, in many an autumn, Devas, we Have offered up our offering.\np:Fortunate shall that mortal be, O Devas most adorable, whose offerings ye bear away.\np:O Heroes truly strong, ye know the toil of him who sings your praise, the heart's desire of him who loves.\np:O ye of true strength, make this thing manifest by your greatness: strike The demon with your thunderbolt.\np:Conceal the horrid darkness, drive far from us each devouring fiend.\np: Create the light for which we long.",
    "next": "01087",
    "previous": "01085",
    "book": "01"
  },
  "created": 1638553466738,
  "updated": 1638792007388
}