{
  "key": "01089",
  "title": "RigVeda Hymn 01089",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LXXXIX. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01089.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01088.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01090.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXIX. Vi&#347;vedevas.</h3>  \n<p>1. MAY powers auspicious come to us from every side, never deceived, unhindered, and victorious,<br> That the Gods ever may be with us for our gain, our guardians day by day unceasing in their care.<br> 2 May the auspicious favour of the Gods be ours, on us descend the bounty of the righteous Gods.<br> The friendship of the Gods have we devoutly sought: so may the Gods extend our life that we may live.<br> 3 We call them hither with a hymn of olden time, Bhaga, the friendly Dak&#7779;a, Mitra, Aditi,<br> Aryaman, Varu&#7751;a, Soma, the A&#347;vins. May Sarasvat&#299;, auspicious, grant felicity.<br> 4 May the Wind waft to us that pleasant medicine, may Earth our Mother give it, and our Father Heaven,<br> And the joy-giving stones that press the Soma's juice. A&#347;vins, may ye, for whom our spirits long, hear this.<br> 5 Him we invoke for aid who reigns supreme, the Lord of all that stands or moves, inspirer of the soul,<br> That P&#363;&#7779;an may promote the increase of our wealth, our keeper and our guard infallible for our good.<br> 6 Illustrious far and wide, may Indra prosper us: may P&#363;&#7779;an prosper us, the Master of all wealth.<br> May T&#257;rk&#7779;ya with uninjured fellies prosper us: B&#7771;haspati vouchsafe to us prosperity.<br> 7 The Maruts, Sons of P&#7771;&#347;ni, borne by spotted steeds, moving in glory, oft visiting holy rites,<br> Sages whose tongue is Agni, brilliant as the Sun,&#151;hither let all the Gods for our protection come.<br> 8 Gods, may we with our ears listen to what is good, and with our eyes see what is good, ye Holy Ones.<br> With limbs and bodies firm may we extolling you attain the term of life appointed by the Gods.<br> 9 A hundred autumns stand before us, O ye Gods, within whose space ye bring our bodies to decay;<br> Within whose space our sons become fathers in turn. Break ye not in the midst our course of fleeting life.<br> 10 Aditi is the heaven, Aditi is mid-air, Aditi is the Mother and the Sire and Son.<br> Aditi is all Gods, Aditi five-classed men, Aditi all that hath been born and shall be born.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01090.htm\">Next: HYMN XC. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01089.html",
  "api": "json/hymns/01089.json",
  "data": {
    "title": "HYMN LXXXIX. Vi&#347;vedevas.",
    "describe": "MAY powers auspicious come to us from every side, never deceived, unhindered, and victorious, that the Devas eve.",
    "feecting": "p:MAY powers auspicious come to us from every side, never deceived, unhindered, and victorious, that the Devas eve. May be with us for our gain, our guardians day by day unceasing in their care.\np:May the auspicious favour of the Devas be ours, on us descend the bounty of the righteous Devas.\np: The friendship of the Devas have we devoutly sought: s. May the Devas extend our life that we may live.\r\np:We call them hither with a hymn of olden time, Bhaga, the friendly Dak&#7779;a, Mitra, Aditi, Aryaman, Varu&#7751;a, Soma, the A&#347;vins. May Sarasvat&#299;, auspicious, grant felicity.\np:May the Wind waft to us that pleasant medicine. May Earth our Mother give it, and our Father Heaven, and the joy-giving stones that press the Soma's juice. A&#347;vins. May ye, for whom our spirits long, hear this.\np:Him we invoke for aid who reigns supreme, the Lord of all that stands or moves, inspirer of the soul, that P&#363;&#7779;a. May promote the increase of our wealth, our keeper and our guard infallible for our good.\np:Illustrious far and wide. May Indra prosper us. May P&#363;&#7779;an prosper us, the Master of all wealth. May T&#257;rk&#7779;ya with uninjured fellies prosper us: B&#7771;haspati vouchsafe to us prosperity.\np:The Devas, Sons of P&#7771;&#347;ni, borne by spotted steeds, moving in glory, oft visiting holy rites, Sages whose tongue is Agni, brilliant as the Sun,&#151;hither let all the Devas for our protection come.\np:Devas. May we with our ears listen to what is good, and with our eyes see what is good, ye Holy Ones. With limbs and bodies fir. May we extolling you attain the term of life appointed by the Devas.\np:A hundred autumns stand before us, O ye Devas, within whose space ye bring our bodies to decay; Within whose space our sons become fathers in turn. Break ye not in the midst our course of fleeting life.\np:Aditi is the Heaven, Aditi is mid-air, Aditi is the Mother and the Sire and Son. Aditi is all Devas, Aditi five-classed men, Aditi all that hath been born and shall be born.",
    "next": "01090",
    "previous": "01088",
    "book": "01"
  },
  "created": 1638553482528,
  "updated": 1638646518880
}