{
  "key": "01083",
  "title": "RigVeda Hymn 01083",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN LXXXIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01083.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01082.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01084.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXIII. Indra.</h3>  \n<p>1. INDRA, the mortal man well guarded by thine aid goes foremost in the wealth of horses and of kine.<br> With amplest wealth thou fillest him, as round about the waters clearly seen afar fill Sindhu full.<br> 2 The heavenly Waters come not nigh the priestly bowl: they but look down and see how far mid-air is spread:<br> The Deities conduct the pious man to them: like suitors they delight in him who loveth prayer.<br> 3 Praiseworthy blessing hast thou laid upon the pair who with uplifted ladle serve thee, man and wife.<br> Unchecked he dwells and prospers in thy law: thy power brings blessing to the sacrificer pouring gifts.<br> 4 First the A&#7749;girases won themselves vital power, whose fires were kindled through good deeds and sacrifice.<br> The men together found the Pa&#7751;i's hoarded wealth, the cattle, and the wealth in horses and in kine.<br> 5 Atharvan first by sacrifices laid the paths then, guardian of the Law, sprang up the loving Sun.<br> U&#347;an&#257; K&#257;vya straightway hither drove the kine. Let us with offerings honour Yama's deathless birth.<br> 6 When sacred grass is trimmed to aid the auspicious work, or the hymn makes its voice of praise sound to the sky.<br> Where the stone rings as &#146;twere a singer skilled in laud,&#151;Indra in truth delights when these come near to him.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01084.htm\">Next: HYMN LXXXIV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01083.html",
  "api": "json/hymns/01083.json",
  "data": {
    "title": "HYMN LXXXIII. Indra.",
    "describe": "INDRA, the mortal man well guarded by thine aid goes foremost in the wealth of horses and of kine.",
    "feecting": "p:INDRA, the mortal man well guarded by thine aid goes foremost in the wealth of horses and of kine.\np: With amplest wealth thou fillest him, as round about the waters clearly seen afar fill Sindhu full.\r\np:The heavenly Waters come not nigh the priestly bowl: they but look down and see how far mid-air is spread: The Deities conduct the pious man to them: like suitors they delight in him who loveth prayer.\np:Praiseworthy blessing hast thou laid upon the pair who with uplifted ladle serve thee, man and wife. Unchecked he dwells and prospers in thy law: thy power brings blessing to the offeringr pouring gifts.\np:First the A&#7749;girases won themselves vital power, whose fires were kindled through good deeds and offering. The men together found the Pa&#7751;i's hoarded wealth, the cattle, and the wealth in horses and in kine.\np:Atharvan first by offers laid the paths then, guardian of the Law, sprang up the loving Sun. U&#347;an&#257; K&#257;vya straightway hither drove the kine. Let us with offerings honour Yama's deathless birth.\np:When sacred grass is trimmed to aid the auspicious work, or the hymn makes its voice of praise sound to the sky. Where the stone rings as &#146;twere a singer skilled in laud,&#151;Indra in truth delights when these come near to him.",
    "next": "01084",
    "previous": "01082",
    "book": "01"
  },
  "created": 1638553450937,
  "updated": 1638791252591
}