{
  "key": "01095",
  "title": "RigVeda Hymn 01095",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN XCV. Agni</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01095.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01094.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01096.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCV. Agni</h3>  \n<p>1. To fair goals travel Two unlike in semblance: each in succession nourishes an infant.<br> One bears a Godlike Babe of golden colour; bright and fair-shining, is he with the other.<br> 2 Tva&#7779;&#7789;ar's ten daughters, vigilant and youthful, produced this Infant borne to sundry quarters.<br> They bear around him whose long flames are pointed, fulgent among mankind with native splendour.<br> 3. Three several places of his birth they honour, in mid-air, in the heaven, and in the waters.<br> Governing in the east of earthly regions, the seasons hath he stablished in their order.<br> 4 Who of you knows this secret One? The Infant by his own nature hath brought forth his Mothers.<br> The germ of many, from the waters' bosom he goes forth, wise and great, of Godlike nature.<br> 5 Visible, fair, he grows in native brightness uplifted in the lap of waving waters.<br> When he was born both Tva&#7779;&#7789;ar's worlds were frightened: they turn to him and reverence the Lion.<br> 6 The Two auspicious Ones, like women, tend him: like lowing cows they seek him in their manner.<br> He is the Lord of Might among the mighty; him, on the right, they balm with their oblations.<br> 7 Like Savitar his arms with might he stretches; awful, he strives grasping the world's two borders.<br> He forces out from all a brilliant vesture, yea, from his Mothers draws he forth new raiment.<br> 8 He makes him a most noble form of splendour, decking him in his home with milk and waters.<br> The Sage adorns the depths of air with wisdom: this is the meeting where the Gods are worshipped.<br> 9 Wide through the firmament spreads forth triumphant the far-resplendent strength of thee the Mighty.<br> Kindled by us do thou preserve us, Agni, with all thy self-bright undiminished succours.<br> 10 In dry spots he makes stream, and course, and torrent, and inundates the earth with floods that glisten.<br> All ancient things within his maw he gathers, and moves among the new fresh-sprouting grasses.<br> 11 Fed with our fuel, purifying Agni, so blaze to us auspiciously for glory.<br> This prayer of ours may Varu&#7751;a grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01096.htm\">Next: HYMN XCVI. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01095.html",
  "api": "json/hymns/01095.json",
  "data": {
    "title": "HYMN XCV. Agni",
    "describe": "To fair goals travel Two unlike in semblance: each in succession nourishes an infant.",
    "feecting": "p:To fair goals travel Two unlike in semblance: each in succession nourishes an infant.\np: One bears a Godlike Babe of golden colour; bright and fair-shining, is he with the other.\r\np:Tva&#7779;&#7789;ar's ten daughters, vigilant and youthful, produced this Infant borne to sundry quarters. They bear around him whose long flames are pointed, fulgent among mankind with native splendour.\np:Three several places of his birth they honour, in mid-air, in the Heaven, and in the waters. Governing in the east of earthly regions, the seasons hath he stablished in their order.\np:Who of you knows this secret One? The Infant by his own nature hath brought forth his Mothers. The germ of many, from the waters' bosom he goes forth, wise and great, of Godlike nature.\np:Visible, fair, he grows in native brightness uplifted in the lap of waving waters. When he was born both Tva&#7779;&#7789;ar's worlds were frightened: they turn to him and reverence the Lion.\np:The Two auspicious Ones, like women, tend him: like lowing cows they seek him in their manner. He is the Lord of Might among the mighty; him, on the right, they balm with their oblations.\np:Like Indra his arms with might he stretches; awful, he strives grasping the world's two borders. He forces out from all a brilliant vesture, yea, from his Mothers draws he forth new raiment.\np:He makes him a most noble form of splendour, decking him in his home with milk and waters. The Sage adorns the depths of air with wisdom: this is the meeting where the Devas are worshipped.\np:Wide through the Firmament spreads forth triumphant the far-resplendent strength of thee the Mighty. Kindled by us do thou preserve us, Agni, with all thy self-bright undiminished succours.\np:In dry spots he makes stream, and course, and torrent, and inundates the Earth with floods that glisten. All ancient things within his maw he gathers, and moves among the new fresh-sprouting grasses.\np:Fed with our fuel, purifying Agni, so blaze to us auspiciously for glory. This prayer of our. May Varu&#7751;a grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.",
    "next": "01096",
    "previous": "01094",
    "book": "01"
  },
  "created": 1638553514098,
  "updated": 1638647072159
}