{
  "key": "01096",
  "title": "RigVeda Hymn 01096",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN XCVI. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01096.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01095.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01097.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCVI. Agni.</h3>  \n<p>1. HE in the ancient way by strength engendered, lo! straight hath taken to himself all wisdom.<br> The waters and the bowl have made him friendly. The Gods possessed the wealth bestowing Agni.<br> 2 At &#256;yu's ancient call he by his wisdom gave all this progeny of men their being,<br> And, by refulgent light, heaven and the waters. The Gods possessed the wealth. bestowing Agni.<br> 3 Praise him, ye &#256;ryan folk, as chief performer of sacrifice adored and ever toiling,<br> Well-tended, Son of Strength, the Constant Giver. The Gods possessed the wealth bestowing Agni.<br> 4 That M&#257;tari&#347;van rich in wealth and treasure, light-winner, finds a pathway for his offspring.<br> Guard of our folk, Father of earth and heaven. The Gods possessed the wealth bestowing Agni.<br> 5 Night and Dawn, changing each the other's colour, meeting together suckle one same Infant:<br> Golden between the heaven and earth he shineth. The Gods possessed the wealth bestowing Agni.<br> 6 Root of wealth, gathering-place of treasures, banner of sacrifice, who grants the suppliant's wishes:<br> Preserving him as their own life immortal, the Gods possessed the wealth-bestowing Agni.<br> 7 Now and of old the home of wealth, the mansion of what is born and what was born aforetime,<br> Guard of what is and what will be hereafter,&#151;the Gods possessed the wealth bestowing Agni.<br> 8 May the Wealth-Giver grant us conquering riches; may the Wealth-Giver grant us wealth with heroes.<br> May the Wealth-Giver grant us food with offspring, and length of days may the Wealth-Giver send us.<br> 9 Fed with our fuel, purifying Agni, so blaze to us auspiciously for glory.<br> This prayer of ours may Varu&#7751;a grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01097.htm\">Next: HYMN XCVII. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01096.html",
  "api": "json/hymns/01096.json",
  "data": {
    "title": "HYMN XCVI. Agni.",
    "describe": "HE in the ancient way by strength engendered, lo!",
    "feecting": "p:HE in the ancient way by strength engendered, lo! straight hath taken to himself all wisdom.\np: The waters and the bowl have made him friendly. The Devas possessed the wealth bestowing Agni.\r\np:At &#256;yu's ancient call he by his wisdom gave all this progeny of men their being, and, by refulgent light. Heaven and the waters. The Devas possessed the wealth. bestowing Agni.\np:Praise him, ye &#256;ryan folk, as chief performer of offering adored and ever toiling, well-tended, Son of Strength, the Constant Giver. The Devas possessed the wealth bestowing Agni.\np:That M&#257;tari&#347;van rich in wealth and treasure, light-winner, finds a pathway for his offspring. Guard of our folk, Father of Earth and Heaven. The Devas possessed the wealth bestowing Agni.\np:Night and Dawn, changing each the other's colour, meeting together suckle one same Infant: Golden between the Heaven and Earth he shineth. The Devas possessed the wealth bestowing Agni.\np:Root of wealth, gathering-place of treasures, banner of offering, who grants the suppliant's wishes: Preserving him as their own life immortals possessed the wealth-bestowing Agni.\np:Now and of old the home of wealth, the mansion of what is born and what was born aforetime, Guard of what is and what will be hereafter,&#151;the Devas possessed the wealth bestowing Agni.\np:May the Wealth-Giver grant us conquering riches. May the Wealth-Giver grant us wealth with heroes. May the Wealth-Giver grant us food with offspring, and length of day. May the Wealth-Giver send us.\np:Fed with our fuel, purifying Agni, so blaze to us auspiciously for glory. This prayer of our. May Varu&#7751;a grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.",
    "next": "01097",
    "previous": "01095",
    "book": "01"
  },
  "created": 1638553519634,
  "updated": 1638790697591
}