{
  "key": "01094",
  "title": "RigVeda Hymn 01094",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN XCIV. Agni</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01094.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01093.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01095.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCIV. Agni</h3>  \n<p>1 FOR J&#257;tavedas worthy of our praise will we frame with our mind this eulogy as &#146;twere a car.<br> For good, in his assembly, is this care of ours. Let us not, in thy friendship, Agni, suffer harm.<br> 2 The man for whom thou sacrificest prospereth, dwelleth without a foe, gaineth heroic might.<br> He waxeth strong, distress never approacheth him. Let us not, in thy friendship, Agni, suffer harm.<br> 3 May we have power to kindle thee. Fulfil our thoughts. In thee the Gods eat the presented offering,<br> Bring hither the &#256;dityas, for we long for them. Let us not in thy friendship, Agni, suffer harm.<br> 4 We will bring fuel and prepare burnt offerings, reminding thee at each successive festival.<br> Fulfil our thought that so we may prolong our lives. Let us not in thy friendship, Agni, suffer harm.<br> 5 His ministers move forth, the guardians of the folk, protecting quadruped and biped with their rays.<br> Mighty art thou, the wondrous herald of the Dawn. Let us not in thy friendship, Agni, suffer harm.<br> 6 Thou art Presenter and the chief Invoker, thou Director, Purifier, great High Priest by birth.<br> Knowing all priestly work thou perfectest it, Sage. Let us not in thy friendship, Agni, suffer harm.<br> 7 Lovely of form art thou, alike on every side; though far, thou shinest brightly as if close at hand.<br> O God, thou seest through even the dark of night. Let us not in thy friendship, Agni, suffer harm.<br> 8 Gods, foremost be his car who pours libations out, and let our hymn prevail o&#146;er evil-hearted men.<br> Attend to this our speech and make it prosper well. Let us not in thy friendship, Agni, suffer harm.<br> 9 Smite with thy weapons those of evil speech and thought, devouring demons, whether near or tar away.<br> Then to the singer give free way for sacrifice. Let us not in thy friendship, Agni, suffer harm.<br> 10 When to thy chariot thou hadst yoked two red steeds and two ruddy steeds, wind-sped, thy roar was like a bull's.<br> Thou with smoke-bannered flame attackest forest trees. Let us not in thy friendship, Agni, suffer harm.<br> 11 Then at thy roar the very birds are terrified, when, eating-up the grass, thy sparks fly forth abroad.<br> Then is it easy for thee and thy car to pass. Let us not in thy friendship, Agni, suffer harm.<br> 12 He hath the Power to soothe Mitra and Varu&#7751;a: wonderful is the Maruts&#146; wrath when they descend.<br> Be gracious; let their hearts he turned to us again. Let us not in thy friendship, Agni, suffer harm.<br> 13 Thou art a God, thou art the wondrous Friend of Gods, the Vasu of the Vasus, fair in sacrifice.<br> Under, thine own most wide protection may we dwell. Let us not in thy friendship, Agni, suffer harm.<br> 14 This is thy grace that, kindled in thine own abode, invoked with Soma thou soundest forth most benign,<br> Thou givest wealth and treasure to the worshipper. Let us not in thy friendship, Agni, suffer harm.<br> 15 To whom thou, Lord of goodly riches, grantest freedom from every sin with perfect wholeness,<br> Whom with good strength thou <A HREF=\"errata.htm#2\">quickenest</A>, with children and wealth&#151;may we be they, Eternal Being.<br> 16 Such, Agni, thou who knowest all good fortune, God, lengthen here the days of our existence.<br> This prayer of ours may Varu&#7751;a grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01095.htm\">Next: HYMN XCV. Agni</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01094.html",
  "api": "json/hymns/01094.json",
  "data": {
    "title": "HYMN XCIV. Agni",
    "describe": "FOR J&#257;",
    "feecting": "p:FOR J&#257;tavedas worthy of our praise will we frame with our mind this eulogy as &#146;twere a car.\np: For good, in his assembly, is this care of ours. Let us not, in thy friendship, Agni, suffer harm.\r\np:The man for whom thou offering prospereth, dwelleth without a foe, gaineth heroic might. He waxeth strong, distress never approacheth him. Let us not, in thy friendship, Agni, suffer harm.\np:May we have power to kindle thee. Fulfil our thoughts. In thee the Devas eat the presented offering, Bring hither the &#256;dityas, for we long for them. Let us not in thy friendship, Agni, suffer harm.\np:We will bring fuel and prepare burnt offerings, reminding thee at each successive festival. Fulfil our thought that so we may prolong our lives. Let us not in thy friendship, Agni, suffer harm.\np:His ministers move forth, the guardians of the folk, protecting quadruped and biped with their rays. Mighty art thou, the wondrous herald of the Dawn. Let us not in thy friendship, Agni, suffer harm.\np:Thou art Presenter and the chief Invoker, thou Director, Purifier, great High Monk by birth. Knowing all priestly work thou perfectest it, Sage. Let us not in thy friendship, Agni, suffer harm.\np:Lovely of form art thou, alike on every side; though far, thou shinest brightly as if close at hand. O Deva, thou seest through even the dark of night. Let us not in thy friendship, Agni, suffer harm.\np:Devas, foremost be his car who pours libations out, and let our hymn prevail o&#146;er evil-hearted men. Attend to this our speech and make it prosper well. Let us not in thy friendship, Agni, suffer harm.\np:Smite with thy weapons those of evil speech and thought, devouring demons, whether near or tar away. Then to the singer give free way for offering. Let us not in thy friendship, Agni, suffer harm.\np:When to thy chariot thou hadst yoked two red steeds and two ruddy steeds, wind-sped, thy roar was like a bull's. Thou with smoke-bannered flame attackest forest trees. Let us not in thy friendship, Agni, suffer harm.\np:Then at thy roar the very birds are terrified, when, eating-up the grass, thy sparks fly forth abroad. Then is it easy for thee and thy car to pass. Let us not in thy friendship, Agni, suffer harm.\np:He hath the Power to soothe Mitra and Varu&#7751;a: wonderful is the Devas&#146; wrath when they descend. Be gracious; let their hearts he turned to us again. Let us not in thy friendship, Agni, suffer harm.\np:Thou art a Deva, thou art the wondrous Friend of Devas, the Vasu of the Devas, fair in offering. Under, thine own most wide protectio. May we dwell. Let us not in thy friendship, Agni, suffer harm.\np:This is thy grace that, kindled in thine own abode, invoked with Soma thou soundest forth most benign, Thou givest wealth and treasure to the worshipper. Let us not in thy friendship, Agni, suffer harm.\np:To whom thou, Lord of goodly riches, grantest freedom from every sin with perfect wholeness, whom with good strength thou quickenest, with children and wealth&#151;may we be they, Eternal Being.\np:Such, Agni, thou who knowest all good fortune, Deva, lengthen here the days of our existence. This prayer of our. May Varu&#7751;a grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.",
    "next": "01095",
    "previous": "01093",
    "book": "01"
  },
  "created": 1638553508833,
  "updated": 1638647072158
}