{
  "key": "01092",
  "title": "RigVeda Hymn 01092",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN XCII. Dawn.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01092.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01091.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01093.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCII. Dawn.</h3>  \n<p>1. THESE Dawns have raised their banner; in the eastern half of the mid-air they spread abroad their shining light.<br> Like heroes who prepare their weapons for the war, onward they come bright red in hue, the Mother Cows.<br> 2 Readily have the purple beams of light shot up; the Red Cows have they harnessed, easy to be yoked.<br> The Dawns have brought distinct perception as before: red-hued, they have attained their fulgent brilliancy.<br> 3 They sing their song like women active in their tasks, along their common path hither from far away,<br> Bringing refreshment to the liberal devotee, yea, all things to the worshipper who pours the juice.<br> 4 She, like a dancer, puts her broidered garments on: as a cow yields her udder so she bares her breast.<br> Creating light for all the world of life, the Dawn hath laid the darkness open as the cows their stall.<br> 5 We have beheld the brightness of her shining; it spreads and drives away the darksome monster.<br> Like tints that deck the Post at sacrifices, Heaven's Daughter hath attained her wondrous splendour.<br> 6 We have o&#146;erpast the limit of this darkness; Dawn breaking forth again brings clear perception.<br> She like a flatterer smiles in light for glory, and fair of face hath wakened to rejoice us.<br> 7 The Gotamas have praised Heaven's radiant Daughter, the leader of the charm of pleasant voices.<br> Dawn, thou conferrest on us strength with offspring and men, conspicuous with kine and horses.<br> 8 O thou who shinest forth in wondrous glory, urged onward by thy strength, auspicious Lady,<br> Dawn, may I gain that wealth, renowned and ample, in brave sons, troops of slaves, far-famed for horses.<br> 9 Bending her looks on all the world, the Goddess shines, widely spreading with her bright eye westward.<br> Waking to motion every living creature, she understands the voice of each adorer.<br> 10 Ancient of days, again&nbsp;again born newly, decking her beauty with the self-same raiment.<br> The Goddess wastes away the life of mortals, like a skilled hunter cutting birds in pieces.<br> 11 She hath appeared discovering heaven's borders: to the far distance she drives off her Sister.<br> Diminishing the days of human creatures, the Lady shines with all her lover's splendour.<br> 12 The bright, the blessed One shines forth extending her rays like kine, as a flood rolls his waters.<br> Never transgressing the divine commandments, she is beheld visible with the sunbeams.<br> 13 O Dawn enriched with ample wealth, bestow on us the wondrous gift<br> Wherewith we may support children and children's sons.<br> 14 Thou radiant mover of sweet sounds, with wealth of horses and of kine<br> Shine thou on us this day, O Dawn auspiciously.<br> 15 O Dawn enriched with holy rites, yoke to thy car thy purple steeds,<br> And then bring thou unto us all felicities.<br> 16 O A&#347;vins wonderful in act, do ye unanimous direct<br> Your chariot to our home wealthy in kine and gold.<br> 17 Ye who brought down the hymn from heaven, a light that giveth light to man,<br> Do ye, O A&#347;vins, bring strength hither unto us.<br> 18 Hither may they who wake at dawn bring, to drink Soma both the Gods<br> Health-givers Wonder-Workers, borne on paths of gold.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01093.htm\">Next: HYMN XCIII. Agni-Soma.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01092.html",
  "api": "json/hymns/01092.json",
  "data": {
    "key": "01092",
    "title": "HYMN XCII. Dawn.",
    "describe": "THESE Dawns have raised their banner;",
    "feecting": "p:THESE Dawns have raised their banner; in the eastern half of the mid-air they spread abroad their shining light.\np: Like heroes who prepare their weapons for the war, onward they come bright red in hue, the Mother Cows.\r\np:Readily have the purple beams of light shot up; the Red Cows have they harnessed, easy to be yoked. The Dawns have brought distinct perception as before: red-hued, they have attained their fulgent brilliancy.\np:They sing their song like women active in their tasks, along their common path hither from far away, Bringing refreshment to the liberal devotee, yea, all things to the worshipper who pours the juice.\np:She, like a dancer, puts her broidered garments on: as a cow yields her udder so she bares her breast. Creating light for all the world of life, the Dawn hath laid the darkness open as the cows their stall.\np:We have beheld the brightness of her shining; it spreads and drives away the darksome monster. Like tints that deck the Post at offers. Heaven's Daughter hath attained her wondrous splendour.\np:We have o’erpast the limit of this darkness; Dawn breaking forth again brings clear perception. She like a flatterer smiles in light for glory, and fair of face hath wakened to rejoice us.\np:The Gotamas have praised Heaven's radiant Daughter, the leader of the charm of pleasant voices. Dawn, thou conferrest on us strength with offspring and men, conspicuous with kine and horses.\np:O thou who shinest forth in wondrous glory, urged onward by thy strength, auspicious Lady, Dawn. May I gain that wealth, renowned and ample, in brave sons, troops of slaves, far-famed for horses.\np:Bending her looks on all the worlddess shines, widely spreading with her bright eye westward. Waking to motion every living creature, she understands the voice of each adorer.\np:Ancient of days, again again born newly, decking her beauty with the self-same raiment. The Goddess wastes away the life of mortals, like a skilled hunter cutting birds in pieces.\np:She hath appeared discovering Heaven's borders: to the far distance she drives off her Sister. Diminishing the days of human creatures, the Lady shines with all her lover's splendour.\np:The bright, the blessed One shines forth extending her rays like kine, as a flood rolls his waters. Never transgressing the divine commandments, she is beheld visible with the sunbeams.\np:O Dawn enriched with ample wealth, bestow on us the wondrous gift Wherewith we may support children and children's sons.\np:Thou radiant mover of sweet sounds, with wealth of horses and of kine Shine thou on us this day, O Dawn auspiciously.\np:O Dawn enriched with holy rites, yoke to thy car thy purple steeds, and then bring thou unto us all felicities.\np:O Indra wonderful in act, do ye unanimous direct Your chariot to our home wealthy in kine and gold.\np:Ye who brought down the hymn from Heaven, a light that giveth light to man, Do ye, O Indra, bring strength hither unto us.\np:Hithe, may they who wake at dawn bring, to drink Soma both the Devas Health-givers Wonder-Workers, borne on paths of gold.",
    "meta": {
      "next": "01093",
      "previous": "01091",
      "book": "01",
      "original": "https://sacred-texts.com/hin/rigveda/rv01092.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv01092.htm"
    },
    "deities": [
      {
        "name": "O thou",
        "hymns": [
          {
            "key": "01092",
            "title": "HYMN XCII. Dawn."
          }
        ]
      },
      {
        "name": "O Dawn",
        "hymns": [
          {
            "key": "01092",
            "title": "HYMN XCII. Dawn."
          },
          {
            "key": "01092",
            "title": "HYMN XCII. Dawn."
          },
          {
            "key": "01092",
            "title": "HYMN XCII. Dawn."
          }
        ]
      },
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "01092",
            "title": "HYMN XCII. Dawn."
          },
          {
            "key": "01092",
            "title": "HYMN XCII. Dawn."
          }
        ]
      }
    ]
  },
  "created": 1638553498305,
  "updated": 1639023783723
}