{
  "key": "01106",
  "title": "RigVeda Hymn 01106",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CVI. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01106.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01105.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01107.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CVI. Vi&#347;vedevas.</h3>  \n<p>1. CALL we for aid on Indra, Mitra, Varu&#7751;a and Agni and the Marut host and Aditi.<br> Even as a chariot from a difficult ravine, bountiful Vasus, rescue us from all distress.<br> 2 Come ye &#256;dityas for our full prosperity, in conquests of the foe, ye Gods, bring joy to us.<br> Even as a chariot from a difficult ravine, bountiful Vasus, rescue us from all distress.<br> 3 May the most glorious Fathers aid us, and the two Goddesses, Mothers of the Gods, who strengthen Law.<br> Even as a chariot from a difficult ravine, bountiful Vasus, rescue us from all distress.<br> 4 To mighty Nar&#257;&#347;a&#7745;sa, strengthening his might, to P&#363;&#7779;an, ruler over men, we pray with hymns.<br> Even as a chariot from a difficult ravine, bountiful Vasus, rescue us from all distress.<br> 5 B&#7771;haspati, make us evermore an easy path: we crave what boon thou hast for men in rest and stir.<br> Like as a chariot from a difficult ravine, bountiful Vasus, rescue us from all distress.<br> 6 Sunk in the pit the &#7770;&#7779;i Kutsa called, to aid, Indra the V&#7771;tra-slayer, Lord of power and might.<br> Even as a chariot from a difficult ravine, bountiful Vasus, rescue us from all distress.<br> 7 May Aditi the Goddess guard us with the Gods: may the protecting God keep us with ceaseless care.<br> This prayer of ours may Varu&#7751;a grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01107.htm\">Next: HYMN CVII. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01106.html",
  "api": "json/hymns/01106.json",
  "data": {
    "key": "01106",
    "title": "HYMN CVI. Devas.",
    "describe": "CALL we for aid on Indra, Indra and Agni and the Marut host and Aditi.",
    "feecting": "p:CALL we for aid on Indra, Indra and Agni and the Marut host and Aditi.\np: Even as a chariot from a difficult ravine, bountiful Devas, rescue us from all distress.\r\np:Come ye Ādityas for our full prosperity, in conquests of the foe, ye Devas, bring joy to us. Even as a chariot from a difficult ravine, bountiful Devas, rescue us from all distress.\np:May the most glorious Fathers aid us, and the two Goddesses, Mothers of the Devas, who strengthen Law. Even as a chariot from a difficult ravine, bountiful Devas, rescue us from all distress.\np:To mighty Narāśaṁsa, strengthening his might, to Pūṣan, ruler over men, we pray with hymns. Even as a chariot from a difficult ravine, bountiful Devas, rescue us from all distress.\np:Soma, make us evermore an easy path: we crave what boon thou hast for men in rest and stir. Like as a chariot from a difficult ravine, bountiful Devas, rescue us from all distress.\np:Sunk in the pit the Ṛṣi Kutsa called, to aid, Indra, Lord of power and might. Even as a chariot from a difficult ravine, bountiful Devas, rescue us from all distress.\np:May Aditi the Goddess guard us with the Devas. May the protecting Deva keep us with ceaseless care. This prayer of our. May Indra grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.",
    "meta": {
      "next": "01107",
      "previous": "01105",
      "book": "01",
      "original": "https://sacred-texts.com/hin/rigveda/rv01106.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv01106.htm"
    },
    "deities": []
  },
  "created": 1638553572545,
  "updated": 1667442752038
}