{
  "key": "01104",
  "title": "RigVeda Hymn 01104",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CIV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01104.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01103.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01105.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CIV. Indra.</h3>  \n<p>1. THE altar hath been made for thee to rest on: come like a panting courser and be seated.<br> Loosen thy flying Steeds, set free thy Horses who bear thee swiftly nigh at eve and morning.<br> 2 These men have come to Indra for assistance: shall he not quickly come upon these pathways?<br> May the Gods quell the fury of the D&#257;sa, and may they lead our folk to happy fortune.<br> 3 He who hath only wish as his possession casts on himself, casts foam amid the waters.<br> Both wives of Kuyava in milk have bathed them: may they be drowned within the depth of &#346;iph&#257;.<br> 4 This hath his kinship checked who lives beside us: with ancient streams forth speeds and rules the Hero,<br> A&ntilde;jas&#299;, Kuli&#347;&#299;, and Virapatn&#299;, delighting him, bear milk upon their waters.<br> 5 Soon as this Dasyu's traces were discovered, as she who knows her home, he sought the dwelling.<br> Now think thou of us, Maghavan, nor cast us away as doth a profligate his treasure.<br> 6 Indra, as such, give us a share of sunlight, of waters, sinlessness, and reputation.<br> Do thou no harm to our yet unborn offspring: our trust is in thy mighty Indra-power.<br> 7 Now we, I think, in thee as such have trusted: lead us on, Mighty One, to ample riches.<br> In no unready house give us, O Indra invoked of many, food and drink when hungry.<br> 8 Slay us not, Indra; do not thou forsake us: steal not away the joys which we delight in.<br> Rend not our unborn brood, strong Lord of Bounty! our vessels with the life that is within them.<br> 9 Come to us; they have called thee Soma-lover: here is the pressed juice. Drink thereof for rapture.<br> Widely-capacious, pour it down within thee, and, invocated, hear us like a Father.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01105.htm\">Next: HYMN CV. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01104.html",
  "api": "json/hymns/01104.json",
  "data": {
    "title": "HYMN CIV. Indra.",
    "describe": "THE altar hath been made for thee to rest on: come like a panting courser and be seated.",
    "feecting": "p:THE altar hath been made for thee to rest on: come like a panting courser and be seated.\np: Loosen thy flying Steeds, set free thy Horses who bear thee swiftly nigh at eve and morning.\r\np:These men have come to Indra for assistance: shall he not quickly come upon these pathways? May the Devas quell the fury of the D&#257;sa, an. May they lead our folk to happy fortune.\np:He who hath only wish as his possession casts on himself, casts foam amid the waters. Both wives of Kuyava in milk have bathed them. May they be drowned within the depth of &#346;iph&#257;.\np:This hath his kinship checked who lives beside us: with ancient streams forth speeds and rules the Hero, A&ntilde;jas&#299;, Kuli&#347;&#299;, and Virapatn&#299;, delighting him, bear milk upon their waters.\np:Soon as this Dasyu's traces were discovered, as she who knows her home, he sought the dwelling. Now think thou of us, Indra, nor cast us away as doth a profligate his treasure.\np:Indra, as such, give us a share of sunlight, of waters, sinlessness, and reputation. Do thou no harm to our yet unborn offspring: our trust is in thy mighty Indra-power.\np:Now we, I think, in thee as such have trusted: lead us on, Mighty One, to ample riches. In no unready house give us, O Indra invoked of many, food and drink when hungry.\np:Slay us not, Indra; do not thou forsake us: steal not away the joys which we delight in. Rend not our unborn brood, strong Lord of Bounty! our vessels with the life that is within them.\np:Come to us; they have called thee Soma-lover: here is the pressed juice. Drink thereof for rapture. Widely-capacious, pour it down within thee, and, invocated, hear us like a Father.",
    "next": "01105",
    "previous": "01103",
    "book": "01"
  },
  "created": 1638553562032,
  "updated": 1638642698122
}