{
  "key": "01114",
  "title": "RigVeda Hymn 01114",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CXIV. Rudra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01114.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01113.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01115.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXIV. Rudra.</h3>  \n<p>1. To the strong Rudra bring we these our songs of praise, to him the Lord of Heroes with the braided hair,<br> That it be well with all our cattle and our men, that in this village all be healthy and well-fed.<br> 2 Be gracious unto us, O Rudra, bring us joy: thee, Lord of Heroes, thee with reverence will we serve.<br> Whatever health and strength our father Manu won by sacrifice may we, under thy guidance, gain.<br> 3 By worship of the Gods may we, O Bounteous One, O Rudra, gain thy grace, Ruler of valiant men.<br> Come to our families, bringing them bliss: may we, whose heroes are uninjured, bring thee sacred gifts,<br> 4 Hither we call for aid the wise, the wanderer, impetuous Rudra, perfecter of sacrifice.<br> May he repel from us the anger of the Gods: verily we desire his favourable grace.<br> 5 Him with the braided hair we call with reverence down, the wild-boar of the sky, the red, the dazzling shape.<br> May he, his hand filled full of sovran medicines, grant us protection, shelter, and a home secure.<br> 6 To him the Maruts&#146; Father is this hymn addressed, to strengthen Rudra's might, a song more sweet than sweet.<br> Grant us, Immortal One, the food which mortals eat: be gracious unto me, my seed, my progeny.<br> 7 O Rudra, harm not either great or small of us, harm not the growing boy, harm not the full-grown man.<br> Slay not a sire among us, slay no mother here, and to our own dear bodies, Rudra, do not harm.<br> 8 Harm us not, Rudra, in our seed and progeny, harm us not in the living, nor in cows or steeds,<br> Slay not our heroes in the fury of thy wrath. Bringing oblations evermore we call to thee.<br> 9 Even as a herdsman I have brought thee hymns of praise: O Father of the Maruts, give us happiness,<br> Blessed is thy most favouring benevolence, so, verily, do we desire thy saving help.<br> 10 Far be thy dart that killeth men or cattle: thy bliss be with us, O thou Lord of Heroes.<br> Be gracious unto us, O God, and bless us, and then vouchsafe us doubly-strong protection.<br> 11 We, seeking help, have spoken and adored him: may Rudra, girt by Maruts, hear our calling.<br> This prayer of ours may Varu&#7751;a grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01115.htm\">Next: HYMN CXV. S&#363;rya.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01114.html",
  "api": "json/hymns/01114.json",
  "data": {
    "key": "01114",
    "title": "HYMN CXIV. Soma.",
    "describe": "To the strong Soma bring we these our songs of praise, to him the Lord of Heroes with the braided hair, that it be well with all our cattle and our men, that in this village all be healthy and well-fed.",
    "feecting": "p:To the strong Soma bring we these our songs of praise, to him the Lord of Heroes with the braided hair, that it be well with all our cattle and our men, that in this village all be healthy and well-fed.\np:Be gracious unto us, O Soma, bring us joy: thee, Lord of Heroes, thee with reverence will we serve.\np: Whatever health and strength our father Manu won by sacrific. May we, under thy guidance, gain.\r\np:By worship of the Deva. May we, O Bounteous One, O Soma, gain thy grace, Ruler of valiant men. Come to our families, bringing them bliss. May we, whose heroes are uninjured, bring thee sacred gifts,\np:Hither we call for aid the wise, the wanderer, impetuous Soma, perfecter of offering. May he repel from us the anger of the Devas: verily we desire his favourable grace.\np:Him with the braided hair we call with reverence down, the wild-boar of the sky, the red, the dazzling shape. May he, his hand filled full of sovran medicines, grant us protection, shelter, and a home secure.\np:To him the Devas’ Father is this hymn addressed, to strengthen Soma's might, a song more sweet than sweet. Grant us, Immortal One, the food which mortals eat: be gracious unto me, my seed, my progeny.\np:O Soma, harm not either great or small of us, harm not the growing boy, harm not the full-grown man. Slay not a sire among us, subdue no mother here, and to our own dear bodies, Soma, do not harm.\np:Harm us not, Soma, in our seed and progeny, harm us not in the living, nor in cows or steeds, Slay not our heroes in the fury of thy wrath. Bringing oblation evermore we call to thee.\np:Even as a herdsman I have brought thee hymns of praise: O Father of the Devas, give us happiness, Blessed is thy most favouring benevolence, so, verily, do we desire thy saving help.\np:Far be thy dart that killeth men or cattle: thy bliss be with us, O thou Lord of Heroes. Be gracious unto us, and bless us, and then vouchsafe us doubly-strong protection.\np:We, seeking help, have spoken and adored him. May Soma, girt by Devas, hear our calling. This prayer of our. May Indra grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.",
    "meta": {
      "next": "01115",
      "previous": "01113",
      "book": "01",
      "original": "https://sacred-texts.com/hin/rigveda/rv01114.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv01114.htm"
    },
    "deities": [
      {
        "name": "O Soma",
        "hymns": [
          {
            "key": "01114",
            "title": "HYMN CXIV. Soma."
          },
          {
            "key": "01114",
            "title": "HYMN CXIV. Soma."
          },
          {
            "key": "01114",
            "title": "HYMN CXIV. Soma."
          }
        ]
      },
      {
        "name": "O Bounteous",
        "hymns": [
          {
            "key": "01114",
            "title": "HYMN CXIV. Soma."
          }
        ]
      },
      {
        "name": "O Father",
        "hymns": [
          {
            "key": "01114",
            "title": "HYMN CXIV. Soma."
          },
          {
            "key": "01114",
            "title": "HYMN CXIV. Soma."
          },
          {
            "key": "01114",
            "title": "HYMN CXIV. Soma."
          },
          {
            "key": "01114",
            "title": "HYMN CXIV. Soma."
          }
        ]
      },
      {
        "name": "O thou",
        "hymns": [
          {
            "key": "01114",
            "title": "HYMN CXIV. Soma."
          }
        ]
      }
    ]
  },
  "created": 1638553614826,
  "updated": 1667450402271
}