{
  "key": "01117",
  "title": "RigVeda Hymn 01117",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CXVII. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01117.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01116.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01118.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXVII. A&#347;vins.</h3>  \n<p>1. A&#346;VINS, your ancient priest invites you hither to gladden you with draughts of meath of Soma.<br> Our gift is on the grass, our song apportioned: with food and strength come hither, O N&#257;satyas.<br> 2 That car of yours, swifter than thought, O A&#347;vins, which drawn by brave steeds cometh to the people,<br> Whereon ye seek the dwelling of the pious,&#151;come ye thereon to our abode, O Heroes.<br> 3 Ye freed sage Atri, whom the Five Tribes honoured, from the strait pit, ye Heroes with his people,<br> Baffling the guiles of the malignant Dasyu, repelling them, ye Mighty in succession.<br> 4 Rebha the sage, ye mighty Heroes, A&#347;vins! whom, like a horse, vile men had sunk in water,&#151;<br> Him, wounded, with your wondrous power ye rescued: your exploits of old time endure for ever.<br> 5 Ye brought forth Vandana, ye Wonder-Workers, for triumph, like fair gold that hath been buried,<br> Like one who slumbered in destruction's bosom, or like the Sun when dwelling in the darkness.<br> 6 Kak&#7779;&#299;v&#257;n, Pajra's son, must laud that exploit of yours, N&#257;satyas, Heroes, ye who wander!<br> When from the hoof of your strong horse ye showered a hundred jars of honey for the people.<br> 7 To K&#7771;&#7779;&#7751;a's son, to Vi&#347;vaka who praised you, O Heroes, ye restored his son Vi&#7779;&#7751;&#257;p&#363;.<br> To Gho&#7779;&#257;, living in her father's dwelling, stricken in years, ye gave a husband, A&#347;vins.<br> 8 Ru&#7779;at&#299;, of the mighty people, A&#347;vins, ye gave to &#346;y&#257;va of the line of Ka&#7751;va.<br> This deed of yours, ye Strong Ones should be published, that ye gave glory to the son of N&#7771;&#7779;ad.<br> 9 O A&#347;vins, wearing many forms at pleasure, on Pedu ye bestowed a fleet-foot courser,<br> Strong, winner of a thousand spoils, resistless the serpent slayer, glorious, triumphant.<br> 10 These glorious things are yours, ye Bounteous Givers; prayer, praise in both worlds are your habitation.<br> O A&#347;vins, when the sons of Pajra call you, send strength with nourishment to him who knoweth.<br> 11 Hymned with the reverence of a son, O A&#347;vins ye Swift Ones giving booty to the singer,<br> Glorified by Agastya with devotion, established Vi&#347;pal&#257; again, N&#257;satyas.<br> 12 Ye Sons of Heaven, ye Mighty, whither went ye, sought ye, for his fair praise the home of K&#257;vya.<br> When, like a pitcher full of gold, O A&#347;vins, on the tenth day ye lifted up the buried?<br> 13 Ye with the aid of your great powers, O A&#347;vins, restored to youth the ancient man Cyav&#257;na.<br> The Daughter of the Sun with all her glory, O ye N&#257;satyas, chose your car to bear her.<br> 14 Ye, ever-youthful Ones, again remembered Tugra, according to your ancient manner:<br> With horses brown of hue that flew with swift wings ye brought back Bhujyu from the sea of billows.<br> 15 The son of Tugra had invoked you, A&#347;vins; borne on he went uninjured through the ocean.<br> Ye with your chariot swift as thought, well-harnessed, carried him off, O Mighty Ones, to safety.<br> 16 The quail had invocated you, O A&#347;vins, when from the wolf's devouring jaws ye freed her.<br> With conquering car ye cleft the mountain's ridges: the offspring of Vi&#347;v&#257;c ye killed with poison.<br> 17 He whom for furnishing a hundred wethers to the she-wolf, his wicked father blinded,&#151;<br> To him, &#7770;jr&#257;&#347;va, gave ye eyes, O A&#347;vins; light to the blind ye sent for perfect vision.<br> 18 To bring the blind man joy thus cried the she-wolf: O A&#347;vins, O ye Mighty Ones, O Heroes,<br> For me &#7770;jr&#257;&#347;va, like a youthful lover, hath. cut piecemeal one and a hundred wethers.<br> 19 Great and weal-giving is your aid, O A&#347;vins, ye, objects of all thought, made whole the cripple.<br> Purandhi also for this cause invoked you, and ye, O mighty, came to her with succours.<br> 20 Ye, Wonder-Workers, filled with milk for &#346;ayu the milkless cow, emaciated, barren;<br> And by your powers the child of Purumitra ye brought to Vimada to be his consort.<br> 21 Ploughing and sowing barley, O ye A&#347;vins, milking out food for men, ye Wonder-Workers,<br> Blasting away the Dasyu with your trumpet, ye gave far-spreading light unto the &#256;rya.<br> 22 Ye brought the horse's head, A&#347;vins, and gave it unto Dadhyac the offspring of Atharvan.<br> True, he revealed to you, O Wonder-Workers, sweet Soma, Tva&#7779;&#7789;ar's secret, as your girdle.<br> 23 O Sages, evermore I crave your favour: be gracious unto all my prayers, O A&#347;vins.<br> Grant me, N&#257;satyas, riches in abundance, wealth famous and accompanied with children.<br> 24 With liberal bounty to the weakling's consorts ye, Heroes, gave a son Hira&#7751;yahasta;<br> And &#346;y&#257;va, cut into three several pieces, ye brought to life again, O bounteous A&#347;vins.<br> 25 These your heroic exploits, O ye A&#347;vins, done in the days. of old, have men related.<br> May we, addressing prayer to you, ye Mighty, speak with brave sons about us to the synod.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01118.htm\">Next: HYMN CXVIII. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01117.html",
  "api": "json/hymns/01117.json",
  "data": {
    "key": "01117",
    "title": "HYMN CXVII. Indra.",
    "describe": "AŚVINS, your ancient priest invites you hither to gladden you with draughts of meath of Soma.",
    "feecting": "p:AŚVINS, your ancient priest invites you hither to gladden you with draughts of meath of Soma.\np: Our gift is on the grass, our song apportioned: with food and strength come hither, O Nāsatyas.\r\np:That car of yours, swifter than thought, O Indra, which drawn by brave steeds cometh to the people, Whereon ye seek the dwelling of the pious.come ye thereon to our abode, O Heroes.\np:Ye freed sage Atri, whom the Five Tribes honoured, from the strait pit, ye Heroes with his people, Baffling the guiles of the malignant Dasyu, repelling them, ye Mighty in succession.\np:Rebha the sage, ye mighty Heroes, Indra! whom, like a horse, vile men had sunk in water. Him, wounded, with your wondrous power ye rescued: your exploits of old time endure forever.\np:Ye brought forth Vandana, ye Wonder-Workers, for triumph, like fair gold that hath been buried, like one who slumbered in destruction's bosom, or like the Sun when dwelling in the darkness.\np:Kakṣīvān, Pajra's son, must laud that exploit of yours, Nāsatyas. Heroes, ye who wander! When from the hoof of your strong horse ye showered a hundred jars of honey for the people.\np:To Kṛṣṇa's son, to Viśvaka who praised you, O Heroes, ye restored his son Viṣṇāpū. To Ghoṣā, living in her father's dwelling, stricken in years, ye gave a husband, Indra.\np:Ruṣatī, of the mighty people, Indra, ye gave to Śyāva of the line of Kaṇva. This deed of yours, ye Strong Ones should be published, that ye gave glory to the son of Nṛṣad.\np:O Indra, wearing many forms at pleasure, on Pedu ye bestowed a fleet-foot courser, Strong, winner of a thousand spoils, resistless the serpent slayer, glorious, triumphant.\np:These glorious things are yours, ye Bounteous Givers; prayer, praise in both worlds are your habitation. O Indra, when the sons of Pajra call you, send strength with nourishment to him who knoweth.\np:Hymned with the reverence of a son, O Indra ye Swift Ones giving booty to the singer, Glorified by Agastya with devotion established Viśpalā again, Nāsatyas.\np:Ye Sons of Heaven, ye Mighty, whither went ye, sought ye, for his fair praise the home of Kāvya. When, like a pitcher full of gold, O Indra, on the tenth day ye lifted up the buried?\np:Ye with the aid of your great powers, O Indra, restored to youth the ancient man Cyavāna. The Daughter of the Sun with all her glory, O ye Nāsatyas, chose your car to bear her.\np:Ye, ever-youthful Ones, again remembered Tugra, according to your ancient manner: With horses brown of hue that flew with swift wings ye brought back Bhujyu from the sea of billows.\np:The son of Tugra had invoked you, Indra; borne on he went uninjured through the ocean. Ye with your chariot swift as thought, well-harnessed, carried him off, O Mighty Ones, to safety.\np:The quail had invocated you, O Indra, when from the wolf's devouring jaws ye freed her. With conquering car ye cleft the mountain's ridges: the offspring of Viśvāc ye killed with poison.\np:He whom for furnishing a hundred wethers to the she-wolf, his wicked father blinded. To him, Ṛjrāśva, gave ye eyes, O Indra; light to the blind ye sent for perfect vision.\np:To bring the blind man joy thus cried the she-wolf: O Indra, O ye Mighty Ones, O Heroes, for me Ṛjrāśva, like a youthful lover, hath. cut piecemeal one and a hundred wethers.\np:Great and weal-giving is your aid, O Indra, ye, objects of all thought, made whole the cripple. Purandhi also for this cause invoked you, and ye, O mighty, came to her with assists.\np:Ye, Wonder-Workers, filled with milk for Śayu the milkless cow, emaciated, barren; And by your powers the child of Purumitra ye brought to Vimada to be his consort.\np:Ploughing and sowing barley, O ye Indra, milking out food for men, ye Wonder-Workers, Blasting away the Dasyu with your trumpet, ye gave far-spreading light unto the Ārya.\np:Ye brought the horse's head, Indra, and gave it unto Dadhyac the offspring of Atharvan. True, he revealed to you, O Wonder-Workers, sweet Soma, Tvaṣṭar's secret, as your girdle.\np:O Sages, evermore I crave your favour: be gracious unto all my meditations, O Indra. Grant me, Nāsatyas, riches in abundance, wealth famous and accompanied with children.\np:With liberal bounty to the weakling's consorts ye. Heroes, gave a son Hiraṇyahasta; And Śyāva, cut into three several pieces, ye brought to life again, O bounteous Indra.\np:These your heroic exploits, O ye Indra, done in the days. of old, have men related. May we, addressing prayer to you, ye Mighty, speak with brave sons about us to the synod.",
    "meta": {
      "next": "01118",
      "previous": "01116",
      "book": "01",
      "original": "https://sacred-texts.com/hin/rigveda/rv01117.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv01117.htm"
    },
    "deities": [
      {
        "name": "O Nāsatyas",
        "hymns": [
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          }
        ]
      },
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          }
        ]
      },
      {
        "name": "O Heroes",
        "hymns": [
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          }
        ]
      },
      {
        "name": "O ye ",
        "hymns": [
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          }
        ]
      },
      {
        "name": "O Mighty",
        "hymns": [
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          },
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          }
        ]
      },
      {
        "name": "O Wonder",
        "hymns": [
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          }
        ]
      },
      {
        "name": "O Sages",
        "hymns": [
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          }
        ]
      },
      {
        "name": "O bounteous",
        "hymns": [
          {
            "key": "01117",
            "title": "HYMN CXVII. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638553630617,
  "updated": 1639023783779
}