{
  "key": "01110",
  "title": "RigVeda Hymn 01110",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CX. &#7770;bhus.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01110.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01109.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01111.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CX. &#7770;bhus.</h3>  \n<p>1. THE holy work I wrought before is wrought again: my sweetest hymn is sung to celebrate your praise.<br> Here, O ye &#7770;bhus, is this sea for all the Gods: sate you with Soma offered with the hallowing word.<br> 2 When, seeking your enjoyment onward from afar, ye, certain of my kinsmen, wandered on your way,<br> Sons of Sudhanvan, after your long journeying, ye came unto the home of liberal Savitar.<br> 3 Savitar therefore gave you immortality, because ye came proclaiming him whom naught can hide;<br> And this the drinking-chalice of the Asura, which till that time was one, ye made to be fourfold.<br> 4 When they had served with zeal at sacrifice as priests, they, mortal as they were, gained immortality.<br> The &#7770;bhus, children of Sudhanvan, bright as suns, were in a year's course made associate with prayers.<br> 5 The &#7770;bhus, with a rod measured, as &#146;twere a field, the single sacrificial chalice. wide of mouth,<br> Lauded of all who saw, praying for what is best, desiring glorious fame among Immortal Gods.<br> 6 As oil in ladles, we through knowledge will present unto the Heroes of the firmament our hymn,&#151;<br> The &#7770;bhus who came near with this great Father's speed, and rose to heaven's high sphere to eat the strengthening food.<br> 7 &#7770;bhu to us is Indra freshest in his might, &#7770;bhu with powers and wealth is giver of rich gifts.<br> Gods, through your favour may we on the happy day quell the attacks of those who pour no offerings forth.<br> 8 Out of a skin, O &#7770;bhus, once ye formed a cow, and brought the mother close unto her calf again.<br> Sons of Sudhanvan, Heroes, with surpassing skill ye made your aged Parents youthful as before.<br> 9 Help us with strength where spoil is won, O Indra: joined with the &#7770;bhus give us varied bounty.<br> This prayer of ours may Varu&#7751;a grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01111.htm\">Next: HYMN CXI. &#7770;bhus.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01110.html",
  "api": "json/hymns/01110.json",
  "data": {
    "title": "HYMN CX. &#7770;bhus.",
    "describe": "THE holy work I wrought before is wrought again: my sweetest hymn is sung to celebrate your praise.",
    "feecting": "p:THE holy work I wrought before is wrought again: my sweetest hymn is sung to celebrate your praise.\np: Here, O ye &#7770;bhus, is this sea for all the Devas: sate you with Soma offered with the hallowing word.\r\np:When, seeking your enjoyment onward from afar, ye, certain of my kinsmen, wandered on your way, Sons of Sudhanvan, after your long journeying, ye came unto the home of liberal Indra.\np:Indra therefore gave you immortality, because ye came proclaiming him whom naught can hide; And this the drinking-chalice of the Devas, which till that time was one, ye made to be fourfold.\np:When they had served with zeal at offering as monks, they, mortal as they were, gained immortality. The &#7770;bhus, children of Sudhanvan, bright as suns, were in a year's course made associate with prayers.\np:The &#7770;bhus, with a rod measured, as &#146;twere a field, the single sacrificial chalice. wide of mouth, Lauded of all who saw, praying for what is best, desiring glorious fame among Immortal Devas.\np:As oil in ladles, we through knowledge will present unto the Heroes of the Firmament our hymn,&#151; The &#7770;bhus who came near with this great Father's speed, and rose to Heaven's high sphere to eat the strengthening food.\np:&#7770;bhu to us is Indra freshest in his might, &#7770;bhu with powers and wealth is giver of rich gifts. Devas, through your favou. May we on the happy day quell the attacks of those who pour no offerings forth.\np:Out of a skin, O &#7770;bhus, once ye formed a cow, and brought the mother close unto her calf again. Sons of Sudhanvan. Heroes, with surpassing skill ye made your aged Parents youthful as before.\np:Help us with strength where spoil is won, O Indra: joined with the &#7770;bhus give us varied bounty. This prayer of our. May Varu&#7751;a grant, and Mitra, and Aditi and Sindhu, Earth and Heaven.",
    "next": "01111",
    "previous": "01109",
    "book": "01"
  },
  "created": 1638553593780,
  "updated": 1638791780330
}