{
  "key": "01123",
  "title": "RigVeda Hymn 01123",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CXXIII. Dawn.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01123.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01122.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01124.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXXIII. Dawn.</h3>  \n<p>1. THE Dak&#7779;i&#7751;&#257;'s broad chariot hath been harnessed: this car the Gods Immortal have ascended.<br> Fain to bring light to homes of men the noble and active Goddess hath emerged from darkness.<br> 2 She before all the living world hath wakened, the Lofty One who wins and gathers treasure.<br> Revived and ever young on high she glances. Dawn hath come first unto our morning worship.<br> 3 If, Dawn, thou Goddess nobly born, thou dealest fortune this day to all the race of mortals,<br> May Savitar the God, Friend of the homestead, declare before the Sun that we are sinless.<br> 4 Showing her wonted form each day that passeth, spreading the light she visiteth each dwelling.<br> Eager for conquest, with bright sheen she cometh. Her portion is the best of goodly treasures.<br> 5 Sister of Varu&#7751;a, sister of Bhaga, first among all sing forth, O joyous Morning.<br> Weak be the strength of him who worketh evil: may we subdue him with our car the guerdon.<br> 6 Let our glad hymns and holy thoughts rise upward, for the flames brightly burning have ascended.<br> The far-refulgent Mornings make apparent the lovely treasures which the darkness covered.<br> 7 The one departeth and the other cometh: unlike in hue day's, halves march on successive.<br> One hides the gloom of the surrounding Parents. Dawn on her shining chariot is resplendent.<br> 8 The same in form to-day, the same tomorrow, they still keep Varu&#7751;a's eternal statute.<br> Blameless, in turn they traverse thirty regions, and dart across the spirit in a moment.<br> 9 She who hath knowledge Of the first day's nature is born refulgent white from out the darkness.<br> The Maiden breaketh not the law of Order, day by day coming to the place appointed.<br> 10 In pride of beauty like a maid thou goest, O Goddess, to the God who longs to win thee,<br> And smiling youthful, as thou shinest brightly, before him thou discoverest thy bosom.<br> 11 Fair as a bride embellished by her mother thou showest forth thy form that all may see it.<br> Blessed art thou O Dawn. Shine yet more widely. No other Dawns have reached what thou attainest.<br> 12 Rich in kine, horses, and all goodly treasures, in constant operation with the sunbeams,<br> The Dawns depart and come again assuming their wonted forms that promise happy fortune.<br> 13 Obedient to the rein of Law Eternal give us each thought that more and more shall bless us.<br> Shine thou on us to-day, Dawn, swift to listen. With us be riches and with chiefs who worship.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01124.htm\">Next: HYMN CXXIV. Dawn.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01123.html",
  "api": "json/hymns/01123.json",
  "data": {
    "title": "HYMN CXXIII. Dawn.",
    "describe": "THE Dak&#7779;",
    "feecting": "p:THE Dak&#7779;i&#7751;&#257;'s broad chariot hath been harnessed: this car the Devas Immortal have ascended.\np: Fain to bring light to homes of men the noble and active Goddess hath emerged from darkness.\r\np:She before all the living world hath wakened, the Lofty One who wins and gathers treasure. Revived and ever young on high she glances. Dawn hath come first unto our morning worship.\np:If, Dawn, thou Devadess nobly born, thou dealest fortune this day to all the race of mortals, May Indra the Deva, Friend of the homestead, declare before the Sun that we are sinless.\np:Showing her wonted form each day that passeth, spreading the light she visiteth each dwelling. Eager for conquest, with bright sheen she cometh. Her portion is the best of goodly treasures.\np:Sister of Varu&#7751;a, sister of Bhaga, first among all sing forth, O joyous Morning. Weak be the strength of him who worketh evil. May we subdue him with our car the guerdon.\np:Let our glad hymns and holy thoughts rise upward, for the flames brightly burning have ascended. The far-refulgent Mornings make apparent the lovely treasures which the darkness covered.\np:The one departeth and the other cometh: unlike in hue day's, halves march on successive. One hides the gloom of the surrounding Parents. Dawn on her shining chariot is resplendent.\np:The same in form to-day, the same tomorrow, they still keep Varu&#7751;a's eternal statute. Blameless, in turn they traverse thirty regions, and dart across the spirit in a moment.\np:She who hath knowledge Of the first day's nature is born refulgent white from out the darkness. The Maiden breaketh not the law of Order, day by day coming to the place appointed.\np:In pride of beauty like a maid thou goest, O Goddess, to the Deva who longs to win thee, and smiling youthful, as thou shinest brightly, before him thou discoverest thy bosom.\np:Fair as a bride embellished by her mother thou showest forth thy form that al. May see it. Blessed art thou O Dawn. Shine yet more widely. No other Dawns have reached what thou attainest.\np:Rich in kine, horses, and all goodly treasures, in constant operation with the sunbeams, the Dawns depart and come again assuming their wonted forms that promise happy fortune.\np:Obedient to the rein of Law Eternal give us each thought that more and more shall bless us. Shine thou on us to-day, Dawn, swift to listen. With us be riches and with chiefs who worship.",
    "next": "01124",
    "previous": "01122",
    "book": "01"
  },
  "created": 1638553662226,
  "updated": 1638791252647
}