{
  "key": "01120",
  "title": "RigVeda Hymn 01120",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CXX. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01120.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01119.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01121.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXX. A&#347;vins.</h3>  \n<p>1. A&#346;VINS, what praise may win your grace? Who may be pleasing to you both?<br> How shall the ignorant worship you?<br> 2 Here let the ignorant ask the means of you who know&#151;for none beside you knoweth aught&#151;<br> Not of a spiritless mortal man.<br> 3 Such as ye: are, all-wise, we call you. Ye wise, declare to us this day accepted prayer.<br> Loving you well your servant lauds you.<br> 4 Simply, ye Mighty Ones, I ask the Gods of that wondrous oblation hallowed by the mystic word.<br> Save us from what is stronger, fiercer than ourselves.<br> 5 Forth go the hymn that shone in Gho&#7779;&#257; Bh&#7771;gu's like, the song wherewith the son of Pajra worships you,<br> Like some wise minister.<br> 6 Hear ye the song of him who hastens speedily. O A&#347;vins, I am he who sang your praise.<br> Hither, ye Lords of Splendour, hither turn your eyes.<br> 7 For ye were ever nigh to deal forth ample wealth, to give the wealth that ye had gathered up.<br> As such, ye Vasus, guard us well, and keep us safely from the wicked wolf.<br> 8 Give us not up to any man who hateth us, nor let our milch-cows stray, whose udders give us food,<br> Far from our homes without their calves.<br> 9 May they who love you gain you for their Friends. Prepare ye us for opulence with strengthening food,<br> Prepare us for the food that floweth from our cows<br> 10 I have obtained the horseless car of A&#347;vins rich in sacrifice,<br> And I am well content therewith.<br> 11 May it convey me evermore: may the light chariot pass from men<br> To men unto the Soma draught.<br> 12 It holdeth slumber in contempt. and the rich who enjoyeth not:<br> Both vanish quickly and are lost.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01121.htm\">Next: HYMN CXXI. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01120.html",
  "api": "json/hymns/01120.json",
  "data": {
    "title": "HYMN CXX. A&#347;vins.",
    "describe": "A&#346;",
    "feecting": "p:A&#346;VINS, what prais. May win your grace? Wh. May be pleasing to you both? How shall the ignorant worship you?\np:Here let the ignorant ask the means of you who know&#151;for none beside you knoweth aught&#151; Not of a spiritless mortal man.\np:Such as ye: are, all-wise, we call you. Ye wise, declare to us this day accepted prayer.\np: Loving you well your servant lauds you.\r\np:Simply, ye Mighty Ones, I ask the Devas of that wondrous oblation hallowed by the mystic word. Save us from what is stronger, fiercer than ourselves.\np:Forth go the hymn that shone in Gho&#7779;&#257; Bh&#7771;gu's like, the song wherewith the son of Pajra worships you, like some wise minister.\np:Hear ye the song of him who hastens speedily. O A&#347;vins, I am he who sang your praise. Hither, ye Lords of Splendour, hither turn your eyes.\np:For ye were ever nigh to deal forth ample wealth, to give the wealth that ye had gathered up. As such, ye Devas, guard us well, and keep us safely from the wicked wolf.\np:Give us not up to any man who hateth us, nor let our milch-cows stray, whose udders give us food, Far from our homes without their calves.\np:May they who love you gain you for their Friends. Prepare ye us for opulence with strengthening food, Prepare us for the food that floweth from our cows\np:I have obtained the horseless car of A&#347;vins rich in offering, and I am well content therewith.\np:May it convey me evermore. May the light chariot pass from men To men unto the Soma draught.\np:It holdeth slumber in contempt. and the rich who enjoyeth not: Both vanish quickly and are lost.",
    "next": "01121",
    "previous": "01119",
    "book": "01"
  },
  "created": 1638553646442,
  "updated": 1638642698141
}