{
  "key": "01128",
  "title": "RigVeda Hymn 01128",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CXXVIII. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01128.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01127.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01129.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXXVIII. Agni.</h3>  \n<p>1. By Manu's law was born this Agni, Priest most skilled, born for the holy work of those who yearn therefore, yea, born for his own holy work.<br> All ear to him who seeks his love and wealth to him who strives for fame,<br> Priest ne&#146;er deceived, he sits in I&#7735;&#257;'s holy place, girt round in I&#7735;&#257;'s holy place.<br> 2 We call that perfecter of worship by the path or sacrifice; with reverence rich in offerings, with worship rich in offerings.<br> Through presentation of our food he grows not old in this his from;<br> The God whom M&#257;tari&#347;van brought from far away, for Manu brought from far away.<br> 3 In ordered course forthwith he traverses the earth, swift-swallowing, bellowing Steer, bearing the genial seed, bearing the seed and bellowing.<br> Observant with a hundred eyes the God is conqueror in the wood:<br> Agni, who hath his seat in broad plains here below, and in the high lands far away.<br> 4 That Agni, wise High-Priest, in every house takes thought for sacrifice and holy service, yea, takes thought, with mental power, for sacrifice.<br> Disposer, he with mental power shows all things unto him who strives;<br> Whence he was born a guest enriched with holy oil, born as Ordainer and as Priest.<br> 5 When through his power and in his strong prevailing flames the Maruts&#146; gladdening boons mingle with Agni's roar, boons gladdening for the active One,<br> Then he accelerates the gift, and by the greatness of his wealth,<br> Shall rescue us from overwhelming misery, from curse and overwhelming woe.<br> 6 Vast, universal, good he was made messenger; the speeder with his right hand hath not loosed his hold, through love of fame not loosed his hold.<br> He bears oblations to the Gods for whosoever supplicates.<br> Agni bestows a blessing on each pious man, and opens wide the doors for him.<br> 7 That Agni hath been set most kind in camp of men, in sacrifice like a Lord victorious, like a dear Lord in sacred rites.<br> His are the oblations of mankind when offered up at I&#7735;&#257;'s place.<br> He shall preserve us from Varu&#7751;a's chastisement, yea, from the great God's chastisement.<br> 8 Agni the Priest they supplicate to grant them wealth: him, dear, most thoughtful, have they made their messenger, him, offering-bearer have they made,<br> Beloved of all, who knoweth all, the Priest, the Holy one, the Sage&#151;<br> Him, Friend, for help, the Gods when they are fain for wealth, him, Friend, with hymns, when fain for wealth.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01129.htm\">Next: HYMN CXXIX Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01128.html",
  "api": "hymns/01128json",
  "data": {
    "title": "HYMN CXXVIII. Agni.",
    "describe": "By Manu's law was born this Agni, Monk most skilled, born for the holy work of those who yearn therefore, yea, born for his own holy work.",
    "feecting": "p:By Manu's law was born this Agni, Monk most skilled, born for the holy work of those who yearn therefore, yea, born for his own holy work.\np: All ear to him who seeks his love and wealth to him who strives for fame, Monk ne’er deceived, he sits in Iḷā's holy place, girt round in Iḷā's holy place.\r\np:We call that perfecter of worship by the path or offering; with reverence rich in offerings, with worship rich in offerings. Through presentation of our food he grows not old in this his from; The Deva whom Mātariśvan brought from far away, for Manu brought from far away.\np:In ordered course forthwith he traverses the Earth, swift-swallowing, bellowing Steer, bearing the genial seed, bearing the seed and bellowing. Observant with a hundred eyes the Deva is conqueror in the wood: Agni, who hath his seat in broad plains here below, and in the high lands far away.\np:That Agni, wise High-Monk, in every house takes thought for offering and holy service, yea, takes thought, with mental power, for offering. Disposer, he with mental power shows all things unto him who strives; Whence he was born a guest enriched with holy oil, born as Ordainer and as Monk.\np:When through his power and in his strong prevailing flames the Devas’ gladdening boons mingle with Agni's roar, boons gladdening for the active One, then he accelerates the gift, and by the greatness of his wealth, Shall rescue us from overwhelming misery, from curse and overwhelming woe.\np:Vast, universal, good he was made messenger; the speeder with his right hand hath not loosed his hold, through love of fame not loosed his hold. He bears oblations to the Devas for whosoever supplicates. Agni bestows a blessing on each pious man, and opens wide the doors for him.\np:That Agni hath been set most kind in camp of men, in offering like a Lord victorious, like a dear Lord in sacred rites. His are the oblations of mankind when offered up at Iḷā's place. He shall preserve us from Indra's chastisement, yea, from the great Deva's chastisement.\np:Agni the Monk they supplicate to grant them wealth: him, dear, most thoughtful, have they made their messenger, him, offering-bearer have they made, beloved of all, who knoweth all, the Monk, the Holy one, the Sage— Him, Friend, for helps when they are fain for wealth, him, Friend, with hymns, when fain for wealth.",
    "next": "01129",
    "previous": "01127",
    "book": "01"
  },
  "created": 1638553688563
}