{
  "key": "01130",
  "title": "RigVeda Hymn 01130",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CXXX. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01130.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01129.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01131.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXXX. Indra.</h3>  \n<p>1. Come to us, Indra, from afar, conducting us even as a lord of heroes to the gatherings, home, like a King, his heroes' lord.<br> We come with gifts of pleasant food, with juice poured forth, invoking thee,<br> As sons invite a sire, that thou mayst get thee strength thee, bounteousest, to get thee strength.<br> 2 O Indra, drink the Soma juice pressed out with stones. poured from the reservoir, as an ox drinks the spring, a very thirsty bull the spring.<br> For the sweet draught that gladdens thee, for mightiest freshening of thy strength.<br> Let thy Bay Horses bring thee hither as the Sun, as every day they bring the Sun.<br> 3 He found the treasure brought from heaven that lay concealed, close-hidden, like the nestling of a bird, in rock, enclosed in never-ending rock.<br> Best A&#7749;giras, bolt-armed, he strove to win, as &#146;twere, the stall of kine;<br> So Indra hath disclosed the food concealed, disclosed the doors, the food that lay concealed.<br> 4 Grasping his thunderbolt with both hands, Indra made its edge most keen, for hurling, like a carving-knife for Ahi's slaughter made it keen.<br> Endued with majesty and strength, O Indra, and with lordly might,<br> Thou crashest down the trees, as when a craftsman fells, crashest them down as with an axe.<br> 5 Thou, Indra, without effort hast let loose the floods to run their free course down,<br> like chariots, to the sea, like chariots showing forth their strength.<br> They, reaching hence away, have joined their strength for one eternal end,<br> Even as the cows who poured forth every thing for man, Yea, poured forth all things for mankind.<br> 6 Eager for riches, men have formed for thee this song, like as a skilful craftsman fashioneth a car, so have they wrought thee to their bliss;<br> Adorning thee, O Singer, like a generous steed for deeds of might,<br> Yea, like a steed to show his strength and win the prize, that he may bear each prize away.<br> 7 For P&#363;ru thou hast shattered, Indra ninety forts, for Divod&#257;sa thy boon servant with thy bolt, O Dancer, for thy worshipper.<br> For Atithigva he, the Strong, brought &#346;ambara. from the mountain down,<br> Distributing the mighty treasures with his strength, parting all treasures with his strength.<br> 8 Indra in battles help his &#256;ryan worshipper, he who hath hundred helps at hand in every fray, in frays that win the light of heaven.<br> Plaguing the lawless he gave up to Manu's seed the dusky skin;<br> Blazing, &#146;twere, he burns each covetous man away, he burns, the tyrannous away.<br> 9 Waxed strong in might at dawn he tore the Sun's wheel off. Bright red, he steals away their speech, the Lord of Power, their speech he steals away from them,<br> As thou with eager speed, O Sage, hast come from far away to help,<br> As winning for thine own all happiness of men, winning all happiness each day.<br> 10 Lauded with our new hymns, O vigorous in deed, save us with strengthening help, thou Shatterer of the Forts!<br> Thou, Indra, praised by Divod&#257;sa's clansmen, as heaven grows great with days, shalt wax in glory.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01131.htm\">Next: HYMN CXXXI. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01130.html",
  "api": "json/hymns/01130.json",
  "data": {
    "key": "01130",
    "title": "HYMN CXXX. Indra.",
    "describe": "Come to us, Indra, from afar, conducting us even as a lord of heroes to the gatherings, home, like a King, his heroes' lord.",
    "feecting": "p:Come to us, Indra, from afar, conducting us even as a lord of heroes to the gatherings, home, like a King, his heroes' lord.\np: We come with gifts of pleasant food, with juice poured forth, invoking thee, as sons invite a sire, that tho. Mayst get thee strength thee, bounteousest, to get thee strength.\r\np:O Indra, drink the Soma juice pressed out with stones. poured from the reservoir, as an ox drinks the spring, a very thirsty bull the spring. For the sweet draught that gladdens thee, for mightiest freshening of thy strength. Let thy Bay Horses bring thee hither as the Sun, as every day they bring the Sun.\np:He found the treasure brought from Heaven that lay concealed, close-hidden, like the nestling of a bird, in rock, enclosed in never-ending rock. Best Aṅgiras, bolt-armed, he strove to win, as ’twere, the stall of kine; So Indra hath disclosed the food concealed, disclosed the doors, the food that lay concealed.\np:Grasping his thunderbolt with both hands, Indra made its edge most keen, for hurling, like a carving-knife for Ahi's slaughter made it keen. Endued with majesty and strength, O Indra, and with lordly might, Thou crashest down the trees, as when a craftsman fells, crashest them down as with an axe.\np:Thou, Indra, without effort hast let loose the floods to run their free course down, like chariots, to the sea, like chariots showing forth their strength. They, reaching hence away, have joined their strength for on eternal end, Even as the cows who poured forth every thing for man, Yea, poured forth all things for mankind.\np:Eager for riches, men have formed for thee this song, like as a skilful craftsman fashioneth a car, so have they wrought thee to their bliss; Adorning thee, O Singer, like a generous steed for deeds of might, Yea, like a steed to show his strength and win the prize, that h. May bear each prize away.\np:For Pūru thou hast shattered, Indra ninety forts, for Divodāsa thy boon servant with thy bolt, O Dancer, for thy worshipper. For Atithigva he, the Strong, brought Śambara. from the mountain down, Distributing the mighty treasures with his strength, parting all treasures with his strength.\np:Indra in battles help his Āryan worshipper, he who hath hundred helps at hand in every fray, in frays that win the light of Heaven. Plaguing the lawless he gave up to Manu's seed the dusky skin; Blazing, ’twere, he burns each covetous man away, he burns, the tyrannous away.\np:Waxed strong in might at dawn he tore the Sun's wheel off. Bright red, he steals away their speech, the Lord of Power, their speech he steals away from them, as thou with eager speed, O Sage, hast come from far away to help, as winning for thine own all happiness of men, winning all happiness each day.\np:Lauded with our new hymns, O vigorous in deed, save us with strengthening help, thou Shatterer of the Forts! Thou, Indra, praised by Divodāsa's clansmen, as Heaven grows great with days, shalt wax in glory.",
    "meta": {
      "next": "01131",
      "previous": "01129",
      "book": "01",
      "original": "https://sacred-texts.com/hin/rigveda/rv01130.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv01130.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          },
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          }
        ]
      },
      {
        "name": "O Singer",
        "hymns": [
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          }
        ]
      },
      {
        "name": "O Dancer",
        "hymns": [
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          },
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          },
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          },
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          }
        ]
      },
      {
        "name": "O Sage",
        "hymns": [
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          }
        ]
      },
      {
        "name": "O vigorous",
        "hymns": [
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          },
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          },
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          },
          {
            "key": "01130",
            "title": "HYMN CXXX. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638553699111,
  "updated": 1667440426716
}