{
  "key": "01159",
  "title": "RigVeda Hymn 01159",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLIX. Heaven and Earth.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01159.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01158.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01160.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLIX. Heaven and Earth.</h3>  \n<p>1. I PRAISE with sacrifices mighty Heaven and Earth at festivals, the wise, the Strengtheners of Law.<br> Who, having Gods for progeny, conjoined with Gods, through wonder-working wisdom bring forth choicest boons.<br> 2 With invocations, on the gracious Father's mind, and on the Mother's great inherent power I muse.<br> Prolific Parents, they have made the world of life, and for their brood all round wide immortality.<br> 3 These Sons of yours well skilled in work, of wondrous power, brought forth to life the two great Mothers first of all.<br> To keep the truth of all that stands and all that moves, ye guard the station of your Son who knows no guile.<br> 4 They with surpassing skill, most wise, have measured out the Twins united in their birth and in their home.<br> They, the refulgent Sages, weave within the sky, yea, in the depths of sea, a web for ever new.<br> 5 This is to-day the goodliest gift of Savitar: this thought we have when now the God is furthering us.<br> On us with loving-kindness Heaven and Earth bestow riches and various wealth and treasure hundredfold!</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01160.htm\">Next: HYMN CLX. Heaven and Earth.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01159.html",
  "api": "json/hymns/01159.json",
  "data": {
    "title": "HYMN CLIX. Heaven and Earth.",
    "describe": "I PRAISE with offers mighty Heaven and Earth at festivals, the wise, the Strengtheners of Law.",
    "feecting": "p:I PRAISE with offers mighty Heaven and Earth at festivals, the wise, the Strengtheners of Law.\np: Who, having Devas for progeny, conjoined with Devas, through wonder-working wisdom bring forth choicest boons.\r\np:With invocations, on the gracious Father's mind, and on the Mother's great inherent power I muse. Prolific Parents, they have made the world of life, and for their brood all round wide immortality.\np:These Sons of yours well skilled in work, of wondrous power, brought forth to life the two great Mothers first of all. To keep the truth of all that stands and all that moves, ye guard the station of your Son who knows no guile.\np:They with surpassing skill, most wise, have measured out the Twins united in their birth and in their home. They, the refulgent Sages, weave within the sky, yea, in the depths of sea, a web forever new.\np:This is to-day the goodliest gift of Indra: this thought we have when now the Deva is furthering us. On us with loving-kindness Heaven and Earth bestow riches and various wealth and treasure hundredfold!",
    "next": "01160",
    "previous": "01158",
    "book": "01"
  },
  "created": 1638553852646,
  "updated": 1638642698176
}