{
  "key": "01157",
  "title": "RigVeda Hymn 01157",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLVII. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01157.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01156.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01158.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLVII. A&#347;vins.</h3>  \n<p>1. AGNI is wakened: S&#363;rya riseth from the earth. Mighty, refulgent Dawn hath shone with all her light.<br> The A&#347;vins have equipped their chariot for the course. God Savitar hath moved the folk in sundry ways.<br> 2 When, A&#347;vins, ye equip your very mighty car, bedew, ye Twain, our power with honey and with oil.<br> To our devotion give victorious strength in war: may we win riches in the heroes' strife for spoil.<br> 3 Nigh to us come the A&#347;vins' lauded three-wheeled car, the car laden with meath and drawn by fleet-foot steeds,<br> Three-seated, opulent, bestowing all delight. may it bring weal to us, to cattle and to men.<br> 4 Bring hither nourishment for us, ye A&#347;vins Twain; sprinkle us with your whip that drops with honey-dew.<br> Prolong our days of life, wipe out our trespasses; destroy our foes, be our companions and our Friends.<br> 5 Ye store the germ of life in female creatures, ye lay it up within all living beings.<br> Ye have sent forth, O A&#347;vins passing mighty, the fire, the sovrans of the wood, the waters,<br> 6 Leeches are ye with medicines to heal us, and charioteers are ye with skill in driving.<br> Ye Strong, give sway to him who brings oblation and with his heart pours out his gift before you.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01158.htm\">Next: HYMN CLVIII. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01157.html",
  "api": "json/hymns/01157.json",
  "data": {
    "title": "HYMN CLVII. A&#347;vins.",
    "describe": "AGNI is wakened: S&#363;",
    "feecting": "p:AGNI is wakened: S&#363;rya riseth from the Earth. Mighty, refulgent Dawn hath shone with all her light.\np: The A&#347;vins have equipped their chariot for the course. God Indra hath moved the folk in sundry ways.\r\np:When, A&#347;vins, ye equip your very mighty car, bedew, ye Twain, our power with honey and with oil. To our devotion give victorious strength in war. May we win riches in the heroes' strife for spoil.\np:Nigh to us come the A&#347;vins' lauded three-wheeled car, the car laden with meath and drawn by fleet-foot steeds, Three-seated, opulent, bestowing all delight. May it bring weal to us, to cattle and to men.\np:Bring hither nourishment for us, ye A&#347;vins Twain; sprinkle us with your whip that drops with honey-dew. Prolong our days of life, wipe out our trespasses; destroy our foes, be our companions and our Friends.\np:Ye store the germ of life in female creatures, ye lay it up within all living beings. Ye have sent forth, O A&#347;vins passing mighty, the fire, the sovrans of the wood, the waters,\np:Leeches are ye with medicines to heal us, and charioteers are ye with skill in driving. Ye Strong, give sway to him who brings oblation and with his heart pours out his gift before you.",
    "next": "01158",
    "previous": "01156",
    "book": "01"
  },
  "created": 1638553842098,
  "updated": 1638791591314
}