{
  "key": "01154",
  "title": "RigVeda Hymn 01154",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLIV. Vi&#7779;&#7751;u</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01154.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01153.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01155.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLIV. Vi&#7779;&#7751;u</h3>  \n<p>1. I WILL declare the mighty deeds of Vi&#7779;&#7751;u, of him who measured out the earthly regions,<br> Who propped the highest place of congregation, thrice setting down his footstep, widely striding.<br> 2 For this his mighty deed is Vi&#7779;&#7751;u lauded, like some wild beast, dread, prowling, mountain-roaming;<br> He within whose three wide-extended paces all living creatures have their habitation.<br> 3 Let the hymn lift itself as strength to Vi&#7779;&#7751;u, the Bull far-striding, dwelling on the mountains,<br> Him who alone with triple step hath measured this common dwelling-place, long, far extended.<br> 4 Him whose three places that are filled with sweetness, imperishable, joy as it may list them,<br> Who verily alone upholds the threefold, the earth, the heaven, and all living creatures.<br> 5 May I attain to that his well-loved mansion where men devoted to the Gods are happy.<br> For there springs, close akin to the Wide-Strider, the well of meath in Vi&#7779;&#7751;u's highest footstep.<br> 6 Fain would we go unto your dwelling-places where there are many-horned and nimble oxen,<br> For mightily, there, shineth down upon us the widely-striding Bull's sublimest mansion.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01155.htm\">Next: HYMN CLV. Vi&#7779;&#7751;u-Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01154.html",
  "api": "json/hymns/01154.json",
  "data": {
    "key": "01154",
    "title": "HYMN CLIV. Indra",
    "describe": "I WILL declare the mighty deeds of Indra, of him who measured out the earthly regions, who propped the highest place of congregation, thrice setting down his footstep, widely striding.",
    "feecting": "p:I WILL declare the mighty deeds of Indra, of him who measured out the earthly regions, who propped the highest place of congregation, thrice setting down his footstep, widely striding.\np:For this his mighty deed is Indra lauded, like some wild beast, dread, prowling, mountain-roaming; He within whose three wide-extended paces all living creatures have their habitation.\np:Let the hymn lift itself as strength to Indra, the Bull far-striding, dwelling on the mountains, him who alone with triple step hath measured this common dwelling-place, long, far extended.\np:Him whose three places that are filled with sweetness, imperishable, joy as i. May list them, who verily alone upholds the threefold, the Earth, the Heaven, and all living creatures.\np:May I attain to that his well-loved mansion where men devoted to the Devas are happy.\np: For there springs, close akin to the Wide-Strider, the well of meath in Indra's highest footstep.\r\np:Fain would we go unto your dwelling-places where there are many-horned and nimble oxen, for mightily, there, shineth down upon us the widely-striding Bull's sublimest mansion.",
    "meta": {
      "next": "01155",
      "previous": "01153",
      "book": "01",
      "original": "https://sacred-texts.com/hin/rigveda/rv01154.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv01154.htm"
    },
    "deities": []
  },
  "created": 1638553826277,
  "updated": 1639023783865
}