{
  "key": "01165",
  "title": "RigVeda Hymn 01165",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLXV. Indra. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01165.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01164.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01166.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLXV. Indra. Maruts.</h3>  \n<p>1. WITH what bright beauty are the Maruts jointly invested, peers in age, who dwell together?<br> From what place have they come? With what intention? Sing they their strength through love of wealth, these Heroes?<br> 2 Whose prayers have they, the Youthful Ones, accepted? Who to his sacrifice hath turned the Maruts?<br> We will delay them on their journey sweeping&#151;with what high spirit!&#151;through the air like eagles.<br> 3 Whence comest thou alone, thou who art mighty, Indra, Lord of the Brave? What is thy purpose?<br> Thou greetest us when meeting us the Bright Ones. Lord of Bay Steeds, say what thou hast against us.<br> 4 Mine are devotions, hymns; sweet are libations. Strength stirs, and hurled forth is my bolt of thunder.<br> They call for me, their lauds are longing for me. These my Bay Steeds bear me to these oblations.<br> 5 Therefore together with our strong companions, having adorned our bodies, now we harness,<br> Our spotted deer with might, for thou, O Indra, hast learnt and understood our Godlike nature.<br> 6 Where was that nature then of yours, O Maruts, that ye charged me alone to slay the Dragon?<br> For I in truth am fierce and strong and mighty. I bent away from every foeman's weapons.<br> 7 Yea, much hast thou achieved with us for comrades, with manly valour like thine own, thou Hero.<br> Much may we too achieve, O mightiest Indra, with our great power, we Maruts, when we will it.<br> 8 V&#7771;tra I slew by mine own strength, O Maruts, having waxed mighty in mine indignation.<br> I with the thunder in my hand created for man these lucid softly flowing waters.<br> 9 Nothing, O Maghavan, stands firm before thee; among the Gods not one is found thine equal.<br> None born or springing into life comes nigh thee. Do what thou hast to do, exceeding mighty?<br> 10 Mine only be transcendent power, whatever I, daring in my spirit, may accomplish.<br> For I am known as terrible, O Maruts I, Indra, am the Lord of what I ruined.<br> 11 Now, O ye Maruts, hath your praise rejoiced me, the glorious hymn which ye have made me, Heroes!<br> For me, for Indra, champion strong in battle, for me, yourselves, as lovers for a lover.<br> 12 Here, truly, they send forth their sheen to meet me, wearing their blameless glory and their vigour.<br> When I have seen you, Maruts, in gay splendour, ye have delighted me, so now delight me.<br> 13 Who here hath magnified you, O ye Maruts? speed forward, O ye lovers, to your lovers.<br> Ye Radiant Ones, assisting their devotions, of these my holy rites he ye regardful.<br> 14 To this hath M&#257;nya's wisdom brought us, so as to aid, as aids the poet him who worships.<br> Bring hither quick! On to the sage, ye Maruts! These prayers for you the singer hath recited.<br> 15 May this your praise, may this your song, O Maruts, sung by the poet, M&#257;na's son, M&#257;nd&#257;rya,<br> Bring offspring for ourselves with food to feed us. May we find strengthening food in full abundance!</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01166.htm\">Next: HYMN CLXVI. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01165.html",
  "api": "json/hymns/01165.json",
  "data": {
    "title": "HYMN CLXV. Indra. Devas.",
    "describe": "WITH what bright beauty are the Devas jointly invested, peers in age, who dwell together?",
    "feecting": "p:WITH what bright beauty are the Devas jointly invested, peers in age, who dwell together? From what place have they come? With what intention? Sing they their strength through love of wealth, these Heroes?\np:Whose prayers have they, the Youthful Ones, accepted? Who to his offering hath turned the Devas? We will delay them on their journey sweeping&#151;with what high spirit!&#151;through the air like eagles.\np:Whence comest thou alone, thou who art mighty, Indra, Lord of the Brave? What is thy purpose? Thou greetest us when meeting us the Bright Ones. Lord of Bay Steeds, say what thou hast against us.\np:Mine are devotions, hymns; sweet are libations. Strength stirs, and hurled forth is my bolt of thunder.\np: They call for me, their lauds are longing for me. These my Bay Steeds bear me to these oblations.\r\np:Therefore together with our strong companions, having adorned our bodies, now we harness, Our spotted deer with might, for thou, O Indra, hast learnt and understood our Godlike nature.\np:Where was that nature then of yours, O Devas, that ye charged me alone to subdue the Dragon? For I in truth am fierce and strong and mighty. I bent away from every foeman's weapons.\np:Yea, much hast thou achieved with us for comrades, with manly valour like thine own, thou Hero. Muc. May we too achieve, O mightiest Indra, with our great power, we Devas, when we will it.\np:V&#7771;tra I slew by mine own strength, O Devas, having waxed mighty in mine indignation. I with the thunder in my hand created for man these lucid softly flowing waters.\np:Nothing, O Indra, stands firm before thee; among the Devas not one is found thine equal. None born or springing into life comes nigh thee. Do what thou hast to do, exceeding mighty?\np:Mine only be transcendent power, whatever I, daring in my spirit. May accomplish. For I am known as terrible, O Devas I, Indra, am the Lord of what I ruined.\np:Now, O ye Devas, hath your praise rejoiced me, the glorious hymn which ye have made me. Heroes! For me, for Indra, champion strong in battle, for me, yourselves, as lovers for a lover.\np:Here, truly, they send forth their sheen to meet me, wearing their blameless glory and their vigour. When I have seen you, Devas, in gay splendour, ye have delighted me, so now delight me.\np:Who here hath magnified you, O ye Devas? speed forward, O ye lovers, to your lovers. Ye Radiant Ones, assisting their devotions, of these my holy rites he ye regardful.\np:To this hath M&#257;nya's wisdom brought us, so as to aid, as aids the poet him who worships. Bring hither quick! On to the sage, ye Devas! These prayers for you the singer hath recited.\np:May this your praise. May this your song, O Devas, sung by the poet, M&#257;na's son, M&#257;nd&#257;rya, Bring offspring for ourselves with food to feed us. May we find strengthening food in full abundance!",
    "next": "01166",
    "previous": "01164",
    "book": "01"
  },
  "created": 1638553884536,
  "updated": 1638646518968
}