{
  "key": "01169",
  "title": "RigVeda Hymn 01169",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLXIX. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01169.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01168.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01170.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLXIX. Indra.</h3>  \n<p>1. As, Indra, from great treason thou protectest, yea, from great treachery these who approach us,<br> So, marking well, Controller of the Maruts grant us their blessings, for they are thy dearest.<br> 2 The various doings of all mortal people by thee are ordered, in thy wisdom, Indra.<br> The host of Maruts goeth forth exulting to win the light-bestowing spoil of battle.<br> 3 That spear of thine sat firm for us, O Indra: the Maruts set their whole dread power in motion.<br> E&#146;en Agni shines resplendent in the brush-wood: the viands hold him as floods hold an island.<br> 4 Vouchsafe us now that opulence, O Indra, as guerdon won by mightiest donation.<br> May hymns that please thee cause the breast of V&#257;yu to swell as with the mead's refreshing sweetness.<br> 5 With thee, O Indra, are most bounteous riches that further every one who lives uprightly.<br> Now may these Maruts show us loving-kindness, Gods who of old were ever prompt to help us.<br> 6 Bring forth the Men who rain down boons, O Indra: exert thee in the great terrestrial region;<br> For their broad-chested speckled deer are standing like a King's armies on the field of battle.<br> 7 Heard is the roar of the advancing Maruts, terrific, glittering, and swiftly moving,<br> Who with their rush o&#146;erthrow as &#146;twere a sinner the mortal who would fight with those who love him<br> 8 Give to the M&#257;nas, Indra with Maruts, gifts universal, gifts of cattle foremost.<br> Thou, God, art praised with Gods who must be lauded. May we find strengthening food in full abundance.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01170.htm\">Next: HYMN CLXX. Indra. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01169.html",
  "api": "json/hymns/01169.json",
  "data": {
    "title": "HYMN CLXIX. Indra.",
    "describe": "As, Indra, from great treason thou protectest, yea, from great treachery these who approach us, So, marking well, Controller of the Devas grant us their blessings, for they are thy dearest.",
    "feecting": "p:As, Indra, from great treason thou protectest, yea, from great treachery these who approach us, So, marking well, Controller of the Devas grant us their blessings, for they are thy dearest.\np:The various doings of all mortal people by thee are ordered, in thy wisdom, Indra.\np: The host of Devas goeth forth exulting to win the light-bestowing spoil of battle.\r\np:O Indra: the Devas set their wole power in motion. E&#146;en Agni shines resplendent in the brush-wood: the offerings hold him as floods hold an island.\np:Vouchsafe us now that opulence, O Indra, as guerdon won by mightiest donation. May hymns that please thee cause the breast of V&#257;yu to swell as with the mead's refreshing sweetness.\np:With thee, O Indra, are most bounteous riches that further every one who lives uprightly. No. May these Devas show us loving-kindness, Devas who of old were ever prompt to help us.\np:Bring forth the Men who rain down boons, O Indra, for their broad-chested speckled deer are standing like a King's armies on the field of battle.\np:Heard is the roar of the advancing Devas, terrific, glittering, and swiftly moving, who with their rush o&#146;erthrow as &#146;twere a sinner the mortal who would fight with those who love him\np:Give to the M&#257;nas, Indra with Devas, gifts universal. Thou, Deva, art praised with Devas who must be lauded. May we find strengthening food in full abundance.",
    "next": "01170",
    "previous": "01168",
    "book": "01"
  },
  "created": 1638553905911,
  "updated": 1638647072244
}