{
  "key": "01163",
  "title": "RigVeda Hymn 01163",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLXIII. The Horse.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01163.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01162.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01164.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLXIII. The Horse.</h3>  \n<p>1. WHAT time, first springing into life, thou neighedst, proceeding from the sea or upper waters,<br> Limbs of the deer hadst thou, and eagle pinions. O Steed, thy birth is nigh and must be lauded.<br> 2 This Steed which Yama gave hath Trita harnessed, and him, the first of all, hath Indra mounted.<br> His bridle the Gandharva grasped. O Vasus, from out the Sun ye fashioned forth the Courser.<br> 3 Yama art thou, O Horse; thou art &#256;ditya; Trita art thou by secret operation.<br> Thou art divided thoroughly from Soma. They say thou hast three bonds in heaven<br> that hold thee.<br> 4 Three bonds, they say, thou hast in heaven that bind thee, three in the waters,<br> three within the ocean.<br> To me thou seemest Varu&#7751;a, O Courser, there where they say is thy sublimest birth-place.<br> 5 Here-, Courser, are the places where they groomed thee, here are the traces of thy hoofs as winner.<br> Here have I seen the auspicious reins that guide thee, which those who guard the holy Law keep safely.<br> 6 Thyself from far I recognized in spirit,&#151;a Bird that from below flew through the heaven.<br> I saw thy head still soaring, striving upward by paths unsoiled by dust, pleasant to travel.<br> 7 Here I beheld thy form, matchless in glory, eager to win thee food at the Cow's station.<br> Whene&#146;er a man brings thee to thine enjoyment, thou swallowest the plants most greedy eater.<br> 8 After thee, Courser, come the car, the bridegroom, the kine come after, and the charm of maidens.<br> Full companies have followed for thy friendship: the pattern of thy vigour Gods have copied.<br> 9 Horns made of gold hath he: his feet are iron: less fleet than he, though swift as thought, is Indra.<br> The Gods have come that they may taste the oblation of him who mounted, first of all, the Courser.<br> 10 Symmetrical in flank, with rounded haunches, mettled like heroes, the Celestial Coursers<br> Put forth their strength, like swans in lengthened order, when they, the Steeds, have reached the heavenly causeway.<br> 11 A body formed for flight hast thou, O Charger; swift as the wind in motion is thy spirit.<br> Thy horns are spread abroad in all directions: they move with restless beat in wildernesses.<br> 12 The strong Steed hath come forward to the slaughter, pondering with a mind directed God-ward.<br> The goat who is his kin is led before him the sages and the singers follow after.<br> 13 The Steed is come unto the noblest mansion, is come unto his Father and his Mother.<br> This day shall he approach the Gods, most welcome: then he declares good gifts to him who offers.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01164.htm\">Next: HYMN CLXIV. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01163.html",
  "api": "json/hymns/01163.json",
  "data": {
    "title": "HYMN CLXIII. The Horse.",
    "describe": "WHAT time, first springing into life, thou neighedst, proceeding from the sea or upper waters, Limbs of the deer hadst thou, and eagle pinions.",
    "feecting": "p:WHAT time, first springing into life, thou neighedst, proceeding from the sea or upper waters, Limbs of the deer hadst thou, and eagle pinions. O Steed, thy birth is nigh and must be lauded.\np:This Steed which Yama gave hath Trita harnessed, and him, the first of all, hath Indra mounted.\np: His bridle the Gandharva grasped. O Devas, from out the Sun ye fashioned forth the Courser.\r\np:Yama art thou, O Horse; thou art &#256;ditya; Trita art thou by secret operation. Thou art divided thoroughly from Soma. They say thou hast three bonds in Heaven that hold thee.\np:Three bonds, they say, thou hast in Heaven that bind thee, three in the waters, three within the ocean. To me thou seemest Varu&#7751;a, O Courser, there where they say is thy sublimest birth-place.\np:Here-, Courser, are the places where they groomed thee, here are the traces of thy hoofs as winner. Here have I seen the auspicious reins that guide thee, which those who guard the holy Law keep safely.\np:Thyself from far I recognized in spirit,&#151;a Bird that from below flew through the Heaven. I saw thy head still soaring, striving upward by paths unsoiled by dust, pleasant to travel.\np:Here I beheld thy form, matchless in glory, eager to win thee food at the Cow's station. Whene&#146;er a man brings thee to thine enjoyment, thou swallowest the plants most greedy eater.\np:After thee, Courser, come the car, the bridegroom, the kine come after, and the charm of maidens. Full companies have followed for thy friendship: the pattern of thy vigour Devas have copied.\np:Horns made of gold hath he: his feet are iron: less fleet than he, though swift as thought, is Indra. The Devas have come that the, may taste the oblation of him who mounted, first of all, the Courser.\np:Symmetrical in flank, with rounded haunches, mettled like heroes, the Celestial Coursers Put forth their strength, like swans in lengthened order, when they, the Steeds, have reached the heavenly causeway.\np:A body formed for flight hast thou, O Charger; swift as the wind in motion is thy spirit. Thy horns are spread abroad in all directions: they move with restless beat in wildernesses.\np:The strong Steed hath come forward to the slaughter, pondering with a mind directed God-ward. The goat who is his kin is led before him the sages and the singers follow after.\np:The Steed is come unto the noblest mansion, is come unto his Father and his Mother. This day shall he approach the Devas, most welcome: then he declares good gifts to him who offers.",
    "next": "01164",
    "previous": "01162",
    "book": "01"
  },
  "created": 1638553873701,
  "updated": 1638790697668
}