{
  "key": "01160",
  "title": "RigVeda Hymn 01160",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLX. Heaven and Earth.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01160.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01159.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01161.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLX. Heaven and Earth.</h3>  \n<p>1. THESE, Heaven and Earth, bestow prosperity on all, sustainers of the region, Holy Ones and wise,<br> Two Bowls of noble kind: between these Goddesses the God, the fulgent Sun, travels by fixed decree.<br> 2 Widely-capacious Pair, mighty, that never fail, the Father and the Mother keep all creatures safe:<br> The two world-halves, the spirited, the beautiful, because the Father hath clothed them in goodly forms.<br> 3 Son of these Parents, he the Priest with power to cleanse, Sage, sanctifies the worlds with his surpassing power.<br> Thereto for his bright milk he milked through all the days the party-coloured Cow and the prolific Bull.<br> 4 Among the skilful Gods most skilled is he, who made the two world-halves which bring prosperity to all;<br> Who with great wisdom measured both the regions out, and stablished them with pillars that shall ne&#146;er decay.<br> 5 Extolled in song, O Heaven and Earth, bestow on us, ye mighty Pair, great glory and high lordly sway,<br> Whereby we may extend ourselves ever over the folk; and send us strength that shall deserve the praise of men.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01161.htm\">Next: HYMN CLXI. &#7770;bhus.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01160.html",
  "api": "json/hymns/01160.json",
  "data": {
    "title": "HYMN CLX. Heaven and Earth.",
    "describe": "THESE.",
    "feecting": "p:THESE. Heaven and Earth, bestow prosperity on all, sustainers of the region, Holy Ones and wise, Two Bowls of noble kind: between these Goddesses the Deva, the fulgent Sun, travels by fixed decree.\np:Widely-capacious Pair, mighty, that never fail, the Father and the Mother keep all creatures safe: The two world-halves, the spirited, the beautiful, because the Father hath clothed them in goodly forms.\np:Son of these Parents, he the Monk with power to cleanse, Sage, sanctifies the worlds with his surpassing power.\np: Thereto for his bright milk he milked through all the days the party-coloured Cow and the prolific Bull.\r\np:Among the skilful Devas most skilled is he, who made the two world-halves which bring prosperity to all. Who with great wisdom measured both the regions out, and stablished them with pillars that shall ne&#146;er decay.\np:Extolled in song, O Heaven and Earth, bestow on us, ye mighty Pair, great glory and high lordly sway, Whereby we may extend ourselves ever over the folk; and send us strength that shall deserve the praise of men.",
    "next": "01161",
    "previous": "01159",
    "book": "01"
  },
  "created": 1638553857900,
  "updated": 1638647017766
}