{
  "key": "01171",
  "title": "RigVeda Hymn 01171",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLXXI. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01171.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01170.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01172.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLXXI. Maruts.</h3>  \n<p>1. To you I come with this mine adoration, and with a hymn I crave the Strong Ones' favour<br> A hymn that truly makes you joyful, Maruts. Suppress your anger and unyoke your horses.<br> 2 Maruts, to you this laud with prayer and worship, formed in the mind and heart, ye Gods, is offered.<br> Come ye to us, rejoicing in your spirit, for ye are they who make our prayer effective.<br> 3 The Maruts, praised by us, shall show us favour; Maghavan, lauded, shall be most propitious.<br> Maruts,, may all our days that are to follow be very pleasant, lovely and triumphant.<br> 4 I fled in <A HREF=\"errata.htm#6\">terror</A> from this mighty Indra, my body trembling in alarm, O Maruts.<br> Oblations meant for you had been made ready; these have we set aside: for this forgive us.<br> 5 By whom the M&#257;nas recognize the day-springs, by whose strength at the dawn of endless mornings,<br> Give us, thou Mighty, glory with Maruts. fierce with the fierce, the Strong who givest triumph.<br> 6 Do thou, O Indra, guard the conquering Heroes, and rid thee of thy wrath against the Maruts,<br> With them, the wise, victorious and bestowing. May we find strengthening food in full abundance.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01172.htm\">Next: HYMN CLXXII. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/01171.html",
  "api": "hymns/01171json",
  "data": {
    "title": "HYMN CLXXI. Devas.",
    "describe": "To you I come with this mine adoration, and with a hymn I crave the Strong Ones' favour a hymn that truly makes you joyful, Devas.",
    "feecting": "p:To you I come with this mine adoration, and with a hymn I crave the Strong Ones' favour a hymn that truly makes you joyful, Devas. Suppress your anger and unyoke your horses.\np:Devas, to you this laud with prayer and worship, formed in the mind and heart, ye Devas, is offered.\np: Come ye to us, rejoicing in your spirit, for ye are they who make our meditation effective.\r\np:The Devas, praised by us, shall show us favour; Indra, lauded, shall be most propitious. Devas. May all our days that are to follow be very pleasant, lovely and triumphant.\np:O Devas, offerings meant for you have been made ready; these have we set aside.\np:By whose strength at the dawn of endless mornings. Give us, thou Mighty, glory with Devas. The Strong who givest triumph.\np:Do thou, O Indra, guard the conquering Heroes, and the Devas, with them the wise victorious and bestowing. May we find strengthening food in full abundance.",
    "next": "01172",
    "previous": "01170",
    "book": "01"
  },
  "created": 1638553916693
}