{
  "key": "01184",
  "title": "RigVeda Hymn 01184",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLXXXIV. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01184.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01183.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01185.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLXXXIV. A&#347;vins.</h3>  \n<p>1. LET us invoke you both this day and after the priest is here with lauds when morn is breaking:<br> N&#257;satyas, wheresoe&#146;er ye be, Heaven's Children, for him who is more liberal than the godless.<br> 2 With us, ye Mighty, let yourselves be joyful, glad in our stream of Soma slay the niggards.<br> Graciously hear my hymns and invitations, marking, O Heroes, with your cars my longing.<br> 3 N&#257;satyas, P&#363;&#7779;ans, ye as Gods for glory arranged and set in order S&#363;rya's bridal.<br> Your giant steeds move on, sprung from the waters, like ancient times of Varu&#7751;a the Mighty.<br> 4 Your grace be with us, ye who love sweet juices: further the hymn sung by the poet M&#257;na,<br> When men are joyful in your glorious actions, to win heroic strength, ye Bounteous Givers.<br> 5 This praise was made, O liberal Lords, O A&#347;vins, for you with fair adornment by the M&#257;nas.<br> Come to our house for us and for our children, rejoicing, O N&#257;satyas, in Agastya.<br> 6 We have passed o&#146;er the limit of this darkness: our praise hath been bestowed on you, O A&#347;vins.<br> Come hitherward by paths which Gods have travelled. may we find strengthening food in full abundance.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01185.htm\">Next: HYMN CLXXXV. Heaven and Earth.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/01184.html",
  "api": "hymns/01184json",
  "data": {
    "title": "HYMN CLXXXIV. Aśvins.",
    "describe": "LET us invoke you both this day and after the Monk is here with lauds when morn is breaking, wheresoe’er ye be, Heaven's Children, for him who is more liberal than the godless.",
    "feecting": "p:LET us invoke you both this day and after the Monk is here with lauds when morn is breaking, wheresoe’er ye be, Heaven's Children, for him who is more liberal than the godless.\np:With us, ye Mighty, let yourselves be joyful, glad in our stream of Soma.\np: Graciously hear my hymns and invitations, marking, O Heroes, with your cars my longing.\r\np:Devas for glory arranged and set in order. Your giant steeds move on, sprung from the waters, like ancient times of Indra the Mighty.\np:Your grace be with us, ye who love sweet juices: further the hymn sung by the poet, when men are joyful in your glorious actions, to win heroic strength, ye Bounteous Givers.\np:This praise was made, O liberal Lords, O Aśvins, for you with fair adornment. Come to our house for us and for our children, rejoicing.\np:We have passed o’er the limit of this darkness: our praise hath been bestowed on you, O Aśvins. Come hitherward by paths which Devas have travelled. May we find strengthening food in full abundance.",
    "next": "01185",
    "previous": "01183",
    "book": "01"
  },
  "created": 1638553985495
}