{
  "key": "01180",
  "title": "RigVeda Hymn 01180",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLXXX. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01180.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01179.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01181.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLXXX. A&#347;vins.</h3>  \n<p>1. LIGHTLY your coursers travel through the regions when round the sea of air your car is flying.<br> Your golden fellies scatter drops of moisture: drinking the sweetness ye <A HREF=\"errata.htm#7\">attend</A> the Mornings.<br> 2 Ye as ye travel overtake the Courser who flies apart, the Friend of man, most holy.<br> The prayer is that the Sister may convey you, all praised, meath-drinkers! to support and strengthen.<br> 3 Ye have deposited, matured within her, in the raw cow the first milk of the milch-cow,<br> Which the bright offerer, shining like a serpent mid trees, presents to you whose form is perfect.<br> 4 Ye made the fierce heat to be full of sweetness for Atri at his wish, like streaming water.<br> Fire-offering thence is yours, O A&#347;vins, Heroes: your car-wheels speed to us like springs of honey.<br> 5 Like Tugra's ancient son may I, ye Mighty, bring you to give your gifts with milk-oblations.<br> Your greatness compasseth Earth, Heaven, and Waters: decayed for you is sorrow's net, ye Holy.<br> 6 When, Bounteous Ones, ye drive your yoked team downward, ye send, by your own natures, understanding.<br> Swift as the wind let the prince please and feast you: he, like a pious man, gains strength for increase.<br> 7 For verily we truthful singers praise you the niggard trafficker is here excluded.<br> Now, even now do ye O blameless A&#347;vins, ye Mighty, guard the man whose God is near him.<br> 8 You of a truth day after day, O A&#347;vins, that he might win the very plenteous torrent,<br> Agastya, famous among mortal heroes, roused with a thousand lauds like sounds of music.<br> 9 When with the glory of your car ye travel, when we go speeding like the priest of mortals,<br> And give good horses to sacrificers, may we, N&#257;satyas! gain our share of riches.<br> 10 With songs of praise we call to-day, O A&#347;vins, that your new chariot, for our own well-being,<br> That circles heaven with never-injured fellies. May we find strengthening food in full abundance.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01181.htm\">Next: HYMN CLXXXI. A&#347;vins</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01180.html",
  "api": "json/hymns/01180.json",
  "data": {
    "key": "01180",
    "title": "HYMN CLXXX. Indra.",
    "describe": "LIGHTLY your coursers travel through the regions when round the sea of air your car is flying.",
    "feecting": "p:LIGHTLY your coursers travel through the regions when round the sea of air your car is flying.\np: Your golden fellies scatter drops of moisture: drinking the sweetness ye attend the Mornings.\r\np:Ye as ye travel overtake the Courser who flies apart, the Friend of man, most holy. May convey you to support and strengthen.\np:Ye have deposited in the raw cow the first milk of the milch-cow. Which the bright offerer presents to you.\np:Ye made the fierce heat to be full of sweetness, like streaming water. Fire-offering thence is yours, O Indra. Heroes: your car-wheels speed to us like springs of honey.\np:May I, ye Mighty, bring you to give your gifts with milk-oblations. Your greatness compasseth Earth. Heaven, and Waters, ye Holy.\np:When, Bounteous Ones, ye drive your yoked team downward, ye send, by your own natures, understanding. Swift as the wind let the prince please and feast you.\np:For verily we truthful singers praise you the niggard trafficker is here excluded. Now, even now do ye O blameless Indra, ye Mighty, guard the man whose Deva is near him.\np:You of a truth day after day, O Indra, that he might win the very plenteous torrent famous among mortal heroes, roused with a thousand lauds like sounds of music.\np:When with the glory of your car ye travel, when we go speeding like the Monk of mortals. May we gain our share of riches.\np:With songs of praise we call to-day, O Indra, that your new chariot, for our own well-being, that circles Heaven with never-injured fellies. May we find strengthening food in full abundance.",
    "meta": {
      "next": "01181",
      "previous": "01179",
      "book": "01",
      "original": "https://sacred-texts.com/hin/rigveda/rv01180.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv01180.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "01180",
            "title": "HYMN CLXXX. Indra."
          },
          {
            "key": "01180",
            "title": "HYMN CLXXX. Indra."
          },
          {
            "key": "01180",
            "title": "HYMN CLXXX. Indra."
          }
        ]
      },
      {
        "name": "O blameless",
        "hymns": [
          {
            "key": "01180",
            "title": "HYMN CLXXX. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638553964362,
  "updated": 1667440426821
}