{
  "key": "01186",
  "title": "RigVeda Hymn 01186",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CLXXXVI. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01186.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01185.htm\">Previous</A>&nbsp;\n<A HREF=\"rv01187.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLXXXVI. Vi&#347;vedevas.</h3>  \n<p>1. LOVED of all men, may Savitar, through praises offered as sacred food, come to our synod,<br> That you too, through-our hymn, ye ever-youthful, may gladden, at your visit, all our people.<br> 2 To us may all the Gods come trooped together, Aryaman, Mitra, Varu&#7751;a concordant,<br> That all may be promoters of our welfare, and with great might preserve our strength from slackness.<br> 3 Agni I sing, the guest you love most dearly: the Conqueror through our lauds is friendly-minded.<br> That he may be our Varu&#7751;a rich in glory and send food like a prince praised by the godly.<br> 4 To you I seek with reverence, Night and Morning, like a cow good to milk, with hope to conquer,<br> Preparing on a common day the praise. song with milk of various hues within this udder.<br> 5 May the great Dragon of the Deep rejoice us: as one who nourishes her young comes Sindhu,<br> With whom we will incite the Child of Waters whom vigorous course swift as thought bring hither.<br> 6 Moreover Tva&#7779;&#7789;ar also shall approach us, one-minded with the princes at his visit.<br> Hither shall come the V&#7771;tra-slayer Indra, Ruler of men, as strongest of the Heroes.<br> 7 Him too our hymns delight, that yoke swift horses, like mother cows who lick their tender youngling.<br> To him our songs shall yield themselves like spouses, to him the most delightful of the Heroes.<br> 8 So may the Maruts, armed with mighty weapons, rest here on heaven and earth with hearts in concord,<br> As Gods whose cars have dappled steeds like torrents, destroyers of the foe allies of Mitra.<br> 9 They hasten on to happy termination their orders when they are made known by<br> glory.<br> As on a fair bright day the arrow flieth o&#146;er all the barren soil their missiles sparkle.<br> 10 Incline the A&#347;vins to show grace, and P&#363;&#7779;an, for power and might have they, their own possession.<br> Friendly are Vi&#7779;&#7751;u, V&#257;ta, and &#7770;bhuk&#7779;an so may I bring the Gods to make us happy.<br> 11 This is my reverent thought of you, ye Holy; may it inspire you, make you dwell among us,&#151;<br> Thought, toiling for the Gods and seeking treasure. May we find strengthening food in full abundance.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv01187.htm\">Next: HYMN CLXXXVII. Praise of Food.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01186.html",
  "api": "hymns/01186json",
  "data": {
    "title": "HYMN CLXXXVI. Devas.",
    "describe": "LOVED of all men.",
    "feecting": "p:LOVED of all men. May Indra, through praises offered as sacred food, come to our synod, that you too, through-our hymn, ye ever-youthful. May gladden, at your visit, all our people.\np:To u. May all the Devas come trooped together, Indra concordant, that al. May be promoters of our welfare, and with great might preserve our strength from slackness.\np:Agni I sing, the guest you love most dearly: the Conqueror through our lauds is friendly-minded.\np: That h. May be our Indra rich in glory and send food like a prince praised by the Deva.\r\np:To you I seek with reverence, Night and Morning, like a cow good to milkpreparing on a common day the praise. song with milk of various hues within this udder.\np:May the great Dragon of the Deep rejoice us: as one who nourishes her young comes Sindhu, with whom we will incite the Child of Waters whom vigorous course swift as thought bring hither.\np:Moreover Indra also shall approach us, one-minded with the princes at his visit. Hither shall come Indra, Ruler of men, as strongest of the Heroes.\np:Him too our hymns delight, that yoke swift horses, like mother cows who lick their tender youngling. To him our songs shall yield themselves like spouses, to him the most delightful of the Heroes.\np:May the Devas rest here on Heaven and Earth with hearts in concord, as Devas whose cars have dappled steeds like torrents.\np:They hasten on to happy termination their orders when they are made known by glory. As on a fair bright day the arrow missiles sparkle.\np:Incline the Aśvins to show grace for power and might have they, their own possession. Friendly are Indra and the Devas to make us happy.\np:This is my reverent thought of you. May it inspire you, make you dwell among us. Thought, toiling for the Devas and seeking treasure. May we find strengthening food in full abundance.",
    "next": "01187",
    "previous": "01185",
    "book": "01"
  },
  "created": 1638553996045
}