{
  "key": "01191",
  "title": "RigVeda Hymn 01191",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda Book 1: HYMN CXCI. Water. Grass. Sun.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv01191.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi01.htm\">Rig-Veda Book 1 Index</A><BR>\n&nbsp;\n<A HREF=\"rv01190.htm\">Previous</A>&nbsp;\n<A HREF=\"rv02001.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXCI. Water. Grass. Sun.</h3>  \n<p>1. VENOMOUS, slightly venomous, or venomous aquatic worm,&#151;<br> Both creatures, stinging, unobserved, with poison have infected me.<br> 2 Coming, it kills the unobserved; it kills them as it goes away,<br> It kills them as it drives them off, and bruising bruises them to death.<br> 3 Sara grass, Darbha, Ku&#347;ara, and Sairya, Mu&ntilde;ja, V&#299;ra&#7751;a,<br> Where all these creatures dwell unseen, with poison have infected me.<br> 4 The cows had settled in their stalls, the beasts of prey had sought their lairs,<br> Extinguished were the lights of men, when things unseen infected me.<br> 5 Or these, these reptiles, are observed, like lurking thieves at evening time.<br> Seers of all, themselves unseen: be therefore very vigilant.<br> 6 Heaven is your Sire, your Mother Earth, Soma your Brother, Aditi<br> Your Sister: seeing all, unseen, keep still and dwell ye happily.<br> 7 Biters of shoulder or of limb, with needle-stings, most venomous,<br> Unseen, whatever ye may be, vanish together and be gone.<br> 8 Slayer of things unseen, the Sun, beheld of all, mounts, eastward, up,<br> Consuming all that are not seen, and evil spirits of the night.<br> 9 There hath the Sun-God mounted up, who scorches much and everything.<br> Even the &#256;ditya from the hills, all-seen, destroying things unseen.<br> 10 I hang the poison in the Sun, a wine-skin in a vintner's house,<br> He will not die, nor shall we die: his path is far: he whom Bay Horses bear hath turned thee to sweet meath.<br> 11 This little bird, so very small, hath swallowed all thy poison up.<br> She will not die, nor shall we die: his path is far: he whom Bay Horses bear hath turned thee to sweet meath.<br> 12 The three-times-seven bright sparks of fire have swallowed up the poison's strength.<br> They will not die, nor shall we die: his path is far: he whom Bay Horses bear hath turned thee to sweet meath.<br> 13 Of ninety rivers and of nine with power to stay the venom's course,&#151;<br> The names of all I have secured: his path is far: he whom Bay Horses bear hath turned thee to sweet meath.<br> 14 So have the peahens three-times-seven, so have the maiden Sisters Seven<br> Carried thy venom far away, as girls bear water in their jars.<br> 15 The poison-insect is so small; I crush the creature with a stone.<br> I turn the poison hence away, departed unto distant lands.<br> 16 Forth issuing from the mountain's side the poison-insect spake and said:<br> Scorpion, they venom is but weak.</p>  \n<p></p>  \n<p></p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv02001.htm\">Next: HYMN I. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/01191.html",
  "api": "json/hymns/01191.json",
  "data": {
    "title": "HYMN CXCI. Water. Grass. Sun.",
    "describe": "VENOMOUS, slightly venomous, or venomous aquatic worm,&#151;",
    "feecting": "p:VENOMOUS, slightly venomous, or venomous aquatic worm,&#151; Both creatures, stinging, unobserved, with poison have infected me.\np:Coming, it kills the unobserved; it kills them as it goes away, It kills them as it drives them off, and bruising bruises them to death.\np:Sara grass, Darbha, Ku&#347;ara, and Sairya, Mu&ntilde;ja, V&#299;ra&#7751;a, Where all these creatures dwell unseen, with poison have infected me.\np:The cows had settled in their stalls, the beasts of prey had sought their lairs, Extinguished were the lights of men, when things unseen infected me.\np:Or these, these reptiles, are observed, like lurking thieves at evening time.\np: Seers of all, themselves unseen: be therefore very vigilant.\r\np:Heaven is your Sire, your Mother Earth, Soma your Brother, Aditi Your Sister: seeing all, unseen, keep still and dwell ye happily.\np:Biters of shoulder or of limb, with needle-stings, most venomous, Unseen, whatever y. May be, vanish together and be gone.\np:Slayer of things unseen, the Sun, beheld of all, mounts, eastward, up, Consuming all that are not seen, and evil spirits of the night.\np:There hath the Sun-God mounted up, who scorches much and everything. Even the &#256;ditya from the hills, all-seen, destroying things unseen.\np:I hang the poison in the Sun, a wine-skin in a vintner's house. He will not die, nor shall we die: his path is far: he whom Bay Horses bear hath turned thee to sweet meath.\np:This little bird, so very small, hath swallowed all thy poison up. She will not die, nor shall we die: his path is far: he whom Bay Horses bear hath turned thee to sweet meath.\np:The three-times-seven bright sparks of fire have swallowed up the poison's strength. They will not die, nor shall we die: his path is far: he whom Bay Horses bear hath turned thee to sweet meath.\np:Of ninety rivers and of nine with power to stay the venom's course,&#151; The names of all I have secured: his path is far: he whom Bay Horses bear hath turned thee to sweet meath.\np:So have the peahens three-times-seven, so have the maiden Sisters Seven Carried thy venom far away, as girls bear water in their jars.\np:The poison-insect is so small; I crush the creature with a stone. I turn the poison hence away, departed unto distant lands.\np:Forth issuing from the mountain's side the poison-insect spake and said: Scorpion, they venom is but weak.",
    "next": "02001",
    "previous": "01190",
    "book": "01"
  },
  "created": 1638554022810,
  "updated": 1638791780420
}