{
  "key": "02004",
  "title": "RigVeda Hymn 02004",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 2: HYMN IV Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv02004.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi02.htm\">Rig-Veda, Book 2 Index</A><BR>\n&nbsp;\n<A HREF=\"rv02003.htm\">Previous</A>&nbsp;\n<A HREF=\"rv02005.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN IV Agni.</h3>  \n<p>1. FOR you I call the glorious refulgent Agni, the guest of men, rich in oblations<br> Whom all must strive to win even as a lover, God among godly people, J&#257;tavedas.<br> 2 Bh&#7771;gus who served him in the home of waters set him of old in houses of the living.<br> Over all worlds let Agni be the Sovran, the messenger of Gods with rapid coursers.<br> 3 Among the tribes of men the Gods placed Agni as a dear Friend when they would dwell among them.<br> Against the longing nights may he shine brightly, and show the offerer in the house his vigour.<br> 4 Sweet is his growth as of one's own possessions; his look when rushing fain to burn is lovely.<br> He darts his tongue forth, like a harnessed courser who shakes his flowing tail, among the bushes.<br> 5 Since they who honour me have praised my greatness,&#151;he gave, as &#146;twere, his hue to those who love him.<br> Known is he by his bright delightful splendour, and waxing old renews his youth for ever.<br> 6 Like one athirst, he lighteth up the forests; like water down the chariot ways he roareth.<br> On his black path he shines in burning beauty, marked as it were the heaven that smiles through vapour.<br> 7 Around, consuming the broad earth, he wanders, free roaming like an ox without a herdsman,&#151;<br> Agni refulgent, burning up the bushes, with blackened lines, as though the earth he seasoned.<br> 8 I, in remembrance of thine ancient favour have sung my hymn in this our third assembly.<br> O Agni, give us wealth with store of heroes and mighty strength in food and noble offspring.<br> 9 May the G&#7771;tsamadas, serving in secret, through thee, O Agni, overcome their neighbours,<br> Rich in good heroes and subduing foemen. That vital power give thou to chiefs and singers.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv02005.htm\">Next: HYMN V. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/02004.html",
  "api": "json/hymns/02004.json",
  "data": {
    "key": "02004",
    "title": "HYMN IV Agni.",
    "describe": "FOR you I call the glorious refulgent Agni, the guest of men, rich in oblations Whom all must strive to win even as a lover, Deva among godly people, Jātavedas.",
    "feecting": "p:FOR you I call the glorious refulgent Agni, the guest of men, rich in oblations Whom all must strive to win even as a lover, Deva among godly people, Jātavedas.\np:Bhṛgus who served him in the home of waters set him of old in houses of the living.\np: Over all worlds let Agni be the Sovran, the messenger of Devas with rapid coursers.\r\np:Among the tribes of men the Devas placed Agni as a dear Friend when they would dwell among them. Against the longing night. May he shine brightly, and show the offerer in the house his vigour.\np:Sweet is his growth as of one's own possessions; his look when rushing fain to burn is lovely. He darts his tongue forth, like a harnessed courser who shakes his flowing tail, among the bushes.\np:Since they who honour me have praised my greatness.he gave, as ’twere, his hue to those who love him. Known is he by his bright delightful splendour, and waxing old renews his youth forever.\np:Like one athirst, he lighteth up the forests; like water down the chariot ways he roareth. On his black path he shines in burning beauty, marked as it were the Heaven that smiles through vapour.\np:Around, consuming the broad Earth, he wanders, free roaming like an ox without a herdsman. Agni refulgent, burning up the bushes, with blackened lines, as though the Earth he seasoned.\np:I, in remembrance of thine ancient favour have sung my hymn in this our third assembly. O Agni, give us wealth with store of heroes and mighty strength in food and noble offspring.\np:May the Gṛtsamadas, serving in secret, through thee, O Agni, overcome their neighbours, Rich in good heroes and subduing foemen. That vital power give thou to chiefs and singers.",
    "meta": {
      "next": "02005",
      "previous": "02003",
      "book": "02",
      "original": "https://sacred-texts.com/hin/rigveda/rv02004.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv02004.htm"
    },
    "deities": [
      {
        "name": "O Agni",
        "hymns": [
          {
            "key": "02004",
            "title": "HYMN IV Agni."
          },
          {
            "key": "02004",
            "title": "HYMN IV Agni."
          }
        ]
      }
    ]
  },
  "created": 1638554044032,
  "updated": 1639023783975
}