{
  "key": "02012",
  "title": "RigVeda Hymn 02012",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 2: HYMN XII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv02012.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi02.htm\">Rig-Veda, Book 2 Index</A><BR>\n&nbsp;\n<A HREF=\"rv02011.htm\">Previous</A>&nbsp;\n<A HREF=\"rv02013.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XII. Indra.</h3>  \n<p>1. HE who, just born, chief God of lofty spirit by power and might became the Gods&#146; protector,<br> Before whose breath through greatness of his valour the two worlds trembled, He, O men, is Indra.<br> 2 He who fixed fast and firm the earth that staggered, and set at rest the agitated mountains,<br> Who measured out the air's wide middle region and gave the heaven support, He, men, is Indra.<br> 3 Who slew the Dragon, freed the Seven Rivers, and drove the kine forth from the cave of Vala,<br> Begat the fire between two stones, the spoiler in warriors&#146; battle, He, O men, is Indra.<br> 4 By whom this universe was made to tremble, who chased away the humbled brood of demons,<br> Who, like a gambler gathering his winnings seized the foe's riches, He, O men, is Indra.<br> 5 Of whom, the Terrible, they ask, Where is He? or verily they say of him, He is not.<br> He sweeps away, like birds, the foe's possessions. Have faith in him, for He, O men, is Indra.<br> 6 Stirrer to action of the poor and lowly, of priest, of suppliant who sings his praises;<br> Who, fair-faced, favours him who presses Soma with stones made ready, He, O men, is Indra.<br> 7 He under whose supreme control are horses, all chariots, and the villages, and cattle;<br> He who gave being to the Sun and Morning, who leads the waters, He, O men, is Indra.<br> 8 To whom two armies cry in close encounter, both enemies, the stronger and the weaker;<br> Whom two invoke upon one chariot mounted, each for himself, He, O ye men, is Indra.<br> 9 Without whose help our people never conquer; whom, battling, they invoke to give them succour;<br> He of whom all this world is but the copy, who shakes things moveless, He, O men, is Indra.<br> 10 He who hath smitten, ere they knew their danger, with his hurled weapon many grievous sinners;<br> Who pardons not his boldness who provokes him, who slays the Dasyu, He, O men, is Indra.<br> 11 He who discovered in the fortieth autumn &#346;ambara as he dwelt among the mountains;<br> Who slew the Dragon putting forth his vigour, the demon lying there, He, men, is Indra.<br> 12 Who with seven guiding reins, the Bull, the Mighty, set free the Seven great Floods to flow at pleasure;<br> Who, thunder-armed, rent Rauhi&#7751;a in pieces when scaling heaven, He, O ye men, is Indra.<br> 13 Even the Heaven and Earth bow down before him, before his very breath the mountains tremble.<br> Known as the Soma-drinker, armed with thunder, who wields the bolt, He, O ye men, is Indra.<br> 14 Who aids with favour him who pours the Soma and him who brews it, sacrificer, singer.<br> Whom prayer exalts, and pouring forth of Soma, and this our gift, He, O ye men, Is Indra.<br> 15 Thou verily art fierce and true who sendest strength to the man who brews and pours libation.<br> So may we evermore, thy friends, O Indra, speak loudly to the synod with our heroes.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv02013.htm\">Next: HYMN XIII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/02012.html",
  "api": "json/hymns/02012.json",
  "data": {
    "title": "HYMN XII. Indra.",
    "describe": "HE who, just born, chief God of lofty spirit by power and might became the Devas&#146;",
    "feecting": "p:HE who, just born, chief God of lofty spirit by power and might became the Devas&#146; protector, before whose breath through greatness of his valour the two worlds trembled. He, O men, is Indra.\np:He who fixed fast and firm the Earth that staggered, and set at rest the agitated mountains, who measured out the air's wide middle region and gave the Heaven support. He, men, is Indra.\np:Who slew the Dragon, freed the Seven Rivers, and drove the kine forth from the cave of Vala, begat the fire between two stones, the spoiler in warriors&#146; battle. He, O men, is Indra.\np:By whom this universe was made to tremble, who chased away the humbled brood of demons, who, like a gambler gathering his winnings seized the foe's riches. He, O men, is Indra.\np:Of whom, the Terrible, they ask, Where is He? or verily they say of him. He is not.\np: He sweeps away, like birds, the foe's possessions. Have faith in him, for He, O men, is Indra.\r\np:Stirrer to action of the poor and lowly, of priest, of suppliant who sings his praises. Who, fair-faced, favours him who presses Soma with stones made ready. He, O men, is Indra.\np:He under whose supreme control are horses, all chariots, and the villages, and cattle; He who gave being to the Sun and Morning, who leads the waters. He, O men, is Indra.\np:To whom two armies cry in close encounter, both enemies, the stronger and the weaker. Whom two invoke upon one chariot mounted, each for himself. He, O ye men, is Indra.\np:Without whose help our people never conquer; whom, battling, they invoke to give them succour; He of whom all this world is but the copy, who shakes things moveless. He, O men, is Indra.\np:He who hath smitten, ere they knew their danger, with his hurled weapon many grievous sinners. Who pardons not his boldness who provokes him, who subdues the Dasyu. He, O men, is Indra.\np:He who discovered in the fortieth autumn &#346;ambara as he dwelt among the mountains. Who slew the Dragon putting forth his vigour, the demon lying there. He, men, is Indra.\np:Who with seven guiding reins, the Bull, the Mighty, set free the Seven great Floods to flow at pleasure. Who, thunder-armed, rent Rauhi&#7751;a in pieces when scaling Heaven. He, O ye men, is Indra.\np:Even the Heaven and Earth bow down before him, before his very breath the mountains tremble. Known as Soma, armed with thunder, who wields the bolt. He, O ye men, is Indra.\np:Who aids with favour him who pours the Soma and him who brews it, offerer, singer. Whom prayer exalts, and pouring forth of Soma, and this our gift. He, O ye men, is Indra.\np:Thou verily art fierce and true who sendest strength to the man who brews and pours libation. May we evermore, thy friends, O Indra, speak loudly to the synod with our heroes.",
    "next": "02013",
    "previous": "02011",
    "book": "02"
  },
  "created": 1638554086128,
  "updated": 1638647017816
}