{
  "key": "02010",
  "title": "RigVeda Hymn 02010",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 2: HYMN X. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv02010.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi02.htm\">Rig-Veda, Book 2 Index</A><BR>\n&nbsp;\n<A HREF=\"rv02009.htm\">Previous</A>&nbsp;\n<A HREF=\"rv02011.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN X. Agni.</h3>  \n<p>1. AGNI, first, loudly calling, like a Father, kindled by man upon the seat of worship.<br> Clothed in his glory, deathless, keen of insight, must be adorned by all, the Strong, the Famous.<br> 2 May Agni the resplendent hear my calling through all my songs, Immortal, keen of insight.<br> Dark steeds or ruddy draw his car, or carried in sundry ways he makes them red of colour.<br> 3 On wood supine they got the well-formed Infant: a germ in various-fashioned plants was Agni;<br> And in the night, not compassed round by darkness, he dwells exceeding wise, with rays of splendour.<br> 4 With oil and sacred gifts I sprinkle Agni who makes his home in front of all things living,<br> Broad, vast, through vital power o&#146;er all expanded, conspicuous, strong with all the food that feeds him.<br> 5 I pour to him who looks in all directions: may he accept it with a friendly spirit.<br> Agni with bridegroom's grace and lovely colour may not be touched when all his form is fury.<br> 6 By choice victorious, recognize thy portion: with thee for envoy may we speak like Manu.<br> Obtaining wealth, I call on perfect Agni who with an eloquent tongue dispenses sweetness.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv02011.htm\">Next: HYMN XI. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/02010.html",
  "api": "json/hymns/02010.json",
  "data": {
    "title": "HYMN X. Agni.",
    "describe": "AGNI, first, loudly calling, like a Father, kindled by man upon the seat of worship.",
    "feecting": "p:AGNI, first, loudly calling, like a Father, kindled by man upon the seat of worship.\np: Clothed in his glory, deathless, keen of insight, must be adorned by all, the Strong, the Famous.\r\np:May Agni the resplendent hear my calling through all my songs, Immortal, keen of insight. Dark steeds or ruddy draw his car, or carried in sundry ways he makes them red of colour.\np:On wood supine they got the well-formed Infant: a germ in various-fashioned plants was Agni; And in the night, not compassed round by darkness, he dwells exceeding wise, with rays of splendour.\np:With oil and sacred gifts I sprinkle Agni who makes his home in front of all things living, Broad, vast, through vital power o&#146;er all expanded, conspicuous, strong with all the food that feeds him.\np:I pour to him who looks in all directions. May he accept it with a friendly spirit. Agni with bridegroom's grace and lovely colou. May not be touched when all his form is fury.\np:By choice victorious, recognize thy portion: with thee for envo. May we speak like Manu. Obtaining wealth, I call on perfect Agni who with an eloquent tongue dispenses sweetness.",
    "next": "02011",
    "previous": "02009",
    "book": "02"
  },
  "created": 1638554075608,
  "updated": 1638791780430
}