{
  "key": "02022",
  "title": "RigVeda Hymn 02022",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 2: HYMN XXII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv02022.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi02.htm\">Rig-Veda, Book 2 Index</A><BR>\n&nbsp;\n<A HREF=\"rv02021.htm\">Previous</A>&nbsp;\n<A HREF=\"rv02023.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXII. Indra.</h3>  \n<p>1. At the Trikadrukas the Great and Strong hath drunk drink blent with meal. With Vi&#7779;&#7751;u hath he quaffed the poured out Soma juice, all that he would.<br> That hath so heightened him the Great, the Wide, to do his mighty work.<br> So may the God attain the God, true Indu Indra who is true.<br> 2 So he resplendent in the battle overcame Krivi by might. He with his majesty hath filled the earth and heaven, and waxen strong.<br> One share of the libation hath he swallowed down: one share he left.<br> So may the God attend the God, true Indu Indra who is true.<br> 3 Brought forth together with wisdom and mighty power thou grewest great; with hero deeds subduing the malevolent, most swift in act;<br> Giving prosperity, and lovely wealth to him who praiseth thee. So may the God attend the God, true Indu Indra who is true.<br> 4 This, Indra, was thy hero deed, Dancer, thy first and ancient work, worthy to be told forth in heaven,<br> What time thou sentest down life with a God's own power, freeing the floods.<br> All that is godless may he conquer with his might, and, Lord of Hundred Powers, find for us strength and food.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv02023.htm\">Next: HYMN XXIII. Brahma&#7751;aspati.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/02022.html",
  "api": "json/hymns/02022.json",
  "data": {
    "title": "HYMN XXII. Indra.",
    "describe": "At the Trikadrukas the Great and Strong hath drunk drink blent with meal.",
    "feecting": "p:At the Trikadrukas the Great and Strong hath drunk drink blent with meal. With Vi&#7779;&#7751;u hath he quaffed the poured out Soma juice, all that he would.\np: That hath so heightened him the Great, the Wide, to do his mighty work. May the Deva attain the Deva, true Indu Indra who is true.\r\np:So he resplendent in the battle overcame Krivi by might. He with his majesty hath filled the Earth and Heaven, and waxen strong. One share of the libation hath he swallowed down: one share he left. May the Deva attend the Deva, true Indu Indra who is true.\np:Brought forth together with wisdom and mighty power thou grewest great; with hero deeds subduing the malevolent, most swift in act; Giving prosperity, and lovely wealth to him who praiseth thee. May the Deva attend the Deva, true Indu Indra who is true.\np:This, Indra, was thy hero deed, Dancer, thy first and ancient work, worthy to be told forth in Heaven, what time thou sentest down life with a Deva's own power, freeing the floods. All that is godles. May he conquer with his might, and, Lord of Hundred Powers, find for us strength and food.",
    "next": "02023",
    "previous": "02021",
    "book": "02"
  },
  "created": 1638554138739,
  "updated": 1638792007546
}