{
  "key": "02030",
  "title": "RigVeda Hymn 02030",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 2: HYMN XXX. Indra and Others.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv02030.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi02.htm\">Rig-Veda, Book 2 Index</A><BR>\n&nbsp;\n<A HREF=\"rv02029.htm\">Previous</A>&nbsp;\n<A HREF=\"rv02031.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXX. Indra and Others.</h3>  \n<p>1. THE streams unceasing flow to Indra, slayer of Ahi, Savitar, God, Law's fulfiller,<br> Day after day goes on the sheen of waters. What time hath past since they were first set flowing?<br> 2 His Mother&#151;for she knew&#151;spake and proclaimed him who was about to cast his bolt at V&#7771;tra.<br> Cutting their paths according to his pleasure day after day flow to their goal the rivers.<br> 3 Aloft he stood above the airy region, and against V&#7771;tra shot his deadly missile.<br> Enveloped in a cloud he rushed upon him. Indra subdued the foe with sharpened weapons.<br> 4 As with a bolt, B&#7771;haspati, fiercely flaming, pierce thou V&#7771;kadvaras&#146;, the Asura's, heroes.<br> Even as in time of old with might thou slewest, so slay even now our enemy, O Indra.<br> 5 Cast down from heaven on high thy bolt of thunder wherewith in joy thou smitest dead the foeman.<br> For gain of children make us thine, O Indra, of many children's children and of cattle.<br> 6 Whomso ye love, his power ye aid and strengthen; ye Twain are the rich worshipper's advancers.<br> Graciously favour us, Indra and Soma; give us firm standing in this time of danger.<br> 7 Let it not vex me, tire me, make me slothful, and never let us say, Press not the Soma;<br> For him who cares for me, gives gifts, supports me, who comes with kine to me who pour libations.<br> 8 Sarasvat&#299;, protect us: with the Maruts allied thou boldly conquerest our foemen,<br> While Indra does to death the daring chieftain of &#346;a&#7751;&#7693;ikas exulting in his prowess.<br> 9 Him who waylays, yea, him who would destroy us,&#151;aim at him, pierce him with thy sharpened weapon.<br> B&#7771;haspati, with arms thou slayest foemen O King, give up the spoiler to destruction.<br> 10 Perform, O Hero, with our valiant heroes the deeds heroic which thou hast to finish.<br> Long have they been inflated with presumption: slay them, and bring us hither their possessions.<br> 11 I craving joy address with hymn and homage your heavenly host, the company of Maruts,<br> That we may gain wealth with full store of heroes, each day more famous, and with troops of children.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv02031.htm\">Next: HYMN XXXI. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/02030.html",
  "api": "json/hymns/02030.json",
  "data": {
    "title": "HYMN XXX. Indra.",
    "describe": "THE streams unceasing flow to Indra, slayer of Ahi, Indra, Deva, Law's fulfiller, Day after day goes on the sheen of waters.",
    "feecting": "p:THE streams unceasing flow to Indra, slayer of Ahi, Indra, Deva, Law's fulfiller, Day after day goes on the sheen of waters. What time hath past since they were first set flowing?\np:His Mother&#151;for she knew&#151;spake and proclaimed him who was about to cast his bolt at V&#7771;tra.\np: Cutting their paths according to his pleasure day after day flow to their goal the rivers.\r\np:Aloft he stood above the airy region, and against V&#7771;tra shot his deadly missile. Enveloped in a cloud he rushed upon him. Indra subdued the foe with sharpened weapons.\np:As with a bolt, fiercely flaming, pierce thou V&#7771;kadvaras&#146;, the Devas's, heroes. Even as in time of old with might thou slewest, so subdue even now our enemy, O Indra.\np:Cast down from Heaven on high thy bolt of thunder wherewith in joy thou smitest dead the foeman. For gain of children make us thine, O Indra, of many children's children and of cattle.\np:Whomso ye love, his power ye aid and strengthen; ye Twain are the rich worshipper's advancers. Graciously favour us, Indra and Soma; give us firm standing in this time of danger.\np:Let it not vex me, tire me, make me slothful, and never let us say, Press not the Soma; For him who cares for me, gives gifts, supports me, who comes with kine to me who pour libations.\np:Sarasvat&#299;, protect us: with the Devas allied thou boldly conquerest our foemen, While Indra does to death the daring chieftain of &#346;a&#7751;&#7693;ikas exulting in his prowess.\np:Him who waylays, yea, him who would destroy us,&#151;aim at him, pierce him with thy sharpened weapon. B&#7771;haspati, with arms thou slayest foemen O King, give up the spoiler to destruction.\np:Perform, O Hero, with our valiant heroes the deeds heroic which thou hast to finish. Long have they been inflated with presumption: subdue them, and bring us hither their possessions.\np:I craving joy address with hymn and homage your heavenly host, the company of Devas, that we may gain wealth with full store of heroes, each day more famous, and with troops of children.",
    "next": "02031",
    "previous": "02029",
    "book": "02"
  },
  "created": 1638554181089,
  "updated": 1638646519029
}