{
  "key": "02037",
  "title": "RigVeda Hymn 02037",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 2: HYMN XXXVII. Various Gods.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv02037.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi02.htm\">Rig-Veda, Book 2 Index</A><BR>\n&nbsp;\n<A HREF=\"rv02036.htm\">Previous</A>&nbsp;\n<A HREF=\"rv02038.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXVII. Various Gods.</h3>  \n<p>1. Enjoy thy fill of meath out of the Hotar's cup: Adhvaryus he desires a full draught poured for him.<br> Bring it him: seeking this he gives. Granter of Wealth, drink Soma with the &#7770;tus from the Hotar's cup.<br> 2 He whom of old I called on, him I call on now. He is to be invoked; his name is He who Gives,<br> Here brought by priests is Soma meath. Granter of Wealth, drink Soma with the &#7770;tus from the Potar's cup.<br> 3 Fat may the horses be wherewith thou speedest on: Lord of the Wood, unharming, strengthen thou thyself.<br> Drawing and seizing, Bold One, thou who grantest wealth, drink Soma with the &#7770;tus from the Ne&#7779;&#7789;ar's cup.<br> 4 From Hotar's cup and Potar's he hath drunk and joyed: the proffered food hath pleased him from the Ne&#7779;&#7789;ar's bowl.<br> The fourth cup undisturbed, immortal, let him drink who giveth wealth, the cup of the wealth-giving God.<br> 5 Yoke, O ye Twain, to-day your hero-bearing car, swift-moving hitherward: your loosing-place is here.<br> Mix the oblations, then come hither with the meath, and drink the Soma, ye rich in abundant strength.<br> 6 Agni, accept the fuel and our offered gift: accept the prayer of man, accept our eulogy,<br> Do thou with all, with &#7770;tu, O thou Excellent, fain, make the great Gods all fain taste the gift we bring.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv02038.htm\">Next: HYMN XXXVIII. Savitar.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/02037.html",
  "api": "json/hymns/02037.json",
  "data": {
    "key": "02037",
    "title": "HYMN XXXVII. Various Gods.",
    "describe": "Enjoy thy fill of meath out of the Hotar's cup: Adhvaryus he desires a full draught poured for him.",
    "feecting": "p:Enjoy thy fill of meath out of the Hotar's cup: Adhvaryus he desires a full draught poured for him.\np: Bring it him: seeking this he gives. Granter of Wealth, drink Soma with the Ṛtus from the Hotar's cup.\r\np:He whom of old I called on, him I call on now. He is to be invoked; his name is He who Gives. Here brought by monks is Soma meath. Granter of Wealth, drink Soma with the Ṛtus from the Potar's cup.\np:Fa. May the horses be wherewith thou speedest on: Lord of the Wood, unharming, strengthen thou thyself. Drawing and seizing, Bold One, thou who grantest wealth, drink Soma with the Ṛtus from the Neṣṭar's cup.\np:From Hotar's cup and Potar's he hath drunk and joyed: the proffered food hath pleased him from the Neṣṭar's bowl. The fourth cup undisturbed, immortal, let him drink who giveth wealth, the cup of the wealth-giving God.\np:Yoke, O ye Twain, to-day your hero-bearing car, swift-moving hitherward: your loosing-place is here. Mix the oblations, then come hither with the meath, and drink the Soma, ye rich in abundant strength.\np:Agni, accept the fuel and our offered gift: accept the prayer of man, accept our eulogy, Do thou with all, with Ṛtu, O thou Excellent, fain, make the great Devas all fain taste the gift we bring.",
    "meta": {
      "next": "02038",
      "previous": "02036",
      "book": "02",
      "source": "https://sacred-texts.com/hin/rigveda/rv02037.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv02037.htm"
    },
    "deities": [
      {
        "name": "O ye ",
        "hymns": [
          {
            "key": "02037",
            "title": "HYMN XXXVII. Various Gods."
          }
        ]
      },
      {
        "name": "O thou",
        "hymns": [
          {
            "key": "02037",
            "title": "HYMN XXXVII. Various Gods."
          }
        ]
      }
    ]
  },
  "created": 1638554218796,
  "updated": 1638830291989
}