{
  "key": "02039",
  "title": "RigVeda Hymn 02039",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 2: HYMN XXXIX A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<div class=\"filenav\">\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv02039.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi02.htm\">Rig-Veda, Book 2 Index</A><BR>\n&nbsp;\n<A HREF=\"rv02038.htm\">Previous</A>&nbsp;\n<A HREF=\"rv02040.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n</div>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXIX. A&#347;vins.</h3>  \n<p>1. SING like the two press-stones for this same purpose; come like two misers to the tree of treasure;<br> Like two laud-singing Brahmans in the assembly, like the folk's envoys called in many places.<br> 2 Moving at morning like two car-borne heroes, like to a pair of goats ye come electing;<br> Like two fair dames embellishing their bodies, like a wise married pair among the people.<br> 3 Like to a pair of horns come first to us-ward, like to a pair of hoofs with rapid motion;<br> Come like two Cakav&#257;s in the grey of morning, come like two chariot wheels at dawn, ye Mighty.<br> 4 Bear us across the rivers like two vessels, save us as ye were yokes, naves, spokes and fellies.<br> Be like two dogs that injure not our bodies; preserve us, like two crutches, that we fall not.<br> 5 Like two winds ageing not, two confluent rivers, come with quick vision like two eyes before us.<br> Come like two hands most helpful to the body, and guide us like two feet to what is precious.<br> 6 Even as two lips that with the mouth speak honey, even as two breasts that nourish our existence,<br> Like the two nostrils that protect our being, be to us as our ears that hear distinctly.<br> 7 Like two hands give ye us increasing vigour; like heaven and earth constrain the airy regions.<br> A&#347;vins, these hymns that struggle to approach you, sharpen ye like an axe upon a whetstone.<br> 8 These prayers of ours exalting you, O A&#347;vins, have the G&#7771;tsamadas, for a laud, made ready.<br> Welcome them, O ye Heroes, and come hither. Loud may we speak. with brave men, in assembly.</p>  \n<p><div class=\"filenav\">\n<HR>\n<CENTER>\n<A HREF=\"rv02040.htm\">Next: HYMN XL. Soma and P&#363;&#7779;an.</A></CENTER>\n</div>\n</BODY>\n</HTML>\n",
  "link": "hymns/02039.html",
  "api": "json/hymns/02039.json",
  "data": {
    "title": "HYMN XXXIX. A&#347;vins.",
    "describe": "SING like the two press-stones for this same purpose;",
    "feecting": "p:SING like the two press-stones for this same purpose; come like two misers to the tree of treasure; Like two laud-singing Brahmans in the assembly, like the folk's envoys called in many places.\np:Moving at morning like two car-borne heroes, like to a pair of goats ye come electing; Like two fair dames embellishing their bodies, like a wise married pair among the people.\np:Like to a pair of horns come first to us-ward, like to a pair of hoofs with rapid motion; Come like two Cakav&#257;s in the grey of morning, come like two chariot wheels at dawn, ye Mighty.\np:Bear us across the rivers like two vessels, save us as ye were yokes, naves, spokes and fellies.\np: Be like two dogs that injure not our bodies; preserve us, like two crutches, that we fall not.\r\np:Like two winds ageing not, two confluent rivers, come with quick vision like two eyes before us. Come like two hands most helpful to the body, and guide us like two feet to what is precious.\np:Even as two lips that with the mouth speak honey, even as two breasts that nourish our existence, like the two nostrils that protect our being, be to us as our ears that hear distinctly.\np:Like two hands give ye us increasing vigour; like Heaven and Earth constrain the airy regions. A&#347;vins, these hymns that struggle to approach you, sharpen ye like an axe upon a whetstone.\np:These prayers of ours exalting you, O A&#347;vins, have the G&#7771;tsamadas, for a laud, made ready. Welcome them, O ye Heroes, and come hither. Lou. May we speak. with brave men, in assembly.  \n<div class=\"filenav\">",
    "next": "02040",
    "previous": "02038",
    "book": "02"
  },
  "created": 1638554229345,
  "updated": 1638642698253
}