{
  "key": "03008",
  "title": "RigVeda Hymn 03008",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN VIII Sacrificial Post.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03008.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03007.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03009.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN VIII Sacrificial Post.</h3>  \n<p>1. GOD-SERVING men, O Sovran of the Forest, with heavenly meath at sacrifice anoint thee.<br> Grant wealth to us when thou art standing upright as when reposing on this Mother's bosom.<br> 2 Set up to eastward of the fire enkindled, accepting prayer that wastes not, rich in hero.<br> Driving far from us poverty and famine, lift thyself up to bring us great good fortune.<br> 3 Lord of the Forest, raise. thyself up on the loftiest spot of earth.<br> Give splendour, fixt and measured well, to him who brings the sacrifice.<br> 4 Well-robed, enveloped he is come, the youthful: springing to life his glory waxeth greater.<br> Contemplative in mind and God-adoring, sages of high intelligence upraise him.<br> 5 Sprung up he rises in the days' fair weather, increasing in the men-frequented synod.<br> With song the wise and skilful consecrate him: his voice the God-adoring singer utters.<br> 6, Ye whom religious men have firmly planted; thou Forest Sovran whom the axe hath fashioned,&#151;<br> Let those the Stakes divine which here are standing be fain to grant us wealth with store of children.<br> 7 O men who lift the ladles up, these hewn and planted in the ground,<br> Bringing a blessing to the field, shall bear our precious gift to Gods.<br> 8 &#256;dityas, Rudras, Vasus, careful leaders, Earth, Heaven, and Prthivi and Air's mid-region,<br> Accordant Deities shall bless our worship and make our sacrifice's ensign lofty.<br> 9 Like swan's that flee in lengthened line, the Pillars have come to us arrayed in brilliant coIour.<br> They, lifted up on high, by sages, eastward, go forth as Gods to the God's dwelling-places.<br> 10 Those Stakes upon the earth with rings that deck them seem to the eye like horns of horned creatures;<br> Or, as upraised by priests in invocation, let them assist us in the rush to battle.<br> 11 Lord of the Wood, rise with a hundred branches. with thousand branches may we rise to greatness,<br> Tlou whom this hatchct, with an edge well whetted for great felicity, hath brought before us.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03009.htm\">Next: HYMN IX.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03008.html",
  "api": "json/hymns/03008.json",
  "data": {
    "key": "03008",
    "title": "HYMN VIII Sacrificial Post.",
    "describe": "GOD-SERVING men, O Sovran of the Forest, with heavenly meath at offering anoint thee.",
    "feecting": "p:GOD-SERVING men, O Sovran of the Forest, with heavenly meath at offering anoint thee.\np: Grant wealth to us when thou art standing upright as when reposing on this Mother's bosom.\r\np:Set up to eastward of the fire enkindled, accepting prayer that wastes not, rich in hero. Driving far from us poverty and famine, lift thyself up to bring us great good fortune.\np:Lord of the Forest, raise. thyself up on the loftiest spot of Earth. Give splendour, fixt and measured well, to him who brings the offering.\np:Well-robed, enveloped he is come, the youthful: springing to life his glory waxeth greater. Contemplative in mind and God-adoring, sages of high intelligence upraise him.\np:Sprung up he rises in the days' fair weather, increasing in the men-frequented synod. With song the wise and skilful consecrate him: his voice the Deva-adoring singer utters.\np:, Ye whom religious men have firmly planted; thou Forest Sovran whom the axe hath fashioned. Let those the Stakes divine which here are standing be fain to grant us wealth with store of children.\np:O men who lift the ladles up, these hewn and planted in the ground, Bringing a blessing to the field, shall bear our precious gift to Devas.\np:Ādityas, Somas, Devas, careful leaders, Earth. Heaven, and Prthivi and Air's mid-region, Accordant Deities shall bless our worship and make our offering's ensign lofty.\np:Like swan's that flee in lengthened line, the Pillars have come to us arrayed in brilliant coIour. They, lifted up on high, by sages, eastward, go forth as Devas to the Deva's dwelling-places.\np:Those Stakes upon the Earth with rings that deck them seem to the eye like horns of horned creatures; Or, as upraised by monks in invocation, let them assist us in the rush to battle.\np:Lord of the Wood, rise with a hundred branches. with thousand branche. May we rise to greatness, Tlou whom this hatchct, with an edge well whetted for great felicity, hath brought before us.",
    "meta": {
      "next": "03009",
      "previous": "03007",
      "book": "03",
      "source": "https://sacred-texts.com/hin/rigveda/rv03008.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv03008.htm"
    },
    "deities": [
      {
        "name": "O Sovran",
        "hymns": [
          {
            "key": "03008",
            "title": "HYMN VIII Sacrificial Post."
          }
        ]
      },
      {
        "name": "O men",
        "hymns": [
          {
            "key": "03008",
            "title": "HYMN VIII Sacrificial Post."
          }
        ]
      }
    ]
  },
  "created": 1638554292783,
  "updated": 1638830292017
}