{
  "key": "03006",
  "title": "RigVeda Hymn 03006",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN VI. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03006.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03005.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03007.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN VI. Agni.</h3>  \n<p>1. URGED on by deep devotion, O ye singers, bring, pious ones, the God-approaching ladle.<br> Borne onward to the right it travels eastward, and, filled with oil, to Agni bears oblation.<br> 2 Thou at thy birth didst fill both earth and heaven, yea, Most Adorable, thou didst exceed them.<br> Even through the heaven's and through the earth's expanses let thy swift seventongued flames roll on, O Agni.<br> 3 Both Heaven and Earth and Gods who should be worshipped establish thee as Priest for every dwelling,<br> Whenever human families, God-devoted, bringing oblations; laud thy splendid lustre.<br> 4 Firm in the Gods&#146; home is the Mighty seated, between vast Heaven and Earth the well-beloved-<br> Those Cows who yield, unharmed, their nectar, Spouses of the Far-Strider, everyoung, united.<br> 5 Great are the deeds of thee, the Great, O Agni: thou by thy power hast spread out earth and heaven.<br> As soon as thou wast born thou wast an envoy, thou, Mighty One, was Leader of the people.<br> 6 Bind to the pole with cords of holy Order the long-maned ruddy steeds who sprinkle fatness.<br> Bring hithier, O thou God, all Gods together: provide them noble worship, J&#257;tavedas.<br> 7 Even from the sky thy brilliant lights shone hither: still hast thou beamed through many a radiant morning,<br> That the Gods praised their joyous Herald's labour eagerly burning, Agni, in the forests.<br> 8 The Gods who take delight in air's wide region, or those the dwellers in heaven's realm of brightness,<br> Or those, the Holy, prompt to hear, our helpers, who, carborne, turn their horses hither, Agni&#151;-<br> 9 With these, borne on one ear, Agni, approach us, or borne on many, for thy steeds are able.<br> Bring, witb their Dames, the Gods, the Three and-Thirty, after thy Godlike nature, and be joyful.<br> 10 He is the Priest at whose repeated worship even wide Heaven and Earth sing out for increase.<br> They fair and true and holy coming forward stand at his sacrifice who springs from Order.<br> 11 As holy food, Agni, to thine invoker give wealth in cattle, lasting, rich in marvels.<br> To us be born a son and spreading offspring. Agni, be this thy gracious will to usward.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03007.htm\">Next: HYMN VII.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03006.html",
  "api": "json/hymns/03006.json",
  "data": {
    "title": "HYMN VI. Agni.",
    "describe": "URGED on by deep devotion, O ye singers, bring, pious ones-approaching ladle.",
    "feecting": "p:URGED on by deep devotion, O ye singers, bring, pious ones-approaching ladle.\np: Borne onward to the right it travels eastward, and, filled with oil, to Agni bears oblation.\r\np:Thou at thy birth didst fill both Earth and Heaven, yea, most Adorable, thou didst exceed them. Even through the Heaven's and through the Earth's expanses let thy swift seventongued flames roll on, O Agni.\np:Both Heaven and Earth and Devas who should be worshipped establish thee as Monk forevery dwelling, whenever human families, Deva-devoted, bringing oblations; laud thy splendid lustre.\np:Firm in the Devas&#146; home is the Mighty seated, between vast Heaven and Earth the well-beloved- Those Cows who yield, unharmed, their nectar, Spouses of the Far-Strider, everyoung, united.\np:Great are the deeds of thee, the Great, O Agni: thou by thy power hast spread out Earth and Heaven. As soon as thou wast born thou wast an envoy Mighty One, was Leader of the people.\np:Bind to the pole with cords of holy Order the long-maned ruddy steeds who sprinkle fatness. Bring hithier, O thou Deva, all Devas together: provide them noble worship, J&#257;tavedas.\np:Even from the sky thy brilliant lights shone hither: still hast thou beamed through many a radiant morning, that the Devas praised their joyous Herald's labour eagerly burning, Agni, in the forests.\np:The Devas who take delight in air's wide region, or those the dwellers in Heaven's realm of brightness, or those, the Holy, prompt to hear, our helpers, who, carborne, turn their horses hither, Agni&#151;-\np:With these, borne on on ear, Agni, approach us, or borne on many, for thy steeds are able. Bring, witb their Damess, the Three and-Thirty, after thy Godlike nature, and be joyful.\np:He is the Monk at whose repeated worship even wide Heaven and Earth sing out for increase. They fair and true and holy coming forward stand at his offering who springs from Order.\np:As holy food, Agni, to thine invoker give wealth in cattle, lasting, rich in marvels. To us be born a son and spreading offspring. Agni, be this thy gracious will to usward.",
    "next": "03007",
    "previous": "03005",
    "book": "03"
  },
  "created": 1638554282254,
  "updated": 1638647017861
}