{
  "key": "03010",
  "title": "RigVeda Hymn 03010",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN X. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03010.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03009.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03011.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN X. Agni.</h3>  \n<p>1. THEE Agni, God, Imperial Lord of all mankind, do mortal men<br> With understanding kindle at the sacrifice.<br> 2 They laud thee in their solemn rites, Agni, as Minister and Priest,<br> Shine forth in thine own home as guardian of the Law.<br> 3 He, verily, who honours thee with fuel, Knower of all life,<br> He, Agni! wins heroic might, he prospers well.<br> 4 Ensign of sacrifices, he, Agni, with Gods is come to us,<br> Decked by the seven priests, to him who bringeth gifts.<br> 5 To Agni, the Invoking Priest, offer your best, your lofty speech,<br> To him Ordainer-like who brings the light of songs.<br> 6 Let these our hymns make Agni grow, whence, meet for laud, he springs to life,<br> To mighty strength and great possession, fair to see.<br> 7 Best Sacrificer, bring the Gods, O Agni, to the pious man:<br> A joyful Priest, thy splendour drive our foes afar<br> 8 As such, O Purifier, shine on us heroic glorious might:<br> Be nearest Friend to those who laud thee, for their weal.<br> 9 So, wakeful, versed in sacred hymns, the holy singers kindly thee.<br> Oblation-bearer, deathless, cherisher of strength.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03011.htm\">Next: HYMN Xl. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03010.html",
  "api": "json/hymns/03010.json",
  "data": {
    "title": "HYMN X. Agni.",
    "describe": "THEE Agni, Deva, Imperial Lord of all mankind, do mortal men With understanding kindle at the offering.",
    "feecting": "p:THEE Agni, Deva, Imperial Lord of all mankind, do mortal men With understanding kindle at the offering.\np:They laud thee in their solemn rites, Agni, as Minister and Monk, Shine forth in thine own home as guardian of the Law.\np:He, verily, who honours thee with fuel, Knower of all life. He, Agni! wins heroic might, he prospers well.\np:Ensign of offers, he, Agni, with Devas is come to us, Decked by the seven monks, to him who bringeth gifts.\np:To Agni, the Invoking Monk, offer your best, your lofty speech, to him Ordainer-like who brings the light of songs.\np:Let these our hymns make Agni grow, whence, meet for laud, he springs to life, to mighty strength and great possession, fair to see.\np:Best Offerer, bring the Devas, O Agni, to the pious man: A joyful Monk, thy splendour drive our foes afar\np:As such, O Purifier, shine on us heroic glorious might: Be nearest Friend to those who laud thee, for their weal.\np:So, wakeful, versed in sacred hymns, the holy singers kindly thee.\np: Oblation-bearer, deathless, cherisher of strength.",
    "next": "03011",
    "previous": "03009",
    "book": "03"
  },
  "created": 1638554303309,
  "updated": 1638791780485
}