{
  "key": "03016",
  "title": "RigVeda Hymn 03016",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN XVI. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03016.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03015.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03017.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XVI. Agni.</h3>  \n<p>1. THIS Agni is the Lord of great felicity and hero Strength;<br> Lord of wealth in herds of kine; Lord of the battles with the foe.<br> 2 Wait, Maruts, Heroes, upon him the Prosperer in whom is bliss-increasing wealth;<br> Who in fights ever conquer evil-hearted men, who overcome the enemy.<br> 3 As such, O Agni, deal us wealth and hero might, O Bounteous One!<br> Most lofty, very glorious, rich in progeny, free from disease and full of power.<br> 4 He who made all that lives, who passes all in might, who orders service to the Gods,<br> He works among the Gods, he works in hero strength, yea, also in the praise of men.<br> 5 Give us not up to indigence, Agni, nor want of hero sons,<br> Nor, Son of Strength, to lack of cattle, nor to blame. Drive. thou our enemies away.<br> 6 Help us to strength, blest Agni! rich in progeny, abundant, in our sacrifice.<br> Flood us with riches yet more plenteous, bringing weal, with high renown, most Glorious One!</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03017.htm\">Next: HYMN XVII. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03016.html",
  "api": "json/hymns/03016.json",
  "data": {
    "title": "HYMN XVI. Agni.",
    "describe": "THIS Agni is the Lord of great felicity and hero Strength;",
    "feecting": "p:THIS Agni is the Lord of great felicity and hero Strength; Lord of wealth in herds of kine; Lord of the battles with the foe.\np:Wait, Devas. Heroes, upon him the Prosperer in whom is bliss-increasing wealth. Who in fights ever conquer evil-hearted men, who overcome the enemy.\np:As such, O Agni, deal us wealth and hero might, O Bounteous One! Most lofty, very glorious, rich in progeny, free from disease and full of power.\np:He who made all that lives, who passes all in might, who orders service to the Devas. He works among the Devas, he works in hero strength, yea, also in the praise of men.\np:Give us not up to indigence, Agni, nor want of hero sons, Nor, Son of Strength, to lack of cattle, nor to blame. Drive. thou our enemies away.\np:Help us to strength, blest Agni! rich in progeny, abundant, in our offering.\np: Flood us with riches yet more plenteous, bringing weal, with high renown, most Glorious One!",
    "next": "03017",
    "previous": "03015",
    "book": "03"
  },
  "created": 1638554335021,
  "updated": 1638791780490
}