{
  "key": "03029",
  "title": "RigVeda Hymn 03029",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN XXIX. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03029.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03028.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03030.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXIX. Agni.</h3>  \n<p>1. HERE is the gear for friction, here tinder made ready for the spark.<br> Bring thou the Matron: we will rub Agni in ancient fashion forth.<br> 2 1n the two fire-sticks J&#257;tavedas lieth, even as the well-set germ in pregnant women,<br> Agni who day by day must be exalted by men who watch and worship with oblations.<br> 3 Lay this with care on that which lies extended: straight hath she borne the Steer when made prolific.<br> With his red pillar&#151;radiant is his splendour&#151;in our skilled task is born the Son of I&#7735;&#257;.<br> 4 In I&#7735;&#257;'s place we set thee down, upon the central point of earth,<br> That, Agni J&#257;tavedas, thou mayst bear our offerings to the Gods.<br> 5 Rub into life, ye men, the Sage, the guileless, Immortal, very wise and fair to look on.<br> O men, bring forth the most propitious Agni, first ensign of the sacrifice to eastward.<br> 6 When with their arms they rub him straight he shineth forth like a strong courser, red in colour, in the wood.<br> Bright, checkless, as it were upon the A&#347;vins' path, he passeth by the stones and burneth up the grass.<br> 7 Agni shines forth when born, observant, mighty, the bountiful, the Singer praised by sages;<br> Whom, as adorable and knowing all things, Gods set at solemn rites as offering-bearer.<br> 8 Set thee, O Priest, in, thine own place, observant: lay down the sacrifice in the home of worship.<br> Thou, dear to Gods, shalt serve them with oblation: Agni, give long life to the sacrificer.<br> 9 Raise ye a mighty smoke, my fellow-workers! Ye shall attain to wealth without obstruction.<br> This Agni is the battle-winning Hero by whom the Gods have overcome the Dasyus.<br> 10 This is thine ordered place of birth whence sprung to life thou shonest forth.<br> Knowing this, Agni, sit thee down, and prosper thou the songs we sing.<br> 11 As Germ Celestial he is called Tan&#363;nap&#257;t, and Nar&#257;&#347;a&#7745;sa born diffused in varied shape.<br> Formed in his Mother he is M&#257;tari&#347;van; he hath, in his course, become the rapid flight of wind.<br> 12 With strong attrition rubbed to life, laid down with careful hand, a Sage,<br> Agni, make sacrifices good, and for the pious bring the Gods.<br> 13 Mortals have brought to life the God Immortal, the Conqueror with mighty jaws, unfailing.<br> The sisters ten, unwedded and united, together grasp the Babe, the new-born Infant.<br> 14 Served by the seven priests, he shone forth from ancient time, when in his Mother's bosom, in her lap, he glowed.<br> Giving delight each day he closeth not his eye, since from the Asura's body hewas brought to life.<br> 15 Even as the Maruts, onslaughts who attack the foe, those born the first of all knew the full power of prayer.<br> The Ku&#347;ikas have made the glorious hymn ascend, and, each one singly in his home, have kindled fire.<br> 16 As we, O Priest observant, have elected thee this day, what time the solemn sacrifice began,<br> So surely hast thou worshipped, surely hast thou toiled: come thou unto the Soma, wise and knowing all.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03030.htm\">Next: HYMN XXX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03029.html",
  "api": "json/hymns/03029.json",
  "data": {
    "title": "HYMN XXIX. Agni.",
    "describe": "HERE is the gear for friction, here tinder made ready for the spark.",
    "feecting": "p:HERE is the gear for friction, here tinder made ready for the spark.\np: Bring thou the Matron: we will rub Agni in ancient fashion forth.\r\np:1n the two fire-sticks J&#257;tavedas lieth, even as the well-set germ in pregnant women, Agni who day by day must be exalted by men who watch and worship with oblations.\np:Lay this with care on that which lies extended: straight hath she borne the Steer when made prolific. With his red pillar&#151;radiant is his splendour&#151;in our skilled task is born the Son of I&#7735;&#257;.\np:In I&#7735;&#257;'s place we set thee down, upon the central point of Earth, that, Agni J&#257;tavedas, tho. Mayst bear our offerings to the Devas.\np:Rub into life, ye men, the Sage, the guileless, Immortal, very wise and fair to look on. O men, bring forth the most propitious Agni, first ensign of the offering to eastward.\np:When with their arms they rub him straight he shineth forth like a strong courser, red in colour, in the wood. Bright, checkless, as it were upon the A&#347;vins' path, he passeth by the stones and burneth up the grass.\np:Agni shines forth when born, observant, mighty, the bountiful, the Singer praised by sages. Whom, as adorable and knowing all things, Devas set at solemn rites as offering-bearer.\np:Set thee, O Monk, in, thine own place, observant: lay down the offering in the home of worship. Thou, dear to Devas, shalt serve them with oblation: Agni, give long life to the offeringr.\np:Raise ye a mighty smoke, my fellow-workers! Ye shall attain to wealth without obstruction. This Agni is the battle-winning Hero by whom the Devas have overcome the Dasyus.\np:This is thine ordered place of birth whence sprung to life thou shonest forth. Knowing this, Agni, sit thee down, and prosper thou the songs we sing.\np:As Germ Celestial he is called Tan&#363;nap&#257;t, and Nar&#257;&#347;a&#7745;sa born diffused in varied shape. Formed in his Mother he is M&#257;tari&#347;van; he hath, in his course, become the rapid flight of wind.\np:With strong attrition rubbed to life, laid down with careful hand, a Sage, Agni, make offers good, and for the pious bring the Devas.\np:Mortals have brought to life the Deva Immortal, the Conqueror with mighty jaws, unfailing. The sisters ten, unwedded and united, together grasp the Babe, the new-born Infant.\np:Served by the seven monks, he shone forth from ancient time, when in his Mother's bosom, in her lap, he glowed. Giving delight each day he closeth not his eye, since from the Devas's body hewas brought to life.\np:Even as the Devas, onslaughts who attack the foe, those born the first of all knew the full power of prayer. The Ku&#347;ikas have made the glorious hymn ascend, and, each one singly in his home, have kindled fire.\np:As we, O Monk observant, have elected thee this day, what time the solemn offering began, So surely hast thou worshipped, surely hast thou toiled: come thou unto the Soma, wise and knowing all.",
    "next": "03030",
    "previous": "03028",
    "book": "03"
  },
  "created": 1638554403911,
  "updated": 1638791591448
}