{
  "key": "03034",
  "title": "RigVeda Hymn 03034",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN XXXIV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03034.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03033.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03035.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXIV. Indra.</h3>  \n<p>1. FORT-RENDER, Lord of Wealth, dispelling foemen, Indra with lightnings hath o&#146;ercome the D&#257;sa.<br> Impelled by prayer and waxen great in body, he hath filled earth and heaven, the Bounteous Giver.<br> 2 I stimulate thy zeal, the Strong, the Hero decking my song of praise forth; Immortal.<br> O Indra, thou art equally the Leader of heavenly hosts and human generations.<br> 3 Leading, his band Indra encompassed V&#7771;tra; weak grew the wily leader of enchanters.<br> He who burns fierce in forests slaughtered Vya&#7745;sa, and made the Milch-kine of the nights apparent.<br> 4 Indra, light-winner, days' Creator, conquered, victorious, hostile bands with those who loved him.<br> For man the days' bright ensign he illumined, and found the light for his joy and gladness.<br> 5 Forward to fiercely falling blows pressed Indra, herolike doing many hero exploits.<br> These holy songs he taught the bard who gaised him, and widely spread these Dawns' resplendent colour.<br> 6 They laud the mighty acts of him the Mighty, the many glorious deeds performed by Indra.<br> He in his strength, with all-surpassing prowess, through wondrous arts crushed the malignant Dasyus.<br> 7 Lord of the brave, Indra who rules the people gave freedom to the Gods by might and battle.<br> Wise singers glorify with chanted praises these his achievements in Vivasv&#257;n's dwelling.<br> 8 Excellent, Conqueror, the victory-giver, the winner of the light and Godlike Waters,<br> He who hath won this broad earth and this heaven, -in Indra they rejoice who love devotions.<br> 9 He gained possession of the Sun and Horses, Indra obtained the Cow who feedeth many.<br> Treasure of gold he won; he smote the Dasyus, and gave protection to the &#256;ryan colour.<br> 10 He took the plants and days for his possession; he gained the forest trees and air's mid-region.<br> Vala he cleft, and chased away opponents: thus was he tamer of the overweening.<br> 11 Call we on Maghavan, auspicious Indra, best Hero in the fight where spoil is gathered,<br> The Strong, who listens, who gives aid in battles, who slays the V&#7771;tras, wins and gathers treasures.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03035.htm\">Next: HYMN XXXV Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03034.html",
  "api": "json/hymns/03034.json",
  "data": {
    "title": "HYMN XXXIV. Indra.",
    "describe": "FORT-RENDER, Lord of Wealth, dispelling foemen, Indra with lightnings hath o&#146;",
    "feecting": "p:FORT-RENDER, Lord of Wealth, dispelling foemen, Indra with lightnings hath o&#146;ercome the D&#257;sa.\np: Impelled by prayer and waxen great in body, he hath filled Earth and Heaven, the Bounteous Giver.\r\np:I stimulate thy zeal, the Strong, the Hero decking my song of praise forth; Immortal. O Indra, thou art equally the Leader of heavenly hosts and human generations.\np:Leading, his band Indra encompassed V&#7771;tra; weak grew the wily leader of enchanters. He who burns fierce in forests slaughtered Vya&#7745;sa, and made the Milch-kine of the nights apparent.\np:Indra, light-winner, days' Creator, conquered, victorious, hostile bands with those who loved him. For man the days' bright ensign he illumined, and found the light for his joy and gladness.\np:Forward to fiercely falling blows pressed Indra, herolike doing many hero exploits. These holy songs he taught the bard who gaised him, and widely spread these Dawns' resplendent colour.\np:They laud the mighty acts of him the Mighty, the many glorious deeds performed by Indra. He in his strength, with all-surpassing prowess, through wondrous arts crushed the malignant Dasyus.\np:Lord of the brave, Indra who rules the people gave freedom to the Devas by might and battle. Wise singers glorify with chanted praises these his achievements in Vivasv&#257;n's dwelling.\np:Excellent, Conqueror, the victory-giver, the winner of the light and Godlike Waters. He who hath won this broad Earth and this Heaven, -in Indra they rejoice who love devotions.\np:He gained possession of the Sun and Horses, Indra obtained the Cow who feedeth many. Treasure of gold he won; he smote the Dasyus, and gave protection to the &#256;ryan colour.\np:He took the plants and days for his possession; he gained the forest trees and air's mid-region. Vala he cleft, and chased away opponents: thus was he tamer of the overweening.\np:Call we on Indra, auspicious Indra, best Hero in the fight where spoil is gathered, the Strong, who listens, who gives aid in battles, who subdues the V&#7771;tras, wins and gathers treasures.",
    "next": "03035",
    "previous": "03033",
    "book": "03"
  },
  "created": 1638554430492,
  "updated": 1638646519081
}