{
  "key": "03033",
  "title": "RigVeda Hymn 03033",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN XXXIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03033.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03032.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03034.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXIII. Indra.</h3>  \n<p>1. FORTH from the bosom of the mountains, eager as two swift mares with loosened rein contending,<br> Like two bright mother cows who lick their youngling, Vip&#257;&#347; and Sutudri speed down their waters.<br> 2 Impelled by Indra whom ye pray to urge you, ye move as &#146;twere on chariots to the ocean.<br> Flowing together, swelling with your billows, O lucid Streams, each of you seeks the other.<br> 3 I have attained the most maternal River, we have approached Vip&#257;&#347;, the broad, the blessed.<br> Licking as &#146;twere their calf the pair of Mothers flow onward to their common home together.<br> 4 We two who rise and swell with billowy waters move forward to the home which Gods have made us.<br> Our flood may not be stayed when urged to motion. What would the singer, calling to the Rivers?<br> 5 Linger a little at my friendly bidding rest, Holy Ones, a moment in your journey.<br> With hymn sublime soliciting your favour Ku&#347;ika's son hath called unto the River.<br> 6 Indra who wields the thunder dug our channels: he smote down V&#7771;tra, him who stayed our currents.<br> Savitar, God, the lovely-handed, led us, and at his sending forth we flow expanded.<br> 7 That hero deed of Indra must be lauded for ever that he rent Ahi in pieces.<br> He smote away the obstructors with his thunder, and eager for their course forth flowed the waters.<br> 8 Never forget this word of thine, O singer, which future generations shall reecho.<br> In hymns, O bard, show us thy loving kindness. Humble us not mid men. To thee be honour!<br> 9 List quickly, Sisters, to the bard who cometh to you from far away with car and wagon.<br> Bow lowly down; be easy to be traversed stay, Rivers, with your floods below our axles.<br> 10 Yea, we will listen to thy words, O singer. With wain and car from far away thou comest.<br> Low, like a nursing mother, will I bend me, and yield me as a maiden to her lover.<br> 11 Soon as the Bharatas have fared across thee, the warrior band, urged on and sped by Indra,<br> Then let your streams flow on in rapid motion. I crave your favour who deserve our worship.<br> 12 The warrior host, the Bharatas, fared over the singer won the favour of the Rivers.<br> Swell with your billows, hasting, pouring riches. Fill full your channels, and roll swiftly onward.<br> 13 So let your wave bear up the pins, and ye, O Waters, spare the thongs;<br> And never may the pair of Bulls, harmless and sinless, waste away.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03034.htm\">Next: HYMN XXXIV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03033.html",
  "api": "json/hymns/03033.json",
  "data": {
    "title": "HYMN XXXIII. Indra.",
    "describe": "FORTH from the bosom of the mountains, eager as two swift mares with loosened rein contending, like two bright mother cows who lick their youngling, Vip&#257;",
    "feecting": "p:FORTH from the bosom of the mountains, eager as two swift mares with loosened rein contending, like two bright mother cows who lick their youngling, Vip&#257;&#347; and Sutudri speed down their waters.\np:Impelled by Indra whom ye pray to urge you, ye move as &#146;twere on chariots to the ocean.\np: Flowing together, swelling with your billows, O lucid Streams, each of you seeks the other.\r\np:I have attained the most maternal River, we have approached Vip&#257;&#347;, the broad, the blessed. Licking as &#146;twere their calf the pair of Mothers flow onward to their common home together.\np:We two who rise and swell with billowy waters move forward to the home which Devas have made us. Our floo. May not be stayed when urged to motion. What would the singer, calling to the Rivers?\np:Linger a little at my friendly bidding rest, Holy Ones, a moment in your journey. With hymn sublime soliciting your favour Ku&#347;ika's son hath called unto the River.\np:Indra who wields the thunder dug our channels: he smote down V&#7771;tra, him who stayed our currents. Indra, Deva, the lovely-handed, led us, and at his sending forth we flow expanded.\np:That hero deed of Indra must be lauded forever that he rent Ahi in pieces. He smote away the obstructors with his thunder, and eager for their course forth flowed the waters.\np:Never forget this word of thine, O singer, which future generations shall reecho. In hymns, O bard, show us thy loving kindness. Humble us not mid men. To thee be honour!\np:List quickly, Sisters, to the bard who cometh to you from far away with car and wagon. Bow lowly down; be easy to be traversed stay, Rivers, with your floods below our axles.\np:Yea, we will listen to thy words, O singer. With wain and car from far away thou comest. Low, like a nursing mother, will I bend me, and yield me as a maiden to her lover.\np:Soon as the Bharatas have fared across thee, the warrior band, urged on and sped by Indra, then let your streams flow on in rapid motion. I crave your favour who deserve our worship.\np:The warrior host, the Bharatas, fared over the singer won the favour of the Rivers. Swell with your billows, hasting, pouring riches. Fill full your channels, and roll swiftly onward.\np:So let your wave bear up the pins, and ye, O Waters, spare the thongs; And neve. May the pair of Bulls, harmless and sinless, waste away.",
    "next": "03034",
    "previous": "03032",
    "book": "03"
  },
  "created": 1638554425242,
  "updated": 1638791780507
}