{
  "key": "03036",
  "title": "RigVeda Hymn 03036",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN XXXVI. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03036.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03035.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03037.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXVI. Indra.</h3>  \n<p>1. WITH constant succours, fain thyself to share it, make this oblation which we bring effective.<br> Grown great through strengthening gifts at each libation, he hath become renowned by mighty exploits.<br> 2 For Indra were the Somas erst- discovered, whereby he grew strong-jointed, vast, and skilful.<br> Indra , take quickly these presented juices: drink of the strong, that which the strong have shaken.<br> 3 Drink and wax great. Thine are the juices, Indra, both Somas of old time and these we bring thee.<br> Even as thou drankest, Indra, earlier Somas, so drink to-day, a new guest, meet for praises.<br> 4 Great and impetuous, mighty-voiced in battle, surpassing power is his, and strength resistless.<br> Him the broad earth hath never comprehended when Somas cheered the Lord of Tawny Coursers.<br> 5 Mighty and strong he waxed for hero exploit: the Bull was furnished a Sage's wisdom.<br> Indra is our kind Lord; his steers have vigour; his cows are many with abundant offspring.<br> 6 As floods according to their stream flow onward, so to the sea, as borne on cars, the waters.<br> Vaster is Indra even than his dwelling, what time the stalk milked out, the Soma, fills him.<br> 7 Eager to mingle with the sea, the rivers carry the well-pressed Soma juice to Indra.<br> They drain the stalk out with their arms, quick-banded, and cleanse it with a stream of mead and filters.<br> 8 Like lakes appear his flanks filled full with Soma: yea, he contains libations in abundance.<br> When Indra had consumed the first sweet viands, he, after slaying V&#7771;tra, claimed the Soma.<br> 9 Then bring thou hither, and let none prevent it: we know thee well, the Lord of wealth and treasure.<br> That splendid gift which is thine own, O Indra, vouchsafe to us, Lord of the Tawny Coursers.<br> 10 O Indra, Maghavan, impetuous mover, grant us abundant wealth that brings all blessings.<br> Give us a hundred autumns for our lifetime: give us, O fair-checked Indra, store of heroes.<br> 11 Call we on Indra, Maghavan, auspicious, best Hero in the fight where spoil is gathered,<br> The Strong, who listens, who gives aid in battles, who slays the V&#7771;tras, wins and gathers riches.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03037.htm\">Next: HYMN XXXVII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03036.html",
  "api": "json/hymns/03036.json",
  "data": {
    "key": "03036",
    "title": "HYMN XXXVI. Indra.",
    "describe": "WITH constant assists, fain thyself to share it, make this oblation which we bring effective.",
    "feecting": "p:WITH constant assists, fain thyself to share it, make this oblation which we bring effective.\np: Grown great through strengthening gifts at each libation, he hath become renowned by mighty exploits.\r\np:For Indra were the Somas erst- discovered, whereby he grew strong-jointed, vast, and skilful. Indra , take quickly these presented juices: drink of the strong, that which the strong have shaken.\np:Drink and wax great. Thine are the juices, Indra, both Somas of old time and these we bring thee. Even as thou drankest, Indra, earlier Somas, so drink to-day, a new guest, meet for praises.\np:Great and impetuous, mighty-voiced in battle, surpassing power is his, and strength resistless. Him the broad Earth hath never comprehended when Somas cheered the Lord of Tawny Coursers.\np:Mighty and strong he waxed for hero exploit: the Bull was furnished a Sage's wisdom. Indra is our kind Lord; his steers have vigour; his cows are many with abundant offspring.\np:As floods according to their stream flow onward, so to the sea, as borne on cars, the waters. Vaster is Indra even than his dwelling, what time the stalk milked out, the Soma, fills him.\np:Eager to mingle with the sea, the rivers carry the well-pressed Soma juice to Indra. They drain the stalk out with their arms, quick-banded, and cleanse it with a stream of mead and filters.\np:Like lakes appear his flanks filled full with Soma: yea, he contains libations in abundance. When Indra had consumed the first sweet offerings, he, after subduing Vṛtra, claimed the Soma.\np:Then bring thou hither, and let none prevent it: we know thee well, the Lord of wealth and treasure. That splendid gift which is thine own, O Indra, vouchsafe to us, Lord of the Tawny Coursers.\np:O Indra, Indra, impetuous mover, grant us abundant wealth that brings all blessings. Give us a hundred autumns for our lifetime: give us, O fair-checked Indra, store of heroes.\np:Call we on Indra, Indra, auspicious, best Hero in the fight where spoil is gathered, the Strong, who listens, who gives aid in battles, who subdues the Vṛtras, wins and gathers riches.",
    "meta": {
      "next": "03037",
      "previous": "03035",
      "book": "03",
      "original": "https://sacred-texts.com/hin/rigveda/rv03036.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv03036.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "03036",
            "title": "HYMN XXXVI. Indra."
          },
          {
            "key": "03036",
            "title": "HYMN XXXVI. Indra."
          }
        ]
      },
      {
        "name": "O fair",
        "hymns": [
          {
            "key": "03036",
            "title": "HYMN XXXVI. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638554441257,
  "updated": 1639023784239
}