{
  "key": "03038",
  "title": "RigVeda Hymn 03038",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN XXXVIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03038.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03037.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03039.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXVIII. Indra.</h3>  \n<p>1. HASTING like some strong courser good at drawing, a thought have I imagined like a workman.<br> Pondering what is dearest and most noble, I long to see the sages full of wisdom.<br> 2 Ask of the sages' mighty generations firm-minded and devout they framed the heaven.<br> These are thy heart-sought strengthening directions, and they have come to be sky's upholders.<br> 3 Assuming in this world mysterious natures, they decked the heaven and earth for high dominion,<br> Measured with measures, fixed their broad expanses, set the great worlds apart held firm for safety.<br> 4 Even as he mounted up they all adorned him: self-luminous he travels clothed in splendour.<br> That is the Bull's, the Asura's mighty figure: he, omniform, hath reached the eternal waters.<br> 5 First the more ancient Bull engendered offspring; these are his many draughts that lent him vigour.<br> From days of old ye Kings, two Sons of Heaven, by hymns of sacrifice have won dominion.<br> 6 Three seats ye Sovrans, in the Holy synod, many, yea, all, ye honour with your presence.<br> There saw I, going thither in the spirit, Gandharvas in their course with wind-blown tresses.<br> 7 That same companionship of her, the Milch-cow, here with the strong Bull's divers forms they stablished.<br> Enduing still some new celestial figure, the skilful workers shaped a form around him.<br> 8 Let no one here debar me from enjoying the golden light which Savitar diffuses.<br> He covers both all-fostering worlds with praises even as a woman cherishes her children.<br> 9 Fulfil, ye twain, his work, the Great, the Ancient: as heavenly blessing keep your guard around us.<br> All the wise Gods behold his varied actions who stands erect, whose voice is like a herdsman's.<br> 10 Call we on Indra, Maghavan, auspicious, best Hero in the fight where spoil is gathered,<br> The Strong, who listens, who gives aid in battles, who slays the V&#7771;tras, wins and gathers riches.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03039.htm\">Next: HYMN XXXIX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03038.html",
  "api": "json/hymns/03038.json",
  "data": {
    "title": "HYMN XXXVIII. Indra.",
    "describe": "HASTING like some strong courser good at drawing, a thought have I imagined like a workman.",
    "feecting": "p:HASTING like some strong courser good at drawing, a thought have I imagined like a workman.\np: Pondering what is dearest and most noble, I long to see the sages full of wisdom.\r\np:Ask of the sages' mighty generations firm-minded and devout they framed the Heaven. These are thy heart-sought strengthening directions, and they have come to be sky's upholders.\np:Assuming in this world mysterious natures, they decked the Heaven and Earth for high dominion, Measured with measures, fixed their broad expanses, set the great worlds apart held firm for safety.\np:Even as he mounted up they all adorned him: self-luminous he travels clothed in splendour. That is the Bull's, the Devas's mighty figure: he, omniform, hath reached the eternal waters.\np:First the more ancient Bull engendered offspring; these are his many draughts that lent him vigour. From days of old ye Kings, two Sons of Heaven, by hymns of offering have won dominion.\np:Three seats ye Sovrans, in the Holy synod, many, yea, all, ye honour with your presence. There saw I, going thither in the spirit, Gandharvas in their course with wind-blown tresses.\np:That same companionship of her, the Milch-cow, here with the strong Bull's divers forms they stablished. Enduing still some new celestial figure, the skilful workers shaped a form around him.\np:Let no one here debar me from enjoying the golden light which Indra diffuses. He covers both all-fostering worlds with praises even as a woman cherishes her children.\np:Fulfil, ye twain, his work, the Great, the Ancient: as heavenly blessing keep your guard around us. All the wise Devas behold his varied actions who stands erect, whose voice is like a herdsman's.\np:Call we on Indra, Indra, auspicious, best Hero in the fight where spoil is gathered, the Strong, who listens, who gives aid in battles, who subdues the V&#7771;tras, wins and gathers riches.",
    "next": "03039",
    "previous": "03037",
    "book": "03"
  },
  "created": 1638554451769,
  "updated": 1638791780512
}