{
  "key": "03043",
  "title": "RigVeda Hymn 03043",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN XLIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03043.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03042.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03044.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XLIII. Indra.</h3>  \n<p>1. MOUNTED upon thy chariot-seat approach us: thine is the Soma-draught from days aforetime.<br> Loose for the sacred grass thy dear companions. These men who bring oblation call thee hither.<br> 2 Come our true Friend, passing by many people; come with thy two Bay Steeds to our devotions;<br> For these our hymns are calling thee, O Indra, hymns formed for praise, soliciting thy friendship.<br> 3 Pleased, with thy Bay Steeds, Indra, God, come quickly to this our sacrifice that heightens worship;<br> For with my thoughts, presenting oil to feed thee, I call thee to the feast of sweet libations.<br> 4 Yea, let thy two Bay Stallions bear thee hither, well limbed and good to draw, thy dear companions.<br> Pleased with the corn-blent offering which we bring thee, may Indra, Friend, hear his friend's adoration.<br> 5 Wilt thou not make me guardian of the people, make me, impetuous Maghavan, their ruler?<br> Make me a &#7770;&#7779;i having drunk of Soma? Wilt thou not give me wealth that lasts for ever?<br> 6 Yoked to thy chariot, led thy tall Bays, Indra, companions of thy banquet, bear thee hither,<br> Who from of old press to heaven's farthest limits, the Bull's impetuous and well-groomed Horses.<br> 7 Drink of the strong pressed out by strong ones, Indra, that which the Falcon brought thee when thou longedst;<br> In whose wild joy thou stirrest up the people, in whose wild joy thou didst unbar the cow-stalls.<br> 8 Call we on Indra, Makhavan, auspicious, best Hero in the fight where spoil is gathered;<br> The Strong, who listens, who gives aid in battles, who slays the V&#7771;tras, wins and gathers riches.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03044.htm\">Next: HYMN XLIV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03043.html",
  "api": "json/hymns/03043.json",
  "data": {
    "title": "HYMN XLIII. Indra.",
    "describe": "MOUNTED upon thy chariot-seat approach us: thine is the Soma-draught from days aforetime.",
    "feecting": "p:MOUNTED upon thy chariot-seat approach us: thine is the Soma-draught from days aforetime.\np: Loose for the sacred grass thy dear companions. These men who bring oblation call thee hither.\r\np:Come our true Friend, passing by many people; come with thy two Bay Steeds to our devotions; For these our hymns are calling thee, O Indra, hymns formed for praise, soliciting thy friendship.\np:Pleased, with thy Bay Steeds, Indra, Deva, come quickly to this our offering that heightens worship; For with my thoughts, presenting oil to feed thee, I call thee to the feast of sweet libations.\np:Yea, let thy two Bay Stallions bear thee hither, well limbed and good to draw, thy dear companions. Pleased with the corn-blent offering which we bring thee. May Indra, Friend, hear his friend's adoration.\np:Wilt thou not make me guardian of the people, make me, impetuous Indra, their ruler? Make me a &#7770;&#7779;i having drunk of Soma? Wilt thou not give me wealth that lasts forever?\np:Yoked to thy chariot, led thy tall Bays, Indra, companions of thy banquet, bear thee hither, who from of old press to Heaven's farthest limits, the Bull's impetuous and well-groomed Horses.\np:Drink of the strong pressed out by strong ones, Indra, that which the Falcon brought thee when thou longedst; In whose wild joy thou stirrest up the people, in whose wild joy thou didst unbar the cow-stalls.\np:Call we on Indra, Makhavan, auspicious, best Hero in the fight where spoil is gathered; The Strong, who listens, who gives aid in battles, who subdues the V&#7771;tras, wins and gathers riches.",
    "next": "03044",
    "previous": "03042",
    "book": "03"
  },
  "created": 1638554478135,
  "updated": 1638791252837
}