{
  "key": "03052",
  "title": "RigVeda Hymn 03052",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN LII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03052.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03051.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03053.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LII. Indra.</h3>  \n<p>1. INDRA, accept at break of day our Soma mixt with roasted corn,<br> With groats with cake, with eulogies.<br> 2 Accept, O Indra, and enjoy the well-dressed sacrificial cake: Oblations are poured forth to thee.<br> 3 Consume our sacrificial cake, accept the songs of praise we sing,<br> As he who woes accepts his bride.<br> 4 Famed from of old, accept the cake at our libation poured at dawn,<br> Forgreat, O Indra, is thy power.<br> 5 Let roasted corn of our midday libation, and sacrificial cake here please thee, Indra,<br> What time the lauding singer, keen of purpose and eager as a bull, with hymns implores thee.<br> 6 At the third sacrifice, O thou whom many praise, give glory to the roasted corn and holy cake.<br> With offered viands and with songs may we assist thee, Sage, whom V&#257;ja and the &#7770;bhus wait upon.<br> 7 The groats have we prepared for thee with P&#363;&#7779;an, corn for thee, Lord of Bay Steeds, with thy horses.<br> Eat thou the meal-cake, banded with the Maruts, wise Hero, V&#7771;tra-slayer, drink the Soma.<br> 8 Bring forth the roasted corn to meet him quickly, cake for the bravest Hero mid the heroes.<br> Indra, may hymns accordant with thee daily strengthen thee, Bold One, for the draught of Soma.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03053.htm\">Next: HYMN LIII. Indra, Parvata, Etc.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03052.html",
  "api": "json/hymns/03052.json",
  "data": {
    "title": "HYMN LII. Indra.",
    "describe": "INDRA, accept at break of day our Soma mixt with roasted corn, with groats with cake, with eulogies.",
    "feecting": "p:INDRA, accept at break of day our Soma mixt with roasted corn, with groats with cake, with eulogies.\np:Accept, O Indra, and enjoy the well-dressed sacrificial cake: Oblations are poured forth to thee.\np:Consume our sacrificial cake, accept the songs of praise we sing, as he who woes accepts his bride.\np:Famed from of old, accept the cake at our libation poured at dawn, forgreat, O Indra, is thy power.\np:Let roasted corn of our midday libation, and sacrificial cake here please thee, Indra, What time the lauding singer, keen of purpose and eager as a bull, with hymns implores thee.\np:At the third offering, O thou whom many praise, give glory to the roasted corn and holy cake.\np: With offered offerings and with song. May we assist thee, Sage, whom V&#257;ja and the &#7770;bhus wait upon.\r\np:The groats have we prepared for thee with P&#363;&#7779;an, corn for thee, Lord of Bay Steeds, with thy horses. Eat thou the meal-cake, banded with the Devas, wise Hero, V&#7771;tra-slayer, drink the Soma.\np:Bring forth the roasted corn to meet him quickly, cake for the bravest Hero mid the heroes. Indra, may hymns accordant with thee daily strengthen thee, Bold One, for the draught of Soma.",
    "next": "03053",
    "previous": "03051",
    "book": "03"
  },
  "created": 1638554525828,
  "updated": 1638647017906
}