{
  "key": "03055",
  "title": "RigVeda Hymn 03055",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN LV. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03055.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03054.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03056.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LV. Vi&#347;vedevas.</h3>  \n<p>1. AT the first shining of the earliest Mornings, in the Cow's home was born the Great Eternal.<br> Now shall the statutes of the Gods be valid. Great is the Gods&#146; supreme and sole dominion -<br> 2 Let not the Gods here injure us, O Agni, nor Fathers of old time who know the region,<br> Nor the sign set between two ancient dwellings. Great is the Gods&#146; supreme and sole dominion.<br> 3 My wishes fly abroad to many places: I glance back to the ancient sacrifices.<br> Let us declare the truth when fire is kindled. Great is the Gods&#146; supreme and sole dominion.<br> 4 King Universal, born to sundry quarters, extended through the wood be lies on couches.<br> One Mother rests: another feeds the Infant. Great is the Gods&#146; supreme and sole dominion.<br> 5 Lodged in old plants, he grows again in younger, swiftly within the newly-born and tender.<br> Though they are unimpregned, he makes them fruitful. Great is the Gods&#146; supreme and sole dominion.<br> 6 Now lying far away, Child of two Mothers, he wanders unrestrained, the single youngling.<br> These are the laws of Varu&#7751;a and Mitra. Great is the Gods&#146; supreme and sole dominion.<br> 7 Child of two Mothers, Priest, sole Lord in synods, he still precedes while resting as foundation.<br> They who speak sweetly bring him sweet addresses. Great is the Gods&#146; supreme and sole dominion.<br> 8 As to a friendly warrior when he battles, each thing that comes anear is seen to meet him.<br> The hymn commingles with the cow's oblation. Great is the Gods&#146; supreme and sole dominion.<br> 9 Deep within these the hoary envoy pierceth; mighty, he goeth to the realm of splendour,<br> And looketh on us, clad in wondrous beauty. Great is the Gods&#146; supreme and sole dominion.<br> 10 Vi&#7779;&#7751;u, the guardian, keeps the loftiest station, upholding dear, immortal dwelling-places.<br> Agni knows well all these created beings. Great is the Gods&#146; supreme and sole dominion.<br> 11 Ye, variant Pair, have made yourselves twin beauties: one of the Twain is dark, bright shines the other;<br> And yet these two, the dark, the red, are Sisters. Great is the Gods&#146; supreme and sole dominion.<br> 12 Where the two Cows, the Mother and the Daughter, meet and give suck yielding their lordly nectar,<br> I praise them at the seat of law eternal. Great is the Gods&#146; supreme and sole dominion.<br> 13 Loud hath she lowed, licking the other's youngling. On what world hath the Milch-cow laid her udder?<br> This I&#7735;&#257; streameth with the milk of Order. Great is the Gods&#146; supreme and sole dominion.<br> 14 Earth weareth beauties manifold: uplifted, licking her Calf of eighteen months, she standeth.<br> Well-skilled I seek the seat of law eternal. Great is the Gods&#146; supreme and sole dominion.<br> 15 Within a wondrous place the Twain are treasured: the one is manifest, the other hidden.<br> One common pathway leads in two directions. Great is the Gods&#146; supreme and sole dominion.<br> 16 Let the milch-kine that have no calves storm downward, yielding rich nectar, streaming, unexhausted,<br> These who are ever new and fresh and youthful. Great is the Gods&#146; supreme and sole dominion.<br> 17 What time the Bull bellows in other regions, another herd receives the genial moisture;<br> For he is Bhaga, King, the earth's Protector. Great is the Gods&#146; supreme and sole dominion.<br> 18 Let us declare the Hero's wealth in horses, O all ye folk: of this the Gods have knowledge.<br> Sixfold they bear him, or by fives are harnessed. Great is the Gods&#146; supreme and sole dominion.<br> 19 Tva&#7779;&#7789;ar the God, the omniform. Creator, begets and feeds mankind in various manner.<br> His, verily, arc all these living creatures. Great is the Gods&#146; supreme dominion.<br> 20 The two great meeting Bowls hath he united: each of the Pair is laden with histreasure.<br> The Hero is renowned for gathering riches. Great is the Gods&#146; supreme and sole dominion.<br> 21 Yea, and on this our earth the All-Sustainer dwells like a King with noble friends about him.<br> In his protection heroes rest in safety. Great is the Cods' supreme and sole dominion.<br> 22 Rich in their gifts for thee are herbs and waters, and earth brings all her wealth for thee, O Indra.<br> May we as friends of thine share goodly treasures. Great is the Gods&#146; supreme and sole dominion.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03056.htm\">Next: HYMN LVI. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03055.html",
  "api": "json/hymns/03055.json",
  "data": {
    "key": "03055",
    "title": "HYMN LV. Devas.",
    "describe": "AT the first shining of the earliest Mornings, in the Cow's home was born the Great Eternal.",
    "feecting": "p:AT the first shining of the earliest Mornings, in the Cow's home was born the Great Eternal.\np: Now shall the statutes of the Devas be valid. Great is the Devas’ supreme and sole dominion -\r\np:Let not the Devas here injure us, O Agni, nor Fathers of old time who know the region, Nor the sign set between two ancient dwellings. Great is the Devas’ supreme and sole dominion.\np:My wishes fly abroad to many places: I glance back to the ancient offers. Let us declare the truth when fire is kindled. Great is the Devas’ supreme and sole dominion.\np:King Universal, born to sundry quarters, extended through the wood be lies on couches. One Mother rests: another feeds the Infant. Great is the Devas’ supreme and sole dominion.\np:Lodged in old plants, he grows again in younger, swiftly within the newly-born and tender. Though they are unimpregned, he makes them fruitful. Great is the Devas’ supreme and sole dominion.\np:Now lying far away, Child of two Mothers, he wanders unrestrained, the single youngling. These are the laws of Indra and Mitra. Great is the Devas’ supreme and sole dominion.\np:Child of two Mothers, Monk, sole Lord in synods, he still precedes while resting as foundation. They who speak sweetly bring him sweet addresses. Great is the Devas’ supreme and sole dominion.\np:As to a friendly warrior when he battles, each thing that comes anear is seen to meet him. The hymn commingles with the cow's oblation. Great is the Devas’ supreme and sole dominion.\np:Deep within these the hoary envoy pierceth; mighty, he goeth to the realm of splendour, and looketh on us, clad in wondrous beauty. Great is the Devas’ supreme and sole dominion.\np:Indra, the guardian, keeps the loftiest station, upholding dear, immortal dwelling-places. Agni knows well all these created beings. Great is the Devas’ supreme and sole dominion.\np:Ye, variant Pair, have made yourselves twin beauties: one of the Twain is dark, bright shines the other; And yet these two, the dark, the red, are Sisters. Great is the Devas’ supreme and sole dominion.\np:Where the two Cows, the Mother and the Daughter, meet and give suck yielding their lordly nectar, I praise them at the seat of law eternal. Great is the Devas’ supreme and sole dominion.\np:Loud hath she lowed, licking the other's youngling. On what world hath the Milch-cow laid her udder? This Iḷā streameth with the milk of Order. Great is the Devas’ supreme and sole dominion.\np:Earth weareth beauties manifold: uplifted, licking her Calf of eighteen months, she standeth. Well-skilled I seek the seat of law eternal. Great is the Devas’ supreme and sole dominion.\np:Within a wondrous place the Twain are treasured: the one is manifest, the other hidden. One common pathway leads in two directions. Great is the Devas’ supreme and sole dominion.\np:Let the milch-kine that have no calves storm downward, yielding rich nectar, streaming, unexhausted, these who are ever new and fresh and youthful. Great is the Devas’ supreme and sole dominion.\np:What time the Bull bellows in other regions, another herd receives the genial moisture; For he is Bhaga, King, the Earth's Protector. Great is the Devas’ supreme and sole dominion.\np:Let us declare the Hero's wealth in horses, O all ye folk: of this the Devas have knowledge. Sixfold they bear him, or by fives are harnessed. Great is the Devas’ supreme and sole dominion.\np:Tvaṣṭar the Deva, the omniform. Creator, begets and feeds mankind in various manner. His, verily, arc all these living creatures. Great is the Devas’ supreme dominion.\np:The two great meeting Bowls hath he united: each of the Pair is laden with histreasure. The Hero is renowned for gathering riches. Great is the Devas’ supreme and sole dominion.\np:Yea, and on this our Earth the All-Sustainer dwells like a King with noble friends about him. In his protection heroes rest in safety. Great is the Cods' supreme and sole dominion.\np:Rich in their gifts for thee are herbs and waters, and Earth brings all her wealth for thee, O Indra, may we as friends of thine share goodly treasures. Great is the Devas’ supreme and sole dominion.",
    "meta": {
      "next": "03056",
      "previous": "03054",
      "book": "03",
      "source": "https://sacred-texts.com/hin/rigveda/rv03055.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv03055.htm"
    },
    "deities": [
      {
        "name": "O Agni",
        "hymns": [
          {
            "key": "03055",
            "title": "HYMN LV. Devas."
          }
        ]
      },
      {
        "name": "O all",
        "hymns": [
          {
            "key": "03055",
            "title": "HYMN LV. Devas."
          }
        ]
      },
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "03055",
            "title": "HYMN LV. Devas."
          }
        ]
      }
    ]
  },
  "created": 1638554541608,
  "updated": 1638830292091
}