{
  "key": "03060",
  "title": "RigVeda Hymn 03060",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 3: HYMN LX. &#7770;bhus.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv03060.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi03.htm\">Rig-Veda, Book 3 Index</A><BR>\n&nbsp;\n<A HREF=\"rv03059.htm\">Previous</A>&nbsp;\n<A HREF=\"rv03061.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LX. &#7770;bhus.</h3>  \n<p>1. HERE is your ghostly kinship, here, O Men: they came desirous to these holy rites with store of wealth,<br> With wondrous arts, whereby, with schemes to meet each need, Ye gained, Sudhanvan's Sons! your share in sacrifice.<br> 2 The mighty powers wherewith. ye formed the chalices, the thought by which ye drew the cow from out the hide,<br> The intellect wherewith ye wrought the two Bay Steeds,&#151;through these, O &#7770;bhus, ye attained divinity.<br> 3 Friendship with Indra have the &#7770;bhus, fully gained: grandsons of Manu, they skilfully urged the work.<br> Sudhanvan's Children won them everlasting life, serving with holy rites, pious with noble acts.<br> 4:In company with Indra come ye to the juice, then gloriously shall your wishes be fulfilled.<br> Not to be paragoned, ye Priests, are your good deeds, nor your heroic acts, &#7770;bhus, Sudhanvan's Sons.<br> 5 O Indra, with the &#7770;bhus, Mighty Ones, pour down the Soma juice effused, well-blent, from both thy hands.<br> Maghalan, urged by song, in the drink-offerer's house rejoice thee with the Heroes, with Sudhanvan's Sons.<br> 6 With &#7770;bhu near, and V&#257;ja, Indra, here exult, with Saci, praised of many, in the juice we pour.<br> These homes wherein we dwell have turned themselves to thee, -devotions to the Gods, as laws of men ordain.<br> 7 Come with the mighty &#7770;bhus, Indra, come to us, strengthening with thy help the singer's holy praise;<br> At hundred eager calls come to the living man, with thousand arts attend the act of sacrifice.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv03061.htm\">Next: HYMN LXI. U&#7779;as.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/03060.html",
  "api": "json/hymns/03060.json",
  "data": {
    "title": "HYMN LX. &#7770;bhus.",
    "describe": "HERE is your ghostly kinship, here, O Men: they came desirous to these holy rites with store of wealth, with wondrous arts, whereby, with schemes to meet each need, Ye gained, Sudhanvan's Sons!",
    "feecting": "p:HERE is your ghostly kinship, here, O Men: they came desirous to these holy rites with store of wealth, with wondrous arts, whereby, with schemes to meet each need, Ye gained, Sudhanvan's Sons! your share in offering.\np:The mighty powers wherewith. ye formed the chalices, the thought by which ye drew the cow from out the hide, the intellect wherewith ye wrought the two Bay Steeds,&#151;through these, O &#7770;bhus, ye attained divinity.\np:Friendship with Indra have the &#7770;bhus, fully gained: grandsons of Manu, they skilfully urged the work.\np: Sudhanvan's Children won them everlasting life, serving with holy rites, pious with noble acts.\r\np::In company with Indra come ye to the juice, then gloriously shall your wishes be fulfilled. Not to be paragoned, ye Monks, are your good deeds, nor your heroic acts, &#7770;bhus, Sudhanvan's Sons.\np:O Indra, with the &#7770;bhus, Mighty Ones, pour down the Soma juice effused, well-blent, from both thy hands. Maghalan, urged by song, in the drink-offerer's house rejoice thee with the Heroes, with Sudhanvan's Sons.\np:With &#7770;bhu near, and V&#257;ja, Indra, here exult, with Saci, praised of many, in the juice we pour. These homes wherein we dwell have turned themselves to thee, -devotions to the Devas, as laws of men ordain.\np:Come with the mighty &#7770;bhus, Indra, come to us, strengthening with thy help the singer's holy praise; At hundred eager calls come to the living man, with thousand arts attend the act of offering.",
    "next": "03061",
    "previous": "03059",
    "book": "03"
  },
  "created": 1638554567887,
  "updated": 1638646519108
}