{
  "key": "04016",
  "title": "RigVeda Hymn 04016",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XVI. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04016.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04015.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04017.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XVI. Indra.</h3>  \n<p>1. IMPETUOUS, true, let Maghavan come hither, and let his Tawny Coursers speed to reach us.<br> For him have we pressed juice exceeding potent: here, praised with song, let him effect his visit.<br> 2 Unyoke, as at thy journey's end, O Hero, to gladden thee today at this libation.<br> Like U&#347;an&#257;, the priest a laud shall utter, a hymn to thee, the Lord Divine, who markest.<br> 3 When the Bull, quaffing, praises our libation, as a sage paying holy rites in secret,<br> Seven singers here from heaven hath he begotten, who e&#146;en by day have wrought their works while singing.<br> 4 When heaven's fair light by hymns was made apparent (they made great splendour shine at break of morning),<br> He with his succour, best of Heroes, scattered the blinding darkness so that men saw clearly.<br> 5 Indra, Impetuous One, hath waxed immensely: he with his vastness hath filled earth and heaven.<br> E&#146;en beyond this his majesty extendeth who hath exceeded all the worlds in greatness.<br> 6 &#346;akra who knoweth well all human actions hath with his eager Friends let loose the waters.<br> They with their songs cleft e&#146;en the mountain open and willingly disclosed the stall of cattle.<br> 7 He smote away the floods' obstructer, V&#7771;tra; Earth, conscious, lent her aid to speed thy thunder.<br> Thou sentest forth the waters of the ocean, as Lord through power and might, O daring Hero.<br> 8 When, Much-invoked! the water's rock thou cleftest, Saram&#257; showed herself and went before thee.<br> Hymned by A&#7749;girases, bursting the cow-stalls, much strength thou foundest for us as our leader.<br> 9 Come, Maghavan, Friend of Man, to aid the singer imploring thee in battle for the sunlight.<br> Speed him with help in his inspired invokings: down sink the sorcerer, the prayerless Dasyu.<br> 10 Come to our home resolved to slay the Dasyu: Kutsa longed eagerly to win thy friendship.<br> Alike in form ye both sate in his dwelling the faithful Lady was in doubt between you.<br> 11 Thou comest, fain to succour him, with Kutsa,&#151;a goad that masters both the Wind-God's horses,<br> That, holding the brown steeds like spoil for capture, the sage may on the final day be present.<br> 12 For Kutsa, with thy thousand, thou at day-break didst hurl down greedy &#346;u&#7779;&#7751;a, foe of harvest.<br> Quickly with Kutsa's friend destroy the Dasyus, and roll the chariot-wheel of S&#363;rya near us.<br> 13 Thou to the son of Vidathin, &#7770;ji&#347;van, gavest up mighty M&#7771;gaya and Pipru.<br> Thou smotest down the swarthy fifty thousand, and rentest forts as age consumes a garment.<br> 14 What time thou settest near the Sun thy body, thy form, Immortal One, is seen expanding:<br> Thou a wild elephant with might invested. like a dread lion as thou wieldest weapons.<br> 15 Wishes for wealth have gone to Indra, longing for him in war for light and at libation,<br> Eager for glory, labouring with praisesongs: he is like home, like sweet and fair nutrition.<br> 16 Call we for you that Indra, prompt to listen, him who hath done so much for men's advantage;<br> Who, Lord of envied bounty, to a singer like me brings quickly booty worth the capture.<br> 17 When the sharp-pointed arrow, O thou Hero, flieth mid any conflict of the people,<br> When, Faithful One, the dread encounter cometh, then be thou the Protector of our body.<br> 18 Further the holy thoughts of Vamadeva be thou a guileless Friend in fight for booty.<br> We come to thee whose providence protects us: wide be thy sway for ever for thy singer.<br> 19 O Indra, with these men who love thee truly, free givers, Maghavan, in every battle,<br> May we rejoice through many autumns, quelling our foes, as days subdue the nights with splendour.<br> 20 Now, as the Bh&#7771;gus wrought a car, for Indra the Strong, the Mighty, we our prayer have fashioned,<br> That he may, ne&#146;er withdraw from us his friendship, but be our bodies' guard and strong defender.<br> 21 Now, Indra! lauded, glorified with praises, let power swell. high like rivers for the singer.<br> For thee a new hymn, Lord of Bays, is fashioned. May we, car-borne, through song be victors ever.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04017.htm\">Next: HYMN XVII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04016.html",
  "api": "json/hymns/04016.json",
  "data": {
    "key": "04016",
    "title": "HYMN XVI. Indra.",
    "describe": "IMPETUOUS, true, let Indra come hither, and let his Tawny Coursers speed to reach us.",
    "feecting": "p:IMPETUOUS, true, let Indra come hither, and let his Tawny Coursers speed to reach us.\np: For him have we pressed juice exceeding potent: here, praised with song, let him effect his visit.\r\np:Unyoke, as at thy journey's end, O Hero, to gladden thee today at this libation. Like Uśanā, the Monk a laud shall utter, a hymn to thee, the Lord Divine, who markest.\np:When the Bull, quaffing, praises our libation, as a sage paying holy rites in secret, Seven singers here from Heaven hath he begotten, who e’en by day have wrought their works while singing.\np:When Heaven's fair light by hymns was made apparent (they made great splendour shine at break of morning). He with his assist, best of Heroes, scattered the blinding darkness so that men saw clearly.\np:Indra, Impetuous One, hath waxed immensely: he with his vastness hath filled Earth and Heaven. E’en beyond this his majesty extendeth who hath exceeded all the worlds in greatness.\np:Indra who knoweth well all human actions hath with his eager Friends let loose the waters. They with their songs cleft e’en the mountain open and willingly disclosed the stall of cattle.\np:He smote away the floods' obstructer, Vṛtra; Earth, conscious, lent her aid to speed thy thunder. Thou sentest forth the waters of the ocean, as Lord through power and might, O daring Hero.\np:When, Much-invoked! the water's rock thou cleftest, Saramā showed herself and went before thee. Hymned by Aṅgirases, bursting the cow-stalls, much strength thou foundest for us as our leader.\np:Come, Indra, Friend of Man, to aid the singer imploring thee in battle for the sunlight. Speed him with help in his inspired invokings: down sink the sorcerer, the prayerless Dasyu.\np:Come to our home resolved to subdue the Dasyu: Kutsa longed eagerly to win thy friendship. Alike in form ye both sate in his dwelling the faithful Lady was in doubt between you.\np:Thou comest, fain to assist him, with Kutsa.a goad that masters both the Wind-Deva's horses, that, holding the brown steeds like spoil for capture, the sag. May on the final day be present.\np:For Kutsa, with thy thousand, thou at day-break didst hurl down greedy Śuṣṇa, foe of harvest. Quickly with Kutsa's friend destroy the Dasyus, and roll the chariot-wheel of Sūrya near us.\np:Thou to the son of Vidathin, Ṛjiśvan, gavest up mighty Mṛgaya and Pipru. Thou smotest down the swarthy fifty thousand, and rentest forts as age consumes a garment.\np:What time thou settest near the Sun thy body, thy form, Immortal One, is seen expanding: Thou a wild elephant with might invested. like a dread lion as thou wieldest weapons.\np:Wishes for wealth have gone to Indra, longing for him in war for light and at libation, Eager for glory, labouring with praisesongs: he is like home, like sweet and fair nutrition.\np:Call we for you that Indra, prompt to listen, him who hath done so much for men's advantage. Who, Lord of envied bounty, to a singer like me brings quickly booty worth the capture.\np:When the sharp-pointed arrow, O thou Hero, flieth mid any conflict of the people, when, Faithful One, the dread encounter cometh, then be thou the Protector of our body.\np:Further the holy thoughts of Vamadeva be thou a guileless Friend in fight for booty. We come to thee whose providence protects us: wide be thy sway forever for thy singer.\np:O Indra, with these men who love thee truly, free givers, Indra, in every battle, may we rejoice through many autumns, quelling our foes, as days subdue the nights with splendour.\np:Now, as the Bhṛgus wrought a car, for Indra the Strong, the Mighty, we our meditation have fashioned, that h. May, ne’er withdraw from us his friendship, but be our bodies' guard and strong defender.\np:Now, Indra! lauded, glorified with praises, let power swell. high like rivers for the singer. For thee a new hymn, Lord of Bays, is fashioned. May we, car-borne, through song be victors ever.",
    "meta": {
      "next": "04017",
      "previous": "04015",
      "book": "04",
      "original": "https://sacred-texts.com/hin/rigveda/rv04016.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv04016.htm"
    },
    "deities": [
      {
        "name": "O Hero",
        "hymns": [
          {
            "key": "04016",
            "title": "HYMN XVI. Indra."
          }
        ]
      },
      {
        "name": "O daring",
        "hymns": [
          {
            "key": "04016",
            "title": "HYMN XVI. Indra."
          },
          {
            "key": "04016",
            "title": "HYMN XVI. Indra."
          },
          {
            "key": "04016",
            "title": "HYMN XVI. Indra."
          },
          {
            "key": "04016",
            "title": "HYMN XVI. Indra."
          }
        ]
      },
      {
        "name": "O thou",
        "hymns": [
          {
            "key": "04016",
            "title": "HYMN XVI. Indra."
          }
        ]
      },
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "04016",
            "title": "HYMN XVI. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638554662587,
  "updated": 1667450402915
}