{
  "key": "04019",
  "title": "RigVeda Hymn 04019",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XIX. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04019.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04018.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04020.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XIX. Indra.</h3>  \n<p>1. THEE, verily, O Thunder-wielding Indra, all the Gods here, the Helpers swift to listen,<br> And both the worlds elected, thee the Mighty, High, waxen strong, alone to slaughter V&#7771;tra.<br> 2 The Gods, as worn witheld, relaxed their efforts: thou, Indra, born of truth, wast Sovran Ruler.<br> Thou slewest Ahi who besieged the waters, and duggest out their all-supporting channels.<br> 3 The insatiate one, extended, hard to waken, who slumbered in perpetual sleep, O Indra,&#151;<br> The Dragon stretched against the seven prone rivers, where no joint was, thou rentest with thy thunder.<br> 4 Indra with might shook earth and her foundation as the wind stirs the water with its fury.<br> Striving, with strength he burst the firm asunder, and tore away the summits of the mountains.<br> 5 They ran to thee as mothers to their offspring: the clouds, like chariots, hastened forth together.<br> Thou didst refresh the streams and force the billows: thou, Indra, settest free obstructed rivers.<br> 6 Thou for the sake of Vayya and Turv&#299;ti didst stay the great stream, flowing, all-sustaining:<br> Yea, at their prayer didst check the rushing river and make the floods easy to cross, O Indra.<br> 7 He let the young Maids skilled in Law, unwedded, like fountains, bubbling, flow forth streaming onward.<br> He inundated thirsty plains and deserts, and milked the dry Cows of the mighty master.<br> 8 Through many a morn and many a lovely autumn, having slain V&#7771;tra, he set free the rivers.<br> Indra hath set at liberty to wander on earth the streams encompassed pressed together.<br> 9 Lord of Bay Steeds, thou broughtest from the ant-hill the unwedded damsel's son whom ants were eating.<br> The blind saw clearly, as he grasped the serpent, rose, brake the jar: his joints again united.<br> 10 To the wise man, O Sage and Sovran Ruler, the man who knoweth all thine ancient exploits.<br> Hath told these deeds of might as thou hast wrought them, great acts, spontaneous, and to man's advantage.<br> 11 Now, Indra! lauded, glorified with praises, let powers swell high, like rivers, for the singer.<br> For thee a new hymn, Lord of Bays! is fashioned. May we, car-borne, through song be victors ever.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04020.htm\">Next: HYMN XX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04019.html",
  "api": "json/hymns/04019.json",
  "data": {
    "title": "HYMN XIX. Indra.",
    "describe": "THEE, verily, O Thunder-wielding Indra, all the Devas here, the Helpers swift to listen, and both the worlds elected, thee the Mighty, High, waxen strong, alone to slaughter V&#7771;",
    "feecting": "p:THEE, verily, O Thunder-wielding Indra, all the Devas here, the Helpers swift to listen, and both the worlds elected, thee the Mighty, High, waxen strong, alone to slaughter V&#7771;tra.\np:The Devas, as worn witheld, relaxed their efforts: thou, Indra, born of truth, wast Sovran Ruler.\np: Thou slewest Ahi who besieged the waters, and duggest out their all-supporting channels.\r\np:The insatiate one, extended, hard to waken, who slumbered in perpetual sleep, O Indra,&#151; The Dragon stretched against the seven prone rivers, where no joint was, thou rentest with thy thunder.\np:Indra with might shook Earth and her foundation as the wind stirs the water with its fury. Striving, with strength he burst the firm asunder, and tore away the summits of the mountains.\np:They ran to thee as mothers to their offspring: the clouds, like chariots, hastened forth together. Thou didst refresh the streams and force the billows: thou, Indra, settest free obstructed rivers.\np:Thou for the sake of Vayya and Turv&#299;ti didst stay the great stream, flowing, all-sustaining: Yea, at their prayer didst check the rushing river and make the floods easy to cross, O Indra.\np:He let the young Maids skilled in Law, unwedded, like fountains, bubbling, flow forth streaming onward. He inundated thirsty plains and deserts, and milked the dry Cows of the mighty master.\np:Through many a morn and many a lovely autumn, having slain V&#7771;tra, he set free the rivers. Indra hath set at liberty to wander on Earth the streams encompassed pressed together.\np:Lord of Bay Steeds, thou broughtest from the ant-hill the unwedded damsel's son whom ants were eating. The blind saw clearly, as he grasped the serpent, rose, brake the jar: his joints again united.\np:To the wise man, O Sage and Sovran Ruler, the man who knoweth all thine ancient exploits. Hath told these deeds of might as thou hast wrought them, great acts, spontaneous, and to man's advantage.\np:Now, Indra! lauded, glorified with praises, let powers swell high, like rivers, for the singer. For thee a new hymn, Lord of Bays! is fashioned. May we, car-borne, through song be victors ever.",
    "next": "04020",
    "previous": "04018",
    "book": "04"
  },
  "created": 1638554678395,
  "updated": 1638646519136
}