{
  "key": "04014",
  "title": "RigVeda Hymn 04014",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XIV. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04014.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04013.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04015.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XIV. Agni.</h3>  \n<p>1. THE God hath looked, even Agni J&#257;tavedas, to meet the Dawns refulgent in their glories.<br> Come on your chariot, ye who travel widely, come to this sacrifice of ours, N&#257;satyas.<br> 2 Producing light for all the world of creatures, God Savitar hath raised aloft his banner.<br> Making his presence known by sunbeams, S&#363;rya hath filled the firmament and earth and heaven.<br> 3 Red Dawn is come, riding with brightness onward, distinguished by her beams, gay-hued and mighty.<br> Dawn on her nobly-harnessed car, the Goddess, awaking men to happiness, approacheth.<br> 4 May those most powerful steeds and chariot bring you, O A&#347;vins, hither at the break of morning.<br> Here for your draught of meath are Soma juices: at this our sacrifice rejoice, ye Mighty.<br> 5 How is it that, unbound and unsupported, he falleth not although directed downward?<br> By what self-power moves he? Who hath seen it? He guards the vault of heaven, a close-set pillar?</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04015.htm\">Next: HYMN XV. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/04014.html",
  "api": "hymns/04014json",
  "data": {
    "title": "HYMN XIV. Agni.",
    "describe": "THE God hath looked, even Agni Jātavedas, to meet the Dawns refulgent in their glories.",
    "feecting": "p:THE God hath looked, even Agni Jātavedas, to meet the Dawns refulgent in their glories.\np: Come on your chariot, ye who travel widely, come to this offering of ours, Nāsatyas.\r\np:Producing light for all the world of creatures, God Indra hath raised aloft his banner. Making his presence known by sunbeams, Sūrya hath filled the Firmament and Earth and Heaven.\np:Red Dawn is come, riding with brightness onward, distinguished by her beams, gay-hued and mighty. Dawn on her nobly-harnessed cardess, awaking men to happiness, approacheth.\np:May those most powerful steeds and chariot bring you, O Aśvins, hither at the break of morning. Here for your draught of meath are Soma juices: at this our offering rejoice, ye Mighty.\np:How is it that, unbound and unsupported, he falleth not although directed downward? By what self-power moves he? Who hath seen it? He guards the vault of Heaven, a close-set pillar?",
    "next": "04015",
    "previous": "04013",
    "book": "04"
  },
  "created": 1638554652059
}