{
  "key": "04026",
  "title": "RigVeda Hymn 04026",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XXVI. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04026.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04025.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04027.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXVI. Indra.</h3>  \n<p>1. I WAS aforetime Manu, I was S&#363;rya: I am the sage Kak&#7779;&#299;v&#257;n, holy singer.<br> Kutsa the son of &#256;rjuni I master. I am the sapient U&#347;an&#257; behold me.<br> 2 I have bestowed the earth upon the &#256;rya, and rain upon the man who brings oblation.<br> I guided forth the loudly-roaring waters, and the Gods moved according to my pleasure.<br> 3 In the wild joy of Soma I demolished &#346;ambara's forts, ninety-and-nine, together;<br> And, utterly, the hundredth habitation, when helping Divod&#257;sa Atithigva.<br> 4 Before all birds be ranked this Bird, O Maruts; supreme of falcons be this fleet-winged Falcon,<br> Because, strong- pinioned, with no car to bear him, he brought to Manu the Godloved oblation.<br> 5 When the Bird brought it, hence in rapid motion sent on the wide path fleet as thought he hurried.<br> Swift he returned with sweetness of the Soma, and hence the Falcon hath acquired his glory.<br> 6 Bearing the stalk, the Falcon speeding onward, Bird bringing from afar the draught that gladdens,<br> Friend of the Gods, brought, grasping fast, the Soma which be bad taken from yon loftiest heaven.<br> 7 The Falcon took and brought the Soma, bearing thousand libations with him, yea, ten thousand.<br> The Bold One left Malignities behind him, wise, in wild joy of Soma, left the foolish.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04027.htm\">Next: HYMN XXVII. The Falcon.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04026.html",
  "api": "json/hymns/04026.json",
  "data": {
    "key": "04026",
    "title": "HYMN XXVI. Indra.",
    "describe": "I WAS aforetime Manu, I was Sūrya: I am the sage Kakṣīvān, holy singer.",
    "feecting": "p:I WAS aforetime Manu, I was Sūrya: I am the sage Kakṣīvān, holy singer.\np: Kutsa the son of Ārjuni I master. I am the sapient Uśanā behold me.\r\np:I have bestowed the Earth upon the Ārya, and rain upon the man who brings oblation. I guided forth the loudly-roaring waters, and the Devas moved according to my pleasure.\np:In the wild joy of Soma I demolished Śambara's forts, ninety-and-nine, together; And, utterly, the hundredth habitation, when helping Divodāsa Atithigva.\np:Before all birds be ranked this Bird, O Devas; supreme of falcons be this fleet-winged Falcon, because, strong- pinioned, with no car to bear him, he brought to Manu the Godloved oblation.\np:When the Bird brought it, hence in rapid motion sent on the wide path fleet as thought he hurried. Swift he returned with sweetness of the Soma, and hence the Falcon hath acquired his glory.\np:Bearing the stalk, the Falcon speeding onward, Bird bringing from afar the draught that gladdens, Friend of the Devas, brought, grasping fast, the Soma which be bad taken from yon loftiest Heaven.\np:The Falcon took and brought the Soma, bearing thousand libations with him, yea, ten thousand. The Bold One left Malignities behind him, wise, in wild joy of Soma, left the foolish.",
    "meta": {
      "next": "04027",
      "previous": "04025",
      "book": "04",
      "original": "https://sacred-texts.com/hin/rigveda/rv04026.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv04026.htm"
    },
    "deities": [
      {
        "name": "O Devas",
        "hymns": [
          {
            "key": "04026",
            "title": "HYMN XXVI. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638554715212,
  "updated": 1639023784357
}