{
  "key": "04029",
  "title": "RigVeda Hymn 04029",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XXIX. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04029.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04028.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04030.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXIX. Indra.</h3>  \n<p>1. COME, lauded, unto us with powers and succours, O Indra, with thy Tawny Steeds; exulting,<br> Past even the foeman's manifold libations, glorified with our hymns, true Wealth-bestower.<br> 2 Man's Friend, to this our sacrifice he cometh marking how he is called by Soma-pressers.<br> Fearless, and conscious that his Steeds are noble, he joyeth with the Soma-pouring heroes.<br> 3 Make his cars hear, that he may show his vigour and may be joyful in the way he loveth.<br> May mighty Indra pouring forth in bounty bestow on us good roads and perfect safety;<br> 4 He who with succour comes to his implorer, the singer here who with his song invites him;<br> He who himself sets to the pole swift Coursers, he who hath hundreds, thousands, Thunder-wielder.<br> 5 O Indra Maghavan, by thee protected may we be thine, princes and priests and singers,<br> Sharing the riches sent from lofty heaven which yields much food, and all desire its bounty.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04030.htm\">Next: HYMN XXX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04029.html",
  "api": "json/hymns/04029.json",
  "data": {
    "title": "HYMN XXIX. Indra.",
    "describe": "COME, lauded, unto us with powers and succours, O Indra, with thy Tawny Steeds;",
    "feecting": "p:COME, lauded, unto us with powers and succours, O Indra, with thy Tawny Steeds; exulting, Past even the foeman's manifold libations, glorified with our hymns, true Wealth-bestower.\np:Man's Friend, to this our offering he cometh marking how he is called by Soma-pressers.\np: Fearless, and conscious that his Steeds are noble, he joyeth with the Soma-pouring heroes.\r\np:Make his cars hear, that h. May show his vigour an. May be joyful in the way he loveth. May mighty Indra pouring forth in bounty bestow on us good roads and perfect safety;\np:He who with succour comes to his implorer, the singer here who with his song invites him; He who himself sets to the pole swift Coursers, he who hath hundreds, thousands, Thunder-wielder.\np:O Indra Indra, by thee protecte. May we be thine, princes and monks and singers, Sharing the riches sent from lofty Heaven which yields much food, and all desire its bounty.",
    "next": "04030",
    "previous": "04028",
    "book": "04"
  },
  "created": 1638554731001,
  "updated": 1638791591525
}