{
  "key": "04032",
  "title": "RigVeda Hymn 04032",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XXXII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04032.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04031.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04033.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXII. Indra.</h3>  \n<p>1. O THOU who slewest V&#7771;tra, come, O Indra, hither to our side,<br> Mighty One with thy mighty aids.<br> 2 Swift and impetuous art thou, wondrous amid the well-dressed folk:<br> Thou doest marvels for our help.<br> 3 Even with the weak thou smitest down him<br> who is stronger, with thy strength<br> The mighty, with the Friends thou hast.<br> 4 O Indra, we are close to thee; to thee we sing aloud our songs:<br> Help and defend us, even us.<br> 5 As such, O Caster of the Stone, come with thy succours wonderful,<br> Blameless, and irresistible.<br> 6 May we be friends of one like thee, O Indra, with the wealth of kine,<br> Comrades for lively energy.<br> 7 For thou, O Indra, art alone the Lord of strength that comes from kine<br> So grant thou us abundant food.<br> 8 They turn thee not another way, when, lauded, Lover of the Song,<br> Thou wilt give wealth to those who praise.<br> 9 The Gotamas have sung their song of praise to thee that thou mayst give,<br> Indra, for lively energy.<br> 10 We will declare thy hero deeds, what D&#257;sa forts thou brakest down,<br> Attacking them in rapturous joy.<br> 11 The sages sing those manly deeds which, Indra, Lover of the Song,<br> Thou wroughtest when the Soma flowed.<br> 12 Indra, the Gotamas who bring thee praises have grown strong by thee.<br> Give them renown with hero sons.<br> 13 For, Indra, verily thou art the general treasure even of all .<br> Thee, therefore, do we invocate.<br> 14 Excellent Indra, turn to us: glad thee among us with the juice<br> Of Somas, Soma-drinker thou.<br> 15 May praise from us who think Qn thee, O Indra, bring thee near to us.<br> Turn thy two Bay Steeds hitherward.<br> 16 Eat of our sacrificial cake: rejoice thee in the songs we sing.<br> Even as a lover in his bride.<br> 17 To India for a thousand steeds well-trained and fleet of foot we pray,<br> And hundred jars of Soma juice.<br> 18 We make a hundred of thy kine, yea, and a thousand, hasten nigh:<br> So let thy bounty come to us.<br> 19 We have obtained, a gift from thee, ten water-ewers wrought of gold:<br> Thou, V&#7771;tra-slayer, givest much.<br> 20 A bounteous Giver, give us much, bring much and not a trifling gift:<br> Much, Indra, wilt thou fain bestow.<br> 21 O V&#7771;tra-slayer, thou art famed in many a place as bountiful<br> Hero, thy bounty let us share.<br> 22 I praise thy pair of Tawny Steeds, wise Son of him who giveth kine<br> Terrify not the cows with these.<br> 23 Like two slight images of girls, unrobed, upon a new-wrought post,<br> So shine the Bay Steeds in their course.<br> 24 For me the Bays are ready when I start, or start not, with the dawn, Innocuous in the ways they take.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04033.htm\">Next: HYMN XXXIII. &#7770;bhus.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04032.html",
  "api": "json/hymns/04032.json",
  "data": {
    "key": "04032",
    "title": "HYMN XXXII. Indra.",
    "describe": "O THOU who slewest Vṛtra, come, O Indra, hither to our side, Mighty One with thy mighty aids.",
    "feecting": "p:O THOU who slewest Vṛtra, come, O Indra, hither to our side, Mighty One with thy mighty aids.\np:Swift and impetuous art thou, wondrous amid the well-dressed folk: Thou doest marvels for our help.\np:Even with the weak thou smitest down him who is stronger, with thy strength The mighty, with the Friends thou hast.\np:O Indra, we are close to thee; to thee we sing aloud our songs: Help and defend us, even us.\np:As such, O Indra, come with thy assists wonderful, Blameless, and irresistible.\np:May we be friends of one like thee, O Indra, with the wealth of kine, Comrades for lively energy.\np:For thou, O Indra, art alone the Lord of strength that comes from kine So grant thou us abundant food.\np:They turn thee not another way, when, lauded, Lover of the Song, Thou wilt give wealth to those who praise.\np:The Gotamas have sung their song of praise to thee that tho. Mayst give, Indra, for lively energy.\np:We will declare thy hero deeds, what Dāsa forts thou brakest down, Attacking them in rapturous joy.\np:The sages sing those manly deeds which, Indra, Lover of the Song, Thou wroughtest when the Soma flowed.\np:Indra, the Gotamas who bring thee praises have grown strong by thee.\np: Give them renown with hero sons.\r\np:For, Indra, verily thou art the general treasure even of all . Thee, therefore, do we invocate.\np:Excellent Indra, turn to us: glad thee among us with the juice Of Somas, Soma-drinker thou.\np:May praise from us who think Qn thee, O Indra, bring thee near to us. Turn thy two Bay Steeds hitherward.\np:Eat of our sacrificial cake: rejoice thee in the songs we sing. Even as a lover in his bride.\np:To India for a thousand steeds well-trained and fleet of foot we meditate, and hundred jars of Soma juice.\np:We make a hundred of thy kine, yea, and a thousand, hasten nigh: So let thy bounty come to us.\np:We have obtained, a gift from thee, ten water-ewers wrought of gold: Thou, Vṛtra-slayer, givest much.\np:A bounteous Giver, give us much, bring much and not a trifling gift: Much, Indra, wilt thou fain bestow.\np:O Indra, thou art famed in many a place as bountiful Hero, thy bounty let us share.\np:I praise thy pair of Tawny Steeds, wise Son of him who giveth kine Terrify not the cows with these.\np:Like two slight images of girls, unrobed, upon a new-wrought post, So shine the Bay Steeds in their course.\np:For me the Bays are ready when I start, or start not, with the dawn, innocuous in the ways they take.",
    "meta": {
      "next": "04033",
      "previous": "04031",
      "book": "04",
      "original": "https://sacred-texts.com/hin/rigveda/rv04032.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv04032.htm"
    },
    "deities": [
      {
        "name": "O THOU",
        "hymns": [
          {
            "key": "04032",
            "title": "HYMN XXXII. Indra."
          }
        ]
      },
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "04032",
            "title": "HYMN XXXII. Indra."
          },
          {
            "key": "04032",
            "title": "HYMN XXXII. Indra."
          },
          {
            "key": "04032",
            "title": "HYMN XXXII. Indra."
          },
          {
            "key": "04032",
            "title": "HYMN XXXII. Indra."
          },
          {
            "key": "04032",
            "title": "HYMN XXXII. Indra."
          },
          {
            "key": "04032",
            "title": "HYMN XXXII. Indra."
          },
          {
            "key": "04032",
            "title": "HYMN XXXII. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638554746797,
  "updated": 1667442752626
}