{
  "key": "04037",
  "title": "RigVeda Hymn 04037",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XXXVII. &#7770;bhus.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04037.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04036.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04038.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXVII. &#7770;bhus.</h3>  \n<p>1. COME to our sacrifice, V&#257;jas, &#7770;bhuk&#7779;ans, Gods, by the paths which Gods are wont to travel,<br> As ye, gay Gods, accept in splendid weather the sacrifice among these folk of Manus.<br> 2 May these rites please you in your heart and spirit; may the drops clothed in oil this day approach you.<br> May the abundant juices bear you onward to power and strength, and, when imbibed, delight you.<br> 3 Your threefold going near is God-appointed, so praise is given you, V&#257;jas and &#7770;bhuk&#7779;ans.<br> So, Manus-like, mid younger folk I offer, to you who are aloft in heaven, the Soma.<br> 4 Strong, with fair chains of gold and jaws of iron, ye have a splendid car and well-fed horses.<br> Ye Sons of Strength, ye progeny of Indra, to you the best is offered to delight you.<br> 5 &#7770;bhuk&#7779;ans! him, for handy wealth, the mightiest comrade in the fight,<br> Him, Indra's equal, we invoke, most bounteous ever, rich in steeds.<br> 6 The mortal man whom, &#7770;bhus, ye and Indra favour with your help,<br> Must be successful, by his thoughts, at sacrifice and with the steed.<br> 7 O V&#257;jas and &#7770;bhuk&#7779;ans, free for us the paths to sacrifice,<br> Ye Princes, lauded, that we may press forward to each point of heaven.<br> 8 O V&#257;jas and &#7770;bhuk&#7779;ans, ye N&#257;satyas, Indra, bless this wealth,<br> And, before other men's, the steed, that ample riches may be won.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04038.htm\">Next: HYMN XXXVIII. Dadhikris.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04037.html",
  "api": "json/hymns/04037.json",
  "data": {
    "title": "HYMN XXXVII. &#7770;bhus.",
    "describe": "COME to our offering, V&#257;",
    "feecting": "p:COME to our offering, V&#257;jas, &#7770;bhuk&#7779;ans, Devas, by the paths which Devas are wont to travel, as ye, gay Devas, accept in splendid weather the offering among these folk of Manus.\np:May these rites please you in your heart and spirit. May the drops clothed in oil this day approach you.\np: May the abundant juices bear you onward to power and strength, and, when imbibed, delight you.\r\np:Your threefold going near is God-appointed, so praise is given you, V&#257;jas and &#7770;bhuk&#7779;ans. So, Manus-like, mid younger folk I offer, to you who are aloft in Heaven, the Soma.\np:Strong, with fair chains of gold and jaws of iron, ye have a splendid car and well-fed horses. Ye Sons of Strength, ye progeny of Indra, to you the best is offered to delight you.\np:&#7770;bhuk&#7779;ans! him, for handy wealth, the mightiest comrade in the fight, him, Indra's equal, we invoke, most bounteous ever, rich in steeds.\np:The mortal man whom, &#7770;bhus, ye and Indra favour with your help, Must be successful, by his thoughts, at offering and with the steed.\np:O V&#257;jas and &#7770;bhuk&#7779;ans, free for us the paths to offering, Ye Princes, lauded, that we may press forward to each point of Heaven.\np:O V&#257;jas and &#7770;bhuk&#7779;ans, ye N&#257;satyas, Indra, bless this wealth, and, before other men's, the steed, that ample riche. May be won.",
    "next": "04038",
    "previous": "04036",
    "book": "04"
  },
  "created": 1638554773083,
  "updated": 1638791780580
}