{
  "key": "04033",
  "title": "RigVeda Hymn 04033",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XXXIII. &#7770;bhus.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04033.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04032.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04034.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXIII. &#7770;bhus.</h3>  \n<p>1. I SEND my voice as herald to the &#7770;bhus; I crave the white cow for the overspreading.<br> Wind-sped, the Skillful Ones in rapid motion have in an instant compassed round the heaven.<br> 2 What time the Rbus had with care and marvels done proper service to assist their Parents,<br> They won the friendship of the Gods; the Sages carried away the fruit of their devotion.<br> 3 May they who made their Parents, who were lying like posts that moulder, young again for ever,&#151;<br> May V&#257;ja, Vibhvan, &#7770;bhu, joined with Indra , protect our sacrifice, the Soma-lovers.<br> 4 As for a year the &#7770;bhus kept the Milch-cow, throughout a year fashioned and formed her body,<br> And through a year's space still sustained her brightness, through these their labours they were made immortal.<br> 5 Two beakers let us make,&#151;thus said the eldest. Let us make three,&#151;this was the younger's sentence.<br> Four beakers let us make,&#151;thus spoke the youngest. Tva&#7779;&#7789;ar approved this rede of yours, O &#7770;bhus.<br> 6 The men spake truth and even so they acted: this Godlike way of theirs the &#7770;bhus followed.<br> And Tva&#7779;&#7789;ar, when he looked on the four beakers resplendent as the day, was moved with envy.<br> 7 When for twelve days the &#7770;bhus joyed reposing as guests of him who never may be hidden,<br> They made fair fertile fields, they brought the rivers. Plants spread o&#146;er deserts, waters filled the hollows.<br> 8 May they who formed the swift car, bearing Heroes, and the Cow omniform and all-impelling,<br> Even may they form wealth for us,&#151;the &#7770;bhus, dexterous-handed, deft in work and gracious.<br> 9 So in their work the Gods had satisfaction, pondering it with thought and mental insight.<br> The Gods&#146; expert artificer was V&#257;ja, Indra's &#7770;bhuk&#7779;an, Varu&#7751;a's was Vibhvan.<br> 10 They who made glad with sacrifice and praises, wrought the two Bays, his docile Steeds, for Indra,&#151;<br> &#7770;bhus, as those who wish a friend to prosper, bestow upon us gear and growth of riches.<br> 11 This day have they set gladdening drink before you. Not without toil are Gods inclined to friendship.<br> Therefore do ye who are so great, O &#7770;bhus, vouchsafe us treasures at this third libation.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04034.htm\">Next: HYMN XXXIV. &#7770;bhus.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04033.html",
  "api": "json/hymns/04033.json",
  "data": {
    "key": "04033",
    "title": "HYMN XXXIII. Ṛbhus.",
    "describe": "I SEND my voice as herald to the Ṛbhus;",
    "feecting": "p:I SEND my voice as herald to the Ṛbhus; I crave the white cow for the overspreading.\np: Wind-sped, the Skillful Ones in rapid motion have in an instant compassed round the Heaven.\r\np:What time the Rbus had with care and marvels done proper service to assist their Parents, they won the friendship of the Devas; the Sages carried away the fruit of their devotion.\np:May they who made their Parents, who were lying like posts that moulder, young again forever. May Vāja, Vibhvan, Ṛbhu, joined with Indra , protect our offering, the Soma-lovers.\np:As for a year the Ṛbhus kept the Milch-cow, throughout a year fashioned and formed her body, and through a year's space still sustained her brightness, through these their labours they were made immortal.\np:Two beakers let us make.thus said the eldest. Let us make three.this was the younger's sentence. Four beakers let us make.thus spoke the youngest. Tvaṣṭar approved this rede of yours, O Ṛbhus.\np:The men spake truth and even so they acted: this Devalike way of theirs the Ṛbhus followed. And Tvaṣṭar, when he looked on the four beakers resplendent as the day, was moved with envy.\np:When for twelve days the Ṛbhus joyed reposing as guests of him who neve. May be hidden, they made fair fertile fields, they brought the rivers. Plants spread o’er deserts, waters filled the hollows.\np:May they who formed the swift car, bearing Heroes, and the Cow omniform and all-impelling, Eve. May they form wealth for us.the Ṛbhus, dexterous-handed, deft in work and gracious.\np:So in their work the Devas had satisfaction, pondering it with thought and mental insight. The Devas’ expert artificer was Vāja, Indra's Ṛbhukṣan, Indra's was Vibhvan.\np:They who made glad with offering and praises, wrought the two Bays, his docile Steeds, for Indra. Ṛbhus, as those who wish a friend to prosper, bestow upon us gear and growth of riches.\np:This day have they set gladdening drink before you. Not without toil are Devas inclined to friendship. Therefore do ye who are so great, O Ṛbhus, vouchsafe us treasures at this third libation.",
    "meta": {
      "next": "04034",
      "previous": "04032",
      "book": "04",
      "original": "https://sacred-texts.com/hin/rigveda/rv04033.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv04033.htm"
    },
    "deities": [
      {
        "name": "O Ṛbhus",
        "hymns": [
          {
            "key": "04033",
            "title": "HYMN XXXIII. Ṛbhus."
          },
          {
            "key": "04033",
            "title": "HYMN XXXIII. Ṛbhus."
          }
        ]
      }
    ]
  },
  "created": 1638554752048,
  "updated": 1667440427135
}