{
  "key": "04042",
  "title": "RigVeda Hymn 04042",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XLIL Indra-Varu&#7751;a.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04042.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04041.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04043.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XLIL Indra-Varu&#7751;a.</h3>  \n<p>1. I AM the royal Ruler, mine is empire, as mine who sway all life are all Immortals.<br> Varu&#7751;a's will the Gods obey and follow. I am the King of men's most lofty cover.<br> 2 I am King Varu&#7751;a. To me were given these first existing high celestial powers.<br> Varu&#7751;a's will the Gods obey and follow. I am the King of men's most lofty cover.<br> 3 I Varu&#7751;a am Indra: in their greatness, these the two wide deep fairly-fashioned regions,<br> These the two world-halves have I, even as Tva&#7779;&#7789;ar knowing all beings, joined and held together.<br> 4 I made to flow the moisture-shedding waters, and set the heaven firm in the scat of Order.<br> By Law the Son of Aditi, Law Observer, hath spread abroad the world in threefold measure.<br> 5 Heroes with noble horses, fain for battle, selected warriors, call on me in combat.<br> I Indra Maghavan, excite the conflict; I stir the dust, Lord of surpassing vigour.<br> 6 All this I did. The Gods&#146; own conquering power never impedeth me whom none opposeth.<br> When lauds and Soma juice have made me joyful, both the unbounded regions are affrighted.<br> 7 All beings know these deeds of thine thou tellest this unto Varu&#7751;a, thou great Disposer!<br> Thou art renowned as having slain the V&#7771;tras. Thou madest flow the floods that were obstructed.<br> 8 Our fathers then were these, the Seven his, what time the son of Durgaha was captive.<br> For her they gained by sacrifice Trasadasyu, a demi-god, like Indra, conquering foemen.<br> 9 The spouse of Purukutsa gave oblations to you, O Indra-Varu&#7751;a, with homage.<br> Then unto her ye gave King Trasadasyu, the demi-god, the slayer of the foeman.<br> 10 May we, possessing much, delight in riches, Gods in oblations and the kine in pasture;<br> And that Milch-cow who shrinks not from the milking, O Indra-Varu&#7751;a, give to us daily.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04043.htm\">Next: HYMN XLIII. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04042.html",
  "api": "json/hymns/04042.json",
  "data": {
    "title": "HYMN XLIL Indra-Varu&#7751;a.",
    "describe": "I AM the royal Ruler, mine is empire, as mine who sway all life are all Immortals.",
    "feecting": "p:I AM the royal Ruler, mine is empire, as mine who sway all life are all Immortals.\np: Varu&#7751;a's will the Devas obey and follow. I am the King of men's most lofty cover.\r\np:I am King Varu&#7751;a. To me were given these first existing high celestial powers. Varu&#7751;a's will the Devas obey and follow. I am the King of men's most lofty cover.\np:I Varu&#7751;a am Indra: in their greatness, these the two wide deep fairly-fashioned regions, these the two world-halves have I, even as Tva&#7779;&#7789;ar knowing all beings, joined and held together.\np:I made to flow the moisture-shedding waters, and set the Heaven firm in the scat of Order. By Law the Son of Aditi, Law Observer, hath spread abroad the world in threefold measure.\np:Heroes with noble horses, fain for battle, selected warriors, call on me in combat. I Indra Indra, excite the conflict; I stir the dust, Lord of surpassing vigour.\np:All this I did. The Devas&#146; own conquering power never impedeth me whom none opposeth. When lauds and Soma juice have made me joyful, both the unbounded regions are affrighted.\np:All beings know these deeds of thine thou tellest this unto Varu&#7751;a, thou great Disposer! Thou art renowned as having slain the V&#7771;tras. Thou madest flow the floods that were obstructed.\np:Our fathers then were these, the Seven his, what time the son of Durgaha was captive. For her they gained by offering Trasadasyu, a demi-god, like Indra, conquering foemen.\np:The spouse of Purukutsa gave oblations to you, O Indra-Varu&#7751;a, with homage. Then unto her ye gave King Trasadasyu, the demi-god, the slayer of the foeman.\np:May we, possessing much, delight in riches, Devas in oblations and the kine in pasture; And that Milch-cow who shrinks not from the milking, O Indra-Varu&#7751;a, give to us daily.",
    "next": "04043",
    "previous": "04041",
    "book": "04"
  },
  "created": 1638554799468,
  "updated": 1638646519162
}