{
  "key": "04043",
  "title": "RigVeda Hymn 04043",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XLIII. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04043.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04042.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04044.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XLIII. A&#347;vins.</h3>  \n<p>1. WHO will hear, who of those who merit worship, which of all Gods take pleasure in our homage?<br> On whose heart shall we lay this laud celestial, rich with fair offerings, dearest to Immortals?<br> 2 Who will be gracious? Who will come most quickly of all the Gods? Who will<br> bring bliss most largely?<br> What car do they call swift with rapid coursers? That which the Daughter of the Sun elected.<br> 3 So many days do ye come swiftly hither, as Indra to give help in stress of battle.<br> Descended from the sky, divine, strong-pinioned, by which of all your powers are ye most mighty?<br> 4 What is the prayer that we should bring you, A&#347;vins, whereby ye come to us when invocated?<br> Whether of you confronts e&#146;en great betrayal? Lovers of sweetness, Dasras, help and save us.<br> 5 In the wide space your chariot reacheth heaven, what time it turneth hither from the ocean.<br> Sweets from your sweet shall drop, lovers of sweetness! These have they dressed for you as dainty viands.<br> 6 Let Sindhu with his wave bedew your horses: in fiery glow have the red birds come hither.<br> Observed of all was that your rapid going, whereby ye were the Lords of S&#363;rya's Daughter.<br> 7 Whene&#146;er I gratified you here together, your grace was given us, O ye rich in booty.<br> Protect, ye Twain, the singer of your praises: to you, N&#257;satyas, is my wish directed.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04044.htm\">Next: HYMN XLIV. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/04043.html",
  "api": "hymns/04043json",
  "data": {
    "title": "HYMN XLIII. Aśvins.",
    "describe": "WHO will hear, who of those who merit worship, which of all Devas take pleasure in our homage?",
    "feecting": "p:WHO will hear, who of those who merit worship, which of all Devas take pleasure in our homage? On whose heart shall we lay this laud celestial, rich with fair offerings, dearest to Immortals?\np:Who will be gracious? Who will come most quickly of all the Devas? Who will bring bliss most largely? What car do they call swift with rapid coursers? That which the Daughter of the Sun elected.\np:So many days do ye come swiftly hither, as Indra to give help in stress of battle.\np: Descended from the sky, divine, strong-pinioned, by which of all your powers are ye most mighty?\r\np:What is the prayer that we should bring you, Aśvins, whereby ye come to us when invocated? Whether of you confronts e’en great betrayal? Lovers of sweetness, Dasras, help and save us.\np:In the wide space your chariot reacheth Heaven, what time it turneth hither from the ocean. Sweets from your sweet shall drop, lovers of sweetness! These have they dressed for you as dainty offerings.\np:Let Sindhu with his wave bedew your horses: in fiery glow have the red birds come hither. Observed of all was that your rapid going, whereby ye were the Lords of Sūrya's Daughter.\np:Whene’er I gratified you here together, your grace was given us, O ye rich in booty. Protect, ye Twain, the singer of your praises: to you, Nāsatyas, is my wish directed.",
    "next": "04044",
    "previous": "04042",
    "book": "04"
  },
  "created": 1638554804742
}