{
  "key": "04040",
  "title": "RigVeda Hymn 04040",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN XL. Dadhikr&#257;van.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04040.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04039.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04041.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XL. Dadhikr&#257;van.</h3>  \n<p>1. LET us recite the praise of Dadhikr&#257;van: may all the Mornings move me to exertion;<br> Praise of the Lord of Waters, Dawn, and Agni, B&#7771;haspati Son of A&#7749;giras, and S&#363;rya.<br> 2 Brave, seeking war and booty, dwelling with the good and with the swift, may he hasten the food of Dawn.<br> May he the true, the fleet, the lover of the course, the bird-like Dadhikr&#257;van, bring food, strength, and light.<br> 3 His pinion, rapid runner, fans him m his way, as of a bird that hastens onward to its aim,<br> And, as it were a falcon's gliding through the air, strikes Dadhikr&#257;van's side as he speeds on with might.<br> 4 Bound by the neck and by the flanks and by the mouth, the vigorous Courser lends new swiftness to his speed.<br> Drawing himself together, as his strength allows, Dadhikr&#257;s springs along the windings of the paths.<br> 5 The Ha&#7745;sa homed in light, the Vasu in mid-air, the priest beside the altar, in the house the guest,<br> Dweller in noblest place, mid men, in truth, in sky, born of flood, kine, truth, mountain, he is holy Law.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04041.htm\">Next: HYMN XLI. Indra-Varu&#7751;a.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04040.html",
  "api": "json/hymns/04040.json",
  "data": {
    "key": "04040",
    "title": "HYMN XL. Dadhikrāvan.",
    "describe": "LET us recite the praise of Dadhikrāvan.",
    "feecting": "p:LET us recite the praise of Dadhikrāvan. May all the Mornings move me to exertion; Praise of the Lord of Waters, Dawn, and Agni, Soma Son of Aṅgiras, and Sūrya.\np:Brave, seeking war and booty, dwelling with the good and with the swift. May he hasten the food of Dawn.\np: May he the true, the fleet, the lover of the course, the bird-like Dadhikrāvan, bring food, strength, and light.\r\np:His pinion, rapid runner, fans him m his way, as of a bird that hastens onward to its aim, and, as it were a falcon's gliding through the air, strikes Dadhikrāvan's side as he speeds on with might.\np:Bound by the neck and by the flanks and by the mouth, the vigorous Courser lends new swiftness to his speed. Drawing himself together, as his strength allows, Dadhikrās springs along the windings of the paths.\np:The Haṁsa homed in light, the Vasu in mid-air, the Monk beside the altar, in the house the guest, Dweller in noblest place, mid men, in truth, in sky, born of flood, kine, truth, mountain, he is holy Law.",
    "meta": {
      "next": "04041",
      "previous": "04039",
      "book": "04",
      "original": "https://sacred-texts.com/hin/rigveda/rv04040.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv04040.htm"
    },
    "deities": []
  },
  "created": 1638554788939,
  "updated": 1667450402995
}