{
  "key": "04055",
  "title": "RigVeda Hymn 04055",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN LV. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04055.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04054.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04056.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LV. Vi&#347;vedevas.</h3>  \n<p>1. WHO of you, Vasus, saveth? who protecteth? O Heaven and Earth and Aditi, preserve us,<br> Varu&#7751;a., Mitra, from the stronger mortal. Gods, which of you at sacrifice giveth comfort?<br> 2 They who with laud extol the ancient statutes, when they shine forth infallible dividers,<br> Have ordered as perpetual Ordainers, and beamed as holy-thoughted Wonder-Workers.<br> 3 The Housewife Goddess, Aditi, and Sindhu, the Goddess Svasti I implore for friendship:<br> And may the unobstructed Night and Morning both, day and night, provide for our protection.<br> 4 Aryaman, Varu&#7751;a have disclosed the pathway, Agni as Lord of Strength the road to welfare.<br> Lauded in manly mode may Indra-Vi&#7779;&#7751;u grant us their powerful defence and shelter.<br> 5 I have besought the favour of the Maruts, of Parvata, of Bhaga God who rescues.<br> From trouble caused by man the Lord preserve us; from woe sent by his friend let Mitra save us.<br> 6 Agree, through these our watery oblations, Goddesses, Heaven and Earth, with Ahibudhnya.<br> As if to win the sea, the Gharma-heaters have opened, as they come anear, the rivers.<br> 7 May Goddess Aditi with Gods defend us, save us the saviour God with care unceasing.<br> We dare not stint the sacred food of Mitra and Varu&#7751;a upon the back of Agni.<br> 8 Agni is Sovran Lord of wealth, Agni of great prosperity:<br> May he bestow these gifts on us.<br> 9 Hither to us, rich pleasant Dawn, bring many things to be desired,<br> Thou who hast ample store of wealth.<br> 10 So then may Bhaga, Savitar, Varu&#7751;a, Mitra, Aryaman, Indra, with bounty come to us.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04056.htm\">Next: HYMN LVI. Heaven and Earth.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04055.html",
  "api": "json/hymns/04055.json",
  "data": {
    "title": "HYMN LV. Vi&#347;vedevas.",
    "describe": "WHO of you, Devas, saveth?",
    "feecting": "p:WHO of you, Devas, saveth? who protecteth? O Heaven and Earth and Aditi, preserve us, Varu&#7751;a., Mitra, from the stronger mortal. Devas, which of you at offering giveth comfort?\np:They who with laud extol the ancient statutes, when they shine forth infallible dividers, have ordered as perpetual Ordainers, and beamed as holy-thoughted Wonder-Workers.\np:The Housewife Goddess, Aditi, and Sindhudess Svasti I implore for friendship: An. May the unobstructed Night and Morning both, day and night, provide for our protection.\np:Aryaman, Varu&#7751;a have disclosed the pathway, Agni as Lord of Strength the road to welfare.\np: Lauded in manly mod. May Indra-Vi&#7779;&#7751;u grant us their powerful defence and shelter.\r\np:I have besought the favour of the Devas, of Parvata, of Bhaga Deva who rescues. From trouble caused by man the Lord preserve us; from woe sent by his friend let Mitra save us.\np:Agree, through these our watery oblations Heaven and Earth, with Ahibudhnya. As if to win the sea, the Gharma-heaters have opened, as they come anear, the rivers.\np:May Goddess Aditi with Devas defend us, save us the saviour God with care unceasing. We dare not stint the sacred food of Mitra and Varu&#7751;a upon the back of Agni.\np:Agni is Sovran Lord of wealth, Agni of great prosperity: May he bestow these gifts on us.\np:Hither to us, rich pleasant Dawn, bring many things to be desired, Thou who hast ample store of wealth.\np:So the, may Bhaga, Indra, Varu&#7751;a, Mitra, Aryaman, Indra, with bounty come to us.",
    "next": "04056",
    "previous": "04054",
    "book": "04"
  },
  "created": 1638554868917,
  "updated": 1638791780595
}