{
  "key": "04057",
  "title": "RigVeda Hymn 04057",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN LVII. Ksetrapati, Etc.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04057.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04056.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04058.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LVII. Ksetrapati, Etc.</h3>  \n<p>1. WE through the Master of the Field, even as through a friend, obtain<br> What nourisheth our kine and steeds. In such may he be good to us.<br> 2 As the cow yieldeth milk, pour for us freely, Lord of the Field, the wave that beareth sweetness,<br> Distilling meath, well-purified like butter, and let the. Lords of holy Law be gracious.<br> 3 Sweet be the plants for us. the heavens, the waters, and full of sweets for us be air's mid-region.<br> May the Field's Lord for us be full of sweetness, and may we follow after him uninjured.<br> 4 Happily work our steers and men, may the plough furrow happily.<br> Happily be the traces bound; happily may he ply the goad.<br> 5 &#346;una and S&#299;ra, welcome ye this laud, and with the milk which ye have made in heaven<br> Bedew ye both this earth of ours.<br> 6 Auspicious S&#299;t&#257;, come thou near: we venerate and worship thee<br> That thou mayst bless and prosper us and bring us fruits abundantly.<br> 7 May Indra press the furrow down, may P&#363;&#7779;an guide its course aright.<br> May she, as rich in milk, be drained for us through each succeeding year.<br> 8 Happily let the shares turn up the plough-land, happily go the ploughers with the oxen.<br> With meath and milk Parjanya make us happy. Grant us prosperity, &#346;una and S&#299;ra.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04058.htm\">Next: HYMN LVIII. Gh&#7771;ta.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04057.html",
  "api": "json/hymns/04057.json",
  "data": {
    "key": "04057",
    "title": "HYMN LVII. Ksetrapati, Etc.",
    "describe": "WE through the Master of the Field, even as through a friend, obtain What nourisheth our kine and steeds.",
    "feecting": "p:WE through the Master of the Field, even as through a friend, obtain What nourisheth our kine and steeds. In suc. May he be good to us.\np:As the cow yieldeth milk, pour for us freely, Lord of the Field, the wave that beareth sweetness, Distilling meath, well-purified like butter, and let the. Lords of holy Law be gracious.\np:Sweet be the plants for us. the heavens, the waters, and full of sweets for us be air's mid-region.\np: May the Field's Lord for us be full of sweetness, an. May we follow after him uninjured.\r\np:Happily work our steers and men. May the plough furrow happily. Happily be the traces bound; happil. May he ply the goad.\np:Śuna and Sīra, welcome ye this laud, and with the milk which ye have made in Heaven Bedew ye both this Earth of ours.\np:Auspicious Sītā, come thou near: we venerate and worship thee That tho. Mayst bless and prosper us and bring us fruits abundantly.\np:May Indra press the furrow down. May Pūṣan guide its course aright. May she, as rich in milk, be drained for us through each succeeding year.\np:Happily let the shares turn up the plough-land, happily go the ploughers with the oxen. With meath and milk Parjanya make us happy. Grant us prosperity, Śuna and Sīra.",
    "meta": {
      "next": "04058",
      "previous": "04056",
      "book": "04",
      "original": "https://sacred-texts.com/hin/rigveda/rv04057.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv04057.htm"
    },
    "deities": []
  },
  "created": 1638554879449,
  "updated": 1667442752680
}