{
  "key": "04050",
  "title": "RigVeda Hymn 04050",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN L. B&#7771;haspati.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04050.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04049.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04051.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN L. B&#7771;haspati.</h3>  \n<p>1. Him who with might hath propped earth's ends, who sitteth in threefold seat, B&#7771;haspati, with thunder,<br> Him of the pleasant tongue have ancient sages, deep-thinking, holy singers, set before them.<br> 2 Wild in their course, in well-marked wise rejoicing were they, B&#7771;haspati, who pressed around us.<br> Preserve B&#7771;haspati, the stall uninjured, this company's raining, ever-moving birthplace.<br> 3 B&#7771;haspati, from thy remotest distance have they sat down who love the law eternal.<br> For thee were dug wells springing from the mountain, which murmuring round about pour streams of sweetness.<br> 4 B&#7771;haspati, when first he had his being from mighty splendour in supremest heaven,<br> Strong, with his sevenfold mouth, with noise of thunder, with his seven rays, blew and dispersed the darkness.<br> 5 With the loud-shouting band who sang his praises, with thunder, he destroyed obstructive Vala.<br> B&#7771;haspati thundering drave forth the cattle, the lowing cows who make oblations ready.<br> 6 Serve we with sacrifices, gifts, and homage even thus the Steer of all the Gods, the Father.<br> B&#7771;haspati, may we be lords of riches, with noble progeny and store of heroes.<br> 7 Surely that King by power and might heroic hath made him lord of all his foes' posses-ions,<br> Who cherishes B&#7771;haspati well-tended, adorns and worships him as foremost sharer.<br> 8 In his own house he dwells in peace and comfort: to him for ever holy food flows richly.<br> To him the people with free will pay homage-the King with whom the Brahman hath precedence.<br> 9 He, unopposed, is master of the riches of his own subjects and of hostile people.<br> The Gods uphold that King with their protection who helps the Brahman when he seeks his favour.<br> 10 Indra, B&#7771;haspati, rainers of treasure, rejoicing at this sacrifice drink the Soma.<br> Let the abundant drops sink deep within you: vouchsafe us riches with full store of heroes.<br> 11 B&#7771;haspati and Indra, make us prosper may this be your benevolence to us-ward.<br> Assist our holy thoughts, wake up our spirit: weaken the hatred of our foe and rivals.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04051.htm\">Next: HYMN LI. Dawn.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04050.html",
  "api": "json/hymns/04050.json",
  "data": {
    "title": "HYMN L. B&#7771;haspati.",
    "describe": "Him who with might hath propped Earth's ends, who sitteth in threefold seat, with thunder, him of the pleasant tongue have ancient sages, deep-thinking, holy singers, set before them.",
    "feecting": "p:Him who with might hath propped Earth's ends, who sitteth in threefold seat, with thunder, him of the pleasant tongue have ancient sages, deep-thinking, holy singers, set before them.\np:Wild in their course, in well-marked wise rejoicing were they, who pressed around us.\np: Preserve B&#7771;haspati, the stall uninjured, this company's raining, ever-moving birthplace.\r\np:B&#7771;haspati, from thy remotest distance have they sat down who love the law eternal. For thee were dug wells springing from the mountain, which murmuring round about pour streams of sweetness.\np:B&#7771;haspati, when first he had his being from mighty splendour in supremest Heaven, Strong, with his sevenfold mouth, with noise of thunder, with his seven rays, blew and dispersed the darkness.\np:With the loud-shouting band who sang his praises, with thunder, he conquered obstructive Vala. B&#7771;haspati thundering drave forth the cattle, the lowing cows who make oblations ready.\np:Serve we with offers, gifts, and homage even thus the Steer of all the Devas, the Father. B&#7771;haspati. May we be lords of riches, with noble progeny and store of heroes.\np:Surely that King by power and might heroic hath made him lord of all his foes' posses-ions, who cherishes B&#7771;haspati well-tended, adorns and worships him as foremost sharer.\np:In his own house he dwells in peace and comfort: to him forever holy food flows richly. To him the people with free will pay homage-the King with whom the Brahman hath precedence.\np:He, unopposed, is master of the riches of his own subjects and of hostile people. The Devas uphold that King with their protection who helps the Brahman when he seeks his favour.\np:Indra, rainers of treasure, rejoicing at this offering drink the Soma. Let the abundant drops sink deep within you: vouchsafe us riches with full store of heroes.\np:B&#7771;haspati and Indra, make us prospe. May this be your benevolence to us-ward. Assist our holy thoughts, wake up our spirit: weaken the hatred of our foe and rivals.",
    "next": "04051",
    "previous": "04049",
    "book": "04"
  },
  "created": 1638554842003,
  "updated": 1638642698382
}