{
  "key": "04054",
  "title": "RigVeda Hymn 04054",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 4: HYMN LIV. Savitar.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv04054.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi04.htm\">Rig-Veda, Book 4 Index</A><BR>\n&nbsp;\n<A HREF=\"rv04053.htm\">Previous</A>&nbsp;\n<A HREF=\"rv04055.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LIV. Savitar.</h3>  \n<p>1. Now must we praise and honour Savitar the God: at this time of the day the men must call to him,<br> Him who distributes wealth to Manu's progeny, that he may grant us here riches most excellent.<br> 2 For thou at first producest for the holy Gods the noblest of all portions, immortality:<br> Thereafter as a gift to men, O Savitar, thou openest existence, life succeeding life.<br> 3 If we, men as we are, have sinned against the Gods through want of thought, in weakness, or through insolence,<br> Absolve us from the guilt and make us free from sin, O Savitar, alike among both Gods and men.<br> 4 None may impede that power of Savitar the God whereby he will maintain the universal world.<br> What the fair-fingered God brings forth on earth's expanse or in the height of heaven, that work of his stands sure.<br> 5 To lofty hills thou sendest those whom Indra leads, and givest fixed abodes with houses unto these.<br> However they may fly and draw themselves apart, still, Savitar, they stand obeying thy behest.<br> 6 May the libations poured to thee thrice daily, day after day, O Savitar, bring us blessing.<br> May Indra, Heaven, Earth, Sindhu with the Waters, Aditi with &#256;dityas, give us shelter.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv04055.htm\">Next: HYMN LV. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/04054.html",
  "api": "json/hymns/04054.json",
  "data": {
    "key": "04054",
    "title": "HYMN LIV. Indra.",
    "describe": "Now must we praise and honour Indra the Deva: at this time of the day the men must call to him, him who distributes wealth to Manu's progeny, that h.",
    "feecting": "p:Now must we praise and honour Indra the Deva: at this time of the day the men must call to him, him who distributes wealth to Manu's progeny, that h. May grant us here riches most excellent.\np:For thou at first producest for the holy Devas the noblest of all portions, immortality: Thereafter as a gift to men, O Indra, thou openest existence, life succeeding life.\np:If we, men as we are, have sinned against the Devas through want of thought, in weakness, or through insolence, Absolve us from the guilt and make us free from sin, O Indra, alike among both Devas and men.\np:Non. May impede that power of Indra the Deva whereby he will maintain the universal world.\np: What the fair-fingered God brings forth on Earth's expanse or in the height of Heaven, that work of his stands sure.\r\np:To lofty hills thou sendest those whom Indra leads, and givest fixed abodes with houses unto these. However the, may fly and draw themselves apart, still, Indra, they stand obeying thy behest.\np:May the libations poured to thee thrice daily, day after day, O Indra, bring us blessing. May Indra. Heaven, Earth, Sindhu with the Waters, Aditi with Ādityas, give us shelter.",
    "meta": {
      "next": "04055",
      "previous": "04053",
      "book": "04",
      "source": "https://sacred-texts.com/hin/rigveda/rv04054.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv04054.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "04054",
            "title": "HYMN LIV. Indra."
          },
          {
            "key": "04054",
            "title": "HYMN LIV. Indra."
          },
          {
            "key": "04054",
            "title": "HYMN LIV. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638554863335,
  "updated": 1638830292203
}