{
  "key": "05006",
  "title": "RigVeda Hymn 05006",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN VI. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05006.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05005.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05007.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN VI. Agni.</h3>  \n<p>1. I VALUE Agni that good Lord, the home to which the kine return:<br> Whom fleet-foot coursers seek as home, and strong enduring steeds as home. Bring food to those who sing thy praise.<br> 2 &#146;Tis Agni whom we laud as good, to whom the milch-kine come in herds,<br> To whom the chargers swift of foot, to whom our well-born princes come. Bring food to those who sing thy praise.<br> 3 Agni the God of all mankind, gives, verily, a steed to man.<br> Agni gives precious gear for wealth, treasure he gives when he is pleased. Bring food to those who sing thy praise.<br> 4 God, Agni, we will kindle thee, rich in thy splendour, fading not,<br> So that this glorious fuel may send forth by day its light for thee. Bring food to those who sing thy praise.<br> 5 To thee the splendid, Lord of flame, bright, wondrous, Prince of men, is brought.<br> Oblation with the holy verse, O Agni, bearer of our gifts.<br> Bring food to those who sing thy praise.<br> 6 These Agnis in the seats of the fire nourish each thing most excellent.<br> They give delight, they spread abroad, they move themselves continually. Bring food to those who sing thy praise.<br> 7 Agni, these brilliant flames of thine wax like strong chargers mightily,<br> Who with the treadings of their hoofs go swiftly to the stalls of kine. Bring food to those who sing thy praise.<br> 8 To us who laud thee, Agni, bring fresh food and safe and happy homes.<br> May we who have sung hymns to thee have thee for envoy in each house. Bring food to those who sing thy praise.<br> 9 Thou, brilliant God, within thy mouth warmest both ladles of the oil.<br> So fill us also, in our hymns, abundantly, O Lord of Strength. Bring food to those who sing thy praise.<br> 10 Thus Agni have we duly served with sacrifices and with hymns.<br> So may he give us what we crave, store of brave sons and fleet-foot steeds. Bring food to those who sing thy praise.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05007.htm\">Next: HYMN VII. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05006.html",
  "api": "json/hymns/05006.json",
  "data": {
    "key": "05006",
    "title": "HYMN VI. Agni.",
    "describe": "I VALUE Agni that good Lord, the home to which the kine return: Whom fleet-foot coursers seek as home, and stron enduring steeds as home.",
    "feecting": "p:I VALUE Agni that good Lord, the home to which the kine return: Whom fleet-foot coursers seek as home, and stron enduring steeds as home. Bring food to those who sing thy praise.\np:’Tis Agni whom we laud as good, to whom the milch-kine come in herds, to whom the chargers swift of foot, to whom our well-born princes come. Bring food to those who sing thy praise.\np:Agni the Deva of all mankind, gives, verily, a steed to man.\np: Agni gives precious gear for wealth, treasure he gives when he is pleased. Bring food to those who sing thy praise.\r\np:Deva, Agni, we will kindle thee, rich in thy splendour, fading not, So that this glorious fue. May send forth by day its light for thee. Bring food to those who sing thy praise.\np:To thee the splendid, Lord of flame, bright, wondrous, Prince of men, is brought. Oblation with the holy verse, O Agni, bearer of our gifts. Bring food to those who sing thy praise.\np:These Agnis in the seats of the fire nourish each thing most excellent. They give delight, they spread abroad, they move themselves continually. Bring food to those who sing thy praise.\np:Agni, these brilliant flames of thine wax like strong chargers mightily, who with the treadings of their hoofs go swiftly to the stalls of kine. Bring food to those who sing thy praise.\np:To us who laud thee, Agni, bring fresh food and safe and happy homes. May we who have sung hymns to thee have thee for envoy in each house. Bring food to those who sing thy praise.\np:Thou, brilliant Deva, within thy mouth warmest both ladles of the oil. So fill us also, in our hymns, abundantly, O Lord of Strength. Bring food to those who sing thy praise.\np:Thus Agni have we duly served with offers and with hymns. May he give us what we crave, store of brave sons and fleet-foot steeds. Bring food to those who sing thy praise.",
    "meta": {
      "next": "05007",
      "previous": "05005",
      "book": "05",
      "original": "https://sacred-texts.com/hin/rigveda/rv05006.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv05006.htm"
    },
    "deities": [
      {
        "name": "O Agni",
        "hymns": [
          {
            "key": "05006",
            "title": "HYMN VI. Agni."
          }
        ]
      },
      {
        "name": "O Lord",
        "hymns": [
          {
            "key": "05006",
            "title": "HYMN VI. Agni."
          }
        ]
      }
    ]
  },
  "created": 1638554916297,
  "updated": 1667442752696
}