{
  "key": "05008",
  "title": "RigVeda Hymn 05008",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN VIII. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05008.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05007.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05009.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN VIII. Agni.</h3>  \n<p>1. O AGNI urged to strength, the men of old who loved the Law enkindled thee,<br> the Ancient, for their aid,<br> Thee very bright, and holy, nourisher of all, most excellent, the Friend and Master of the home.<br> 2 Thee, Agni, men have stablished as their guest of old, as Master of the household, thee, with hair of flame;<br> High-bannered, multiform, distributor of wealth, kind helper, good protector, drier of the floods.<br> 3 The tribes of men praise thee, Agni, who knowest well burnt offerings, the Discerner, lavishest of wealth,<br> Dwelling in secret, Blest One! visible to all, loud-roaring, skilled in worship, glorified with oil.<br> 4 Ever to thee, O Agni, as exceeding strong have we drawn nigh with songs and reverence singing hymns.<br> So be thou pleased with us, A&#7749;giras! as a God enkindled by the noble with man's goodly light.<br> 5 Thou, Agni! multiform, God who art lauded much! givest in every house subsistence as of old.<br> Thou rulest by thy might o&#146;er food of many a sort: that light of thine when blazing may not be opposed.<br> 6 The Gods, Most Youthful Agni, have made thee, inflamed, the bearer of oblations and the messenger.<br> Thee, widely-reaching, homed in sacred oil, invoked, effulgent, have they made the Eye that stirs the thought.<br> 7 Men seeking joy have lit thee worshipped from of old, O Agni, with good fuel and with sacred oil.<br> So thou, bedewed and waxing mighty by the plants, spreadest thyself abroad over the realms of earth.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05009.htm\">Next: HYMN IX. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05008.html",
  "api": "json/hymns/05008.json",
  "data": {
    "key": "05008",
    "title": "HYMN VIII. Agni.",
    "describe": "O AGNI urged to strength, the men of old who loved the Law enkindled thee, the Ancient, for their aid, thee very bright, and holy, nourisher of all, most excellent, the Friend and Master of the home.",
    "feecting": "p:O AGNI urged to strength, the men of old who loved the Law enkindled thee, the Ancient, for their aid, thee very bright, and holy, nourisher of all, most excellent, the Friend and Master of the home.\np:Thee, Agni, men have stablished as their guest of old, as Master of the household, thee, with hair of flame; High-bannered, multiform, distributor of wealth, kind helper, good protector, drier of the floods.\np:The tribes of men praise thee, Agni, who knowest well burnt offerings, the Discerner, lavishest of wealth, Dwelling in secret, Blest One! visible to all, loud-roaring, skilled in worship, glorified with oil.\np:Ever to thee, O Agni, as exceeding strong have we drawn nigh with songs and reverence singing hymns.\np: So be thou pleased with us, Aṅgiras! as a Deva enkindled by the noble with man's goodly light.\r\np:Thou, Agni! multiform, Deva who art lauded much! givest in every house subsistence as of old. Thou rulest by thy might o’er food of many a sort: that light of thine when blazin. May not be opposed.\np:The Devas, most Youthful Agni, have made thee, inflamed, the bearer of oblations and the messenger. Thee, widely-reaching, homed in sacred oil, invoked, effulgent, have they made the Eye that stirs the thought.\np:Men seeking joy have lit thee worshipped from of old, O Agni, with good fuel and with sacred oil. So thou, bedewed and waxing mighty by the plants, spreadest thyself abroad over the realms of Earth.",
    "meta": {
      "next": "05009",
      "previous": "05007",
      "book": "05",
      "original": "https://sacred-texts.com/hin/rigveda/rv05008.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv05008.htm"
    },
    "deities": [
      {
        "name": "O AGNI",
        "hymns": [
          {
            "key": "05008",
            "title": "HYMN VIII. Agni."
          },
          {
            "key": "05008",
            "title": "HYMN VIII. Agni."
          },
          {
            "key": "05008",
            "title": "HYMN VIII. Agni."
          }
        ]
      }
    ]
  },
  "created": 1638554927165,
  "updated": 1639023784434
}