{
  "key": "05003",
  "title": "RigVeda Hymn 05003",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN III. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05003.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05002.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05004.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN III. Agni.</h3>  \n<p>1. THOU at thy birth art Varu&#7751;a, O Agni; when thou art kindled thou becomest Mitra.<br> In thee, O Son of Strength, all Gods are centred. Indra art thou to man who brings oblation.<br> 2 Aryaman art thou as regardeth maidens mysterious, is thy name, O Self-sustainer.<br> As a kind friend with streams of milk they balm thee what time thou makest wife and lord one-minded.<br> 3 The Maruts deck their beauty for thy glory, yea, Rudra! for thy birth fair, brightly-coloured.<br> That which was fixed as Vi&#7779;&#7751;u's loftiest station&#151;therewith the secret of the Cows thou guardest.<br> 4 Gods through thy glory, God who art so lovely! granting abundant gifts gained life immortal.<br> As their own Priest have men established Agni; and serve him fain for praise from him who liveth.<br> 5 There is no priest more skilled than thou in worship; none Self-sustainer pass thee in wisdom.<br> The man within whose house as guest thou dwellest, O God, by sacrifice shall conquer mortals.<br> 6 Aided by thee, O Agni may we conquer through our oblation, fain for wealth, awakened:<br> May we in battle, in the days&#146; assemblies, O Son of Strength, by riches conquer mortals.<br> 7 He shall bring evil on the evil-plotter whoever turns against us sin and outrage.<br> Destroy this calumny of him, O Agni, whoever injures us with double-dealing.<br> 8 At this dawn's flushing, God! our ancient fathers served thee with offerings, making thee their envoy,<br> When, Agni, to the store of wealth thou goest, a God enkindled with good things by mortals.<br> 9 Save, thou who knowest, draw thy father near thee, who counts as thine own son, O Child of Power.<br> O sapient Agni, when wilt thou regard us? When, skilled in holy Law, wilt thou direct us?<br> 10 Adoring thee he gives thee many a title, when thou, Good Lord! acceptest this as Father.<br> And doth not Agni, glad in strength of Godhead, gain splendid bliss when he hath waxen mighty?<br> 11 Most Youthful Agni, verily thou bearest thy praiser safely over all his troubles.<br> Thieves have been seen by us and open foemen: unknown have been the plottings of the wicked.<br> 12 To thee these eulogies have been directed: or to the Vasu hath this sin been spoken.<br> But this our Agni, flaming high, shall never yield us to calumny, to him who wrongs us.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05004.htm\">Next: HYMN IV. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/05003.html",
  "api": "hymns/05003json",
  "data": {
    "title": "HYMN III. Agni.",
    "describe": "THOU at thy birth art Indra, O Agni;",
    "feecting": "p:THOU at thy birth art Indra, O Agni; when thou art kindled thou becomest Mitra.\np: In thee, O Son of Strength, all Devas are centred. Indra art thou to man who brings oblation.\r\np:Aryaman art thou as regardeth maidens mysterious, is thy name, O Self-sustainer. As a kind friend with streams of milk they balm thee what time thou makest wife and lord one-minded.\np:The Devas deck their beauty for thy glory, yea, Soma! for thy birth fair, brightly-coloured. That which was fixed as Indra's loftiest station—therewith the secret of the Cows thou guardest.\np:Devas through thy glory, Deva who art so lovely! granting abundant gifts gained life immortal. As their own Monk have men established Agni; and serve him fain for praise from him who liveth.\np:There is no priest more skilled than thou in worship; none Self-sustainer pass thee in wisdom. The man within whose house as guest thou dwellest, by offering shall conquer mortals.\np:Aided by thee, O Agn. May we conquer through our oblation, fain for wealth, awakened: May we in battle, in the days’ assemblies, O Son of Strength, by riches conquer mortals.\np:He shall bring evil on the evil-plotter whoever turns against us sin and outrage. Destroy this calumny of him, O Agni, whoever injures us with double-dealing.\np:At this dawn's flushing, God! our ancient fathers served thee with offerings, making thee their envoy, when, Agni, to the store of wealth thou goest, a God enkindled with good things by mortals.\np:Save, thou who knowest, draw thy father near thee, who counts as thine own son, O Child of Power. O sapient Agni, when wilt thou regard us? When, skilled in holy Law, wilt thou direct us?\np:Adoring thee he gives thee many a title, when thou, Good Lord! acceptest this as Father. And doth not Agni, glad in strength of Godhead, gain splendid bliss when he hath waxen mighty?\np:Most Youthful Agni, verily thou bearest thy praiser safely over all his troubles. Thieves have been seen by us and open foemen: unknown have been the plottings of the wicked.\np:To thee these eulogies have been directed: or to the Vasu hath this sin been spoken. But this our Agni, flaming high, shall never yield us to calumny, to him who wrongs us.",
    "next": "05004",
    "previous": "05002",
    "book": "05"
  },
  "created": 1638554900503
}