{
  "key": "05015",
  "title": "RigVeda Hymn 05015",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN XV. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05015.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05014.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05016.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XV. Agni.</h3>  \n<p>1. To him, the far-renowned, the wise Ordainer, ancient and glorious, a song I offer.<br> Enthroned in oil, the Asura, bliss-giver, is Agni, firm support of noble, riches.<br> 2 By holy Law they kept supporting Order, by help of sacrifice, in loftiest heaven,&#151;<br> They who attained with born men to the unborn, men seated on that stay, heaven's firm sustainer.<br> 3 Averting woe, they labour hard to bring him, the ancient, plenteous food as power resistless.<br> May he, born newly, conquer his assailants: round him they stand as round an angry lion.<br> 4 When, like a mother, spreading forth to nourish, to cherish and regard each man that liveth,&#151;<br> Consuming all the strength that thou hast gotten, thou wanderest round, thyself, in varied fashion.<br> 5 May strength preserve the compass of thy vigour, God! that broad stream of thine that beareth riches.<br> Thou, like a thief who keeps his refuge secret, hast holpen Atri to great wealth, by teaching.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05016.htm\">Next: HYMN XVI. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05015.html",
  "api": "json/hymns/05015.json",
  "data": {
    "title": "HYMN XV. Agni.",
    "describe": "To him, the far-renowned, the wise Ordainer, ancient and glorious, a song I offer.",
    "feecting": "p:To him, the far-renowned, the wise Ordainer, ancient and glorious, a song I offer.\np: Enthroned in oil, the Devas, bliss-giver, is Agni, firm support of noble, riches.\r\np:By holy Law they kept supporting Order, by help of offering, in loftiest Heaven,&#151; They who attained with born men to the unborn, men seated on that stay. Heaven's firm sustainer.\np:Averting woe, they labour hard to bring him, the ancient, plenteous food as power resistless. May he, born newly, conquer his assailants: round him they stand as round an angry lion.\np:When, like a mother, spreading forth to nourish, to cherish and regard each man that liveth,&#151; Consuming all the strength that thou hast gotten, thou wanderest round, thyself, in varied fashion.\np:May strength preserve the compass of thy vigour, God! that broad stream of thine that beareth riches. Thou, like a thief who keeps his refuge secret, hast holpen Atri to great wealth, by teaching.",
    "next": "05016",
    "previous": "05014",
    "book": "05"
  },
  "created": 1638554964396,
  "updated": 1638790697931
}