{
  "key": "05012",
  "title": "RigVeda Hymn 05012",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN XII. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05012.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05011.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05013.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XII. Agni.</h3>  \n<p>1. To Agni, lofty Asura, meet for worship, Steer of eternal Law, my prayer I offer;<br> I bring my song directed to the Mighty like pure oil for his mouth at sacrifices.<br> 2 Mark the Law, thou who knowest, yea, observe it: send forth the full streams of eternal Order.<br> I use no sorcery with might or falsehood the sacred Law of the Red Steer I follow.<br> 3 How hast thou, follower of the Law eternal, become the knower of a new song, Agni?<br> The God, the Guardian of the seasons, knows me: the Lord of him who won this wealth I know not.<br> 4 Who, Agni, in alliance with thy foeman, what splendid helpers won for them their riches?<br> Agni, who guard the dwelling-place of falsehood? Who are protectors of the speech of liars?<br> 5 Agni, those friends of thine have turned them from thee: gracious of old, they have become ungracious.<br> They have deceived themselves by their own speeches, uttering wicked words against the righteous.<br> 6 He who pays sacrifice to thee with homage, O Agni, keeps the Red Steer's Law eternal;<br> Wide is his dwelling. May the noble offspring of Nahu&#7779;a who wandered forth come hither.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05013.htm\">Next: HYMN XIII. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05012.html",
  "api": "json/hymns/05012.json",
  "data": {
    "title": "HYMN XII. Agni.",
    "describe": "To Agni, lofty Devas, meet for worship, Steer of eternal Law, my meditation I offer;",
    "feecting": "p:To Agni, lofty Devas, meet for worship, Steer of eternal Law, my meditation I offer; I bring my song directed to the Mighty like pure oil for his mouth at offeringss.\np:Mark the Law, thou who knowest, yea, observe it: send forth the full streams of eternal Order.\np: I use no sorcery with might or falsehood the sacred Law of the Red Steer I follow.\r\np:How hast thou, follower of the Law eternal, become the knower of a new song, Agni? The Deva, the Guardian of the seasons, knows me: the Lord of him who won this wealth I know not.\np:Who, Agni, in alliance with thy foeman, what splendid helpers won for them their riches? Agni, who guard the dwelling-place of falsehood? Who are protectors of the speech of liars?\np:Agni, those friends of thine have turned them from thee: gracious of old, they have become ungracious. They have deceived themselves by their own speeches, uttering wicked words against the righteous.\np:He who pays offering to thee with homage, O Agni, keeps the Red Steer's Law eternal; Wide is his dwelling. May the noble offspring of Nahu&#7779;a who wandered forth come hither.",
    "next": "05013",
    "previous": "05011",
    "book": "05"
  },
  "created": 1638554948555,
  "updated": 1638792007758
}