{
  "key": "05025",
  "title": "RigVeda Hymn 05025",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN XXV. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05025.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05024.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05026.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXV. Agni.</h3>  \n<p>1. I WILL sing near, for grace, your God Agni, for he is good to us.<br> Son of the Brands, may he give gifts, and, righteous, save us from the foe.<br> 2 For he is true, whom men of old enkindled, and the Gods themselves,<br> The Priest with the delicious tongue, rich with the light of glorious beams.<br> 3 With wisdom that surpasseth all, with gracious will most excellent,<br> O Agni, worthy of our choice, shine wealth on us through hymns of praise.<br> 4 Agni is King, for he extends to mortals and to Gods alike.<br> Agni is bearer of our gifts. Worship ye Agni with your thoughts.<br> 5 Agni gives to the worshipper a son, the best, of mightiest fame,<br> Of deep devotion, ne&#146;er subdued, bringer of glory to his sire.<br> 6 Agni bestows the hero-lord who conquers with the men in fight.<br> Agni bestows the fleet-foot steed, the victor never overcome.<br> 7 The mightiest song is Agni's: shine on high, thou who art rich in light.<br> Like the Chief Consort of a King, riches and strength proceed from thee.<br> 8 Resplendent are thy rays of light: loud is thy voice like pressing-stones.<br> Yea, of itself thy thunder goes forth like the roaring of the heaven.<br> 9 Thus, seeking riches, have we paid homage to Agni Conqueror.<br> May he, most wise, as with a ship, carry us over all our foes.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05026.htm\">Next: HYMN XXVI. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05025.html",
  "api": "json/hymns/05025.json",
  "data": {
    "title": "HYMN XXV. Agni.",
    "describe": "I WILL sing near, for grace, your God Agni, for he is good to us.",
    "feecting": "p:I WILL sing near, for grace, your God Agni, for he is good to us.\np: Son of the Brands. May he give gifts, and, righteous, save us from the foe.\r\np:For he is true, whom men of old enkindled, and the Devas themselves, the Monk with the delicious tongue, rich with the light of glorious beams.\np:With wisdom that surpasseth all, with gracious will most excellent, O Agni, worthy of our choice, shine wealth on us through hymns of praise.\np:Agni is King, for he extends to mortals and to Devas alike. Agni is bearer of our gifts. Worship ye Agni with your thoughts.\np:Agni gives to the worshipper a son, the best, of mightiest fame, Of deep devotion, ne&#146;er subdued, bringer of glory to his sire.\np:Agni bestows the hero-lord who conquers with the men in fight. Agni bestows the fleet-foot steed, the victor never overcome.\np:The mightiest song is Agni's: shine on high, thou who art rich in light. Like the Chief Consort of a King, riches and strength proceed from thee.\np:Resplendent are thy rays of light: loud is thy voice like pressing-stones. Yea, of itself thy thunder goes forth like the roaring of the Heaven.\np:Thus, seeking riches, have we paid homage to Agni Conqueror. May he, most wise, as with a ship, carry us over all our foes.",
    "next": "05026",
    "previous": "05024",
    "book": "05"
  },
  "created": 1638555017105,
  "updated": 1638647072495
}