{
  "key": "05041",
  "title": "RigVeda Hymn 05041",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN XLI. Vi&#347;vedevas</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05041.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05040.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05042.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XLI. Vi&#347;vedevas</h3>  \n<p>1. WHO, Mitra-Varu&#7751;a, is your pious servant to give you gifts from earth or mighty heaven?<br> Preserve us in the seat of holy Order, and give the offerer power that winneth cattle.<br> 2 May Mitra, Varu&#7751;a, Aryaman, and &#256;yu, Indra &#7770;bhuk&#7779;an, and the Maruts, love us,<br> And they who of one mind with bounteous Rudra accept the hymn and laud with adorations.<br> 3 You will I call to feed the car-horse, A&#347;vins, with the wind's flight swiftest of those who travel:<br> Or also to the Asura of heaven, Worshipful, bring a hymn as &#146;twere libation.<br> 4 The heavenly Victor, he whose priest is Ka&#7751;va, T&#7771;ta with Dyaus accordant, V&#257;ta, Agni,<br> All-feeding P&#363;&#7779;an, Bhaga sought the oblation, as they whose steeds are fleetest seek the contest.<br> 5 Bring ye your riches forward borne on horses: let thought be framed for help and gain of treasure.<br> Blest he the priest of Au&#347;ija through courses, the courses which are yours the fleet, O Maruts.<br> 6 Bring hither him who yokes the car, your V&#257;yu, who praises with his songs, the God and Singer;<br> And, praying and devout, noble and prudent, may the Gods&#146; Spouses in their thoughts retain us.<br> 7 I speed to you with powers that should be honoured, with songs distinguishing Heaven's mighty Daughters,<br> Morning and Night, the Two, as &#146;twere all-knowing: these bring the sacrifice unto the mortal.<br> 8 You I extol, the nourishers of heroes bringing you gifts, Vastospati and Tva&#7779;&#7789;ar-<br> Rich Dhi&#7779;a&#7751;&#257; accords through our obeisance - andTrees and Plants, for the swift gain of riches.<br> 9 Ours be the Parvatas, even they, for offspring, free-moving, who are Heroes like the Vasus.<br> May holy &#256;ptya, Friend of man, exalted, strengthen our word for ever and be near us.<br> 10 T&#7771;ta praised him, germ of the earthly hero, with pure songs him the Offspring of the Waters.<br> Agn; with might neighs loudly like a charger: he of the flaming hair destroys the forests.<br> 11 How shall we speak to the great might of Rudra? How speak to Bhaga who takes thought for riches?<br> May Plants, the Waters, and the Sky preserve us, and Woods and Mountains with their trees for tresses.<br> 12 May the swift Wanderer, Lord of refreshments listen to our songs, who speeds throuih cloudy heaven:<br> And may the Waters, bright like castles, hear us, as they flow onward from the cloven mountain.<br> 13 We know your ways, ye Mighty Ones receiving choice meed, ye Wonderful, we will proclaim it.<br> Even strong birds descend not to the mortal who strives to reach them with swift blow and weapons.<br> 14 Celestial and terrestrial generations, and Waters will I summon to the feasting.<br> May days with bright dawns cause my songs to prosper, and may the conquered streams increase their waters.<br> 15 Duly to each one hath my laud been offered. Strong be Var&#363;tr&#299; with her powers to succour.<br> May the great Mother Ras&#257; here befriend us, straight-handed, with the princes, striving forward.<br> 16 How may we serve the Liberal Ones with worship, the Maruts swift of course in invocation, the Maruts far-renowned in invocation?<br> Let not the Dragon of the Deep annoy us, and gladly may he welcome our addresses.<br> 17 Thus thinking, O ye Gods, the mortal wins you to give him increase of his herds of cattle: the mortal wins him, O ye Gods, your favour.<br> Here he wins wholesome food to feed this body: as for mine old age, Nirrti consume it<br> 18 O Gods, may we obtain from you this favour, strengthening food through the Cow's praise, ye Vasus.<br> May she who gives good gifts, the gracious Goddes. s, come speeding nigh to us for our well-being.<br> 19 May I&#7735;&#257;, Mother of the herds of cattle, and Urvasi with all the streams accept us;<br> May Urvasi in lofty heaven accepting, as she partakes the oblation of the living,<br> 20 Visit us while she shares Urjavya's food.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05042.htm\">Next: HYMN XLII. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05041.html",
  "api": "json/hymns/05041.json",
  "data": {
    "title": "HYMN XLI. Vi&#347;vedevas",
    "describe": "WHO, Mitra-Varu&#7751;",
    "feecting": "p:WHO, Mitra-Varu&#7751;a, is your pious servant to give you gifts from Earth or mighty Heaven? Preserve us in the seat of holy Order, and give the offerer power that winneth cattle.\np:May Mitra, Varu&#7751;a, Aryaman, and &#256;yu, Indra &#7770;bhuk&#7779;an, and the Devas, love us, and they who of one mind with bounteous Soma accept the hymn and laud with adorations.\np:You will I call to feed the car-horse, A&#347;vins, with the wind's flight swiftest of those who travel: Or also to the Devas of Heaven, worshipful, bring a hymn as &#146;twere libation.\np:The heavenly Victor, he whose priest is Ka&#7751;va, T&#7771;ta with Devas accordant, V&#257;ta, Agni, All-feeding P&#363;&#7779;an, Bhaga sought the oblation, as they whose steeds are fleetest seek the contest.\np:Bring ye your riches forward borne on horses: let thought be framed for help and gain of treasure.\np: Blest he the Monk of Au&#347;ija through courses, the courses which are yours the fleet, O Devas.\r\np:Bring hither him who yokes the car, your V&#257;yu, who praises with his songs and Singer; And, praying and devout, noble and prudent. May the Devas&#146; Spouses in their thoughts retain us.\np:I speed to you with powers that should be honoured, with songs distinguishing Heaven's mighty Daughters, Morning and Night, the Two, as &#146;twere all-knowing: these bring the offering unto the mortal.\np:You I extol, the nourishers of heroes bringing you gifts, Vastospati and Tva&#7779;&#7789;ar- Rich Dhi&#7779;a&#7751;&#257; accords through our obeisance - andTrees and Plants, for the swift gain of riches.\np:Ours be the Parvatas, even they, for offspring, free-moving, who are Heroes like the Devas. May holy &#256;ptya, Friend of man, exalted, strengthen our word forever and be near us.\np:T&#7771;ta praised him, germ of the earthly hero, with pure songs him the Offspring of the Waters. Agn; with might neighs loudly like a charger: he of the flaming hair destroys the forests.\np:How shall we speak to the great might of Soma? How speak to Bhaga who takes thought for riches? May Plants, the Waters, and the Sky preserve us, and Woods and Mountains with their trees for tresses.\np:May the swift Wanderer, Lord of refreshments listen to our songs, who speeds throuih cloudy Heaven: An. May the Waters, bright like castles, hear us, as they flow onward from the cloven mountain.\np:We know your ways, ye Mighty Ones receiving choice meed, ye Wonderful, we will proclaim it. Even strong birds descend not to the mortal who strives to reach them with swift blow and weapons.\np:Celestial and terrestrial generations, and Waters will I summon to the feasting. May days with bright dawns cause my songs to prosper, an. May the conquered streams increase their waters.\np:Duly to each one hath my laud been offered. Strong be Var&#363;tr&#299; with her powers to succour. May the great Mother Ras&#257; here befriend us, straight-handed, with the princes, striving forward.\np:Ho. May we serve the Liberal Ones with worship, the Devas swift of course in invocation, the Devas far-renowned in invocation? Let not the Dragon of the Deep annoy us, and gladl. May he welcome our addresses.\np:Thus thinking, O ye Devas, the mortal wins you to give him increase of his herds of cattle: the mortal wins him, O ye Devas, your favour. Here he wins wholesome food to feed this body: as for mine old age, Nirrti consume it\np:O Devas. May we obtain from you this favour, strengthening food through the Cow's praise, ye Devas. May she who gives good gifts, the gracious Goddes. s, come speeding nigh to us for our well-being.\np:May I&#7735;&#257;, Mother of the herds of cattle, and Urvasi with all the streams accept us; May Urvasi in lofty Heaven accepting, as she partakes the oblation of the living,\np:Visit us while she shares Urjavya's food.",
    "next": "05042",
    "previous": "05040",
    "book": "05"
  },
  "created": 1638555102490,
  "updated": 1638647072514
}