{
  "key": "05059",
  "title": "RigVeda Hymn 05059",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LIX. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05059.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05058.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05060.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LIX. Maruts.</h3>  \n<p>1. YOUR spy hath called to you to give prosperity. I sing to Heaven and Earth and offer sacrifice.<br> They bathe their steeds and hasten through the firmament: they spread abroad their radiance through the sea of cloud.<br> 2 Earth shakes and reels in terror at their onward rush, like a full ship which, quivering, lets the water in.<br> Marked on their ways are they, visible from afar: the Heroes press between in mighty armament.<br> 3 As the exalted horn of bulls for splendid might, as the Sun's eye set in the firmament's expanse,<br> Like vigorous horses ye are beauteous to behold, and for your glory show like bridegrooms, O ye Men.<br> 4 Who, O ye Maruts, may attain the mighty lore of you the mighty, who may reach your manly deeds?<br> Ye, verily, make earth tremble like a ray of light what time ye bring your boons to give prosperity,<br> 5 Like steeds of ruddy colour, scions of one race, as foremost champions they have battled in the van.<br> The Heroes have waxed strong like we.1grown manly youths; with floods of rain they make the Sun's eye fade away,<br> 6 Having no eldest and no youngest in their band, no middlomost, preeminent they have waxed in might,<br> These Sons of P&#7771;&#347;ni, sprung of noble ancestry: come hitberward to us, ye bridegrooms of the sky.<br> 7 Like birds of air they flew with might in lengthened lines from heaven's high ridges to the borders of the sky.<br> The steeds who carry them, as Gods and mortals know, have caused the waters of the mounuains to desGend.<br> 8 May Dyaus, the Infinite, roar for our banquet: may Dawns toil for us, glittering with moisture.<br> Lauded by thee, these Maruts, Sons o Rudra, O &#7770;&#7779;i, have sent down the heavenly treasure.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05060.htm\">Next: HYMN LX. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05059.html",
  "api": "json/hymns/05059.json",
  "data": {
    "title": "HYMN LIX. Devas.",
    "describe": "YOUR spy hath called to you to give prosperity.",
    "feecting": "p:YOUR spy hath called to you to give prosperity. I sing to Heaven and Earth and offer offering.\np: They bathe their steeds and hasten through the Firmament: they spread abroad their radiance through the sea of cloud.\r\np:Earth shakes and reels in terror at their onward rush, like a full ship which, quivering, lets the water in. Marked on their ways are they, visible from afar: the Heroes press between in mighty armament.\np:As the exalted horn of bulls for splendid might, as the Sun's eye set in the Firmament's expanse, like vigorous horses ye are beauteous to behold, and for your glory show like bridegrooms, O ye Men.\np:Who, O ye Devas. May attain the mighty lore of you the mighty, wh. May reach your manly deeds? Ye, verily, make Earth tremble like a ray of light what time ye bring your boons to give prosperity,\np:Like steeds of ruddy colour, scions of one race, as foremost champions they have battled in the van. The Heroes have waxed strong like we.1grown manly youths; with floods of rain they make the Sun's eye fade away,\np:Having no eldest and no youngest in their band, no middlomost, preeminent they have waxed in might, these Sons of P&#7771;&#347;ni, sprung of noble ancestry: come hitberward to us, ye bridegrooms of the sky.\np:Like birds of air they flew with might in lengthened lines from Heaven's high ridges to the borders of the sky. The steeds who carry them, as Devas and mortals know, have caused the waters of the mounuains to desGend.\np:May Devas, the Infinite, roar for our banquet. May Dawns toil for us, glittering with moisture. Lauded by thee, these Devas, Sons o Soma, O &#7770;&#7779;i, have sent down the heavenly treasure.",
    "next": "05060",
    "previous": "05058",
    "book": "05"
  },
  "created": 1638555197983,
  "updated": 1638791591623
}