{
  "key": "05055",
  "title": "RigVeda Hymn 05055",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LV. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05055.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05054.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05056.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LV. Maruts.</h3>  \n<p>1. WITH gleaming lances, with their breasts adorned with gold, the Maruts, rushing onward, hold high power of life.<br> They hasten with swift steeds easy to be controlled. Their cars moved onward as they went to victory.<br> 2 Ye, as ye wist, have gained of your own selves your power: high, O ye Mighty Ones, and wide ye shine abroad.<br> They with their strength have even measured out the sky.<br> Their cars moved onward as they went to victory.<br> 3 Strong, born together, they together have waxed great: the Heroes more and more have grown to majesty<br> Resplendent as the Sun's beams in their light are they. Their cars moved onward as they went to victory.<br> 4 Maruts, your mightiness deserves to be adored, sight to be longed for like the shining of the Sun.<br> So lead us with your aid to immortality.<br> Their cars moved onward as they went to victory.<br> 5 O Maruts, from the Ocean ye uplift the rain, and fraught with vaporous moisture pour the torrents down.<br> Never, ye Wonder-Workers, are your Milch-kine dry. Their cars moved onward as they went to victory.<br> 6 When to your car-poles ye have yoked your spotted deer to be your steeds, and put your golden mantles on,<br> O Maruts, ye disperse all enemies abroad. Their cars moved onward as they went to victory.<br> 7 Neither the mountains nor the rivers keep you back: whither ye have resolved thither ye, Maruts, go.<br> Ye compass round about even the heaven and earth. Their cars moved onward as they went to victory.<br> Whate&#146;er is ancient, Maruts, what of recent time, whate&#146;er is spoken, Vasus, what is chanted forth,<br> They who take cognizance of all of this are ye. Their cars moved onward as they went to victory.<br> 9 Be gracious unto us, ye Maruts, slay us not extend ye unto us shelter of many a sort.<br> Pay due regard unto our friendship and our praise. Their cars moved onward as they went to victory.<br> 10 O Maruts, lead us on to higher fortune deliver us, when lauded, from afflictions.<br> Accept, ye Holy Ones, the gifts we bring you. May we be masters of abundant riches.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05056.htm\">Next: HYMN LVI. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05055.html",
  "api": "json/hymns/05055.json",
  "data": {
    "key": "05055",
    "title": "HYMN LV. Devas.",
    "describe": "WITH gleaming lances, with their breasts adorned with gold, the Devas, rushing onward, hold high power of life.",
    "feecting": "p:WITH gleaming lances, with their breasts adorned with gold, the Devas, rushing onward, hold high power of life.\np: They hasten with swift steeds easy to be controlled. Their cars moved onward as they went to victory.\r\np:Ye, as ye wist, have gained of your own selves your power: high, O ye Mighty Ones, and wide ye shine abroad. They with their strength have even measured out the sky. Their cars moved onward as they went to victory.\np:Strong, born together, they together have waxed great: the Heroes more and more have grown to majesty Resplendent as the Sun's beams in their light are they. Their cars moved onward as they went to victory.\np:Devas, your mightiness deserves to be adored, sight to be longed for like the shining of the Sun. So lead us with your aid to immortality. Their cars moved onward as they went to victory.\np:O Devas, from the Ocean ye uplift the rain, and fraught with vaporous moisture pour the torrents down. Never, ye Wonder-Workers, are your Milch-kine dry. Their cars moved onward as they went to victory.\np:When to your car-poles ye have yoked your spotted deer to be your steeds, and put your golden mantles on, O Devas, ye disperse all enemies abroad. Their cars moved onward as they went to victory.\np:Neither the mountains nor the rivers keep you back: whither ye have resolved thither ye, Devas, go. Ye compass round about even the Heaven and Earth. Their cars moved onward as they went to victory. Whate’er is ancient, Devas, what of recent time, whate’er is spoken, Devas, what is chanted forth, they who take cognizance of all of this are ye. Their cars moved onward as they went to victory.\np:Be gracious unto us, ye Devas, subdue us not extend ye unto us shelter of many a sort. Pay due regard unto our friendship and our praise. Their cars moved onward as they went to victory.\np:O Devas, lead us on to higher fortune deliver us, when lauded, from afflictions. Accept, ye Holy Ones, the gifts we bring you. May we be masters of abundant riches.",
    "meta": {
      "next": "05056",
      "previous": "05054",
      "book": "05",
      "source": "https://sacred-texts.com/hin/rigveda/rv05055.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv05055.htm"
    },
    "deities": [
      {
        "name": "O ye ",
        "hymns": [
          {
            "key": "05055",
            "title": "HYMN LV. Devas."
          }
        ]
      },
      {
        "name": "O Devas",
        "hymns": [
          {
            "key": "05055",
            "title": "HYMN LV. Devas."
          },
          {
            "key": "05055",
            "title": "HYMN LV. Devas."
          },
          {
            "key": "05055",
            "title": "HYMN LV. Devas."
          }
        ]
      }
    ]
  },
  "created": 1638555176797,
  "updated": 1638830292290
}