{
  "key": "05058",
  "title": "RigVeda Hymn 05058",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LVIII. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05058.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05057.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05059.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LVIII. Maruts.</h3>  \n<p>1. Now do I glorify their mighty cohort, the company of these the youthful Maruts,<br> Who ride impetuous on with rapid horses, and radiant in themselves, are Lords of Am&#7771;ta.<br> 2 The mighty glittering band, arm-bound with bracelets, givers of bliss, unmeasured in their greatness,<br> With magical powers, bountiful, ever-roaring,&#151;these, liberal Heroes, venerate thou singer.<br> 3 This day may all your water-bringers, Maruts, they who impel the falling rain, approach us.<br> This fire, O Maruts, hath been duly kindled; let it find favour with you, youthful Sages.<br> 4 Ye raise up for the folk an active ruler whom, Holy Ones! a Master's hand hath fashioned.<br> Ye send the fighter hand to hand, armmighty, and the brave hero, Maruts with good horses.<br> 5 They spring forth more and more, strong in their glories, like days, like spokes where none are last in order.<br> Highest and mightiest are the Sons of P&#7771;&#347;ni. Firm to their own intention cling the Maruts.<br> 6 When ye have hastened on with spotted coursers, O Maruts, on your cars with strong-wrought fellies,<br> The waters are disturbed, the woods are shattered. Let Dyaus the Red Steer send his thunder downward.<br> 7 Even Earth hath spread herself wide at their coming, and they as husbands have with power impregned her.<br> They to the pole have yoked the winds for coursers: their sweat have they made rain, these Sons of Rudra.<br> 8 Ho! Maruts, Heroes, skilled in Law, immortal, be gracious unto us, ye rich in treasures,<br> Ye hearers of the truth, ye sage and youthful, grown mighty, dwelling on the lofty mountains.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05059.htm\">Next: HYMN LIX. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05058.html",
  "api": "json/hymns/05058.json",
  "data": {
    "title": "HYMN LVIII. Devas.",
    "describe": "Now do I glorify their mighty cohort, the company of these the youthful Devas, who ride impetuous on with rapid horses, and radiant in themselves, are Lords of Am&#7771;",
    "feecting": "p:Now do I glorify their mighty cohort, the company of these the youthful Devas, who ride impetuous on with rapid horses, and radiant in themselves, are Lords of Am&#7771;ta.\np:The mighty glittering band, arm-bound with bracelets, givers of bliss, unmeasured in their greatness, with magical powers, bountiful, ever-roaring,&#151;these, liberal Heroes, venerate thou singer.\np:This da. May all your water-bringers, Devas, they who impel the falling rain, approach us.\np: This fire, O Devas, hath been duly kindled; let it find favour with you, youthful Sages.\r\np:Ye raise up for the folk an active ruler whom, Holy Ones! a Master's hand hath fashioned. Ye send the fighter hand to hand, armmighty, and the brave hero, Devas with good horses.\np:They spring forth more and more, strong in their glories, like days, like spokes where none are last in order. Highest and mightiest are the Sons of P&#7771;&#347;ni. Firm to their own intention cling the Devas.\np:When ye have hastened on with spotted coursers, O Devas, on your cars with strong-wrought fellies, the waters are disturbed, the woods are shattered. Let Devas the Red Steer send his thunder downward.\np:Even Earth hath spread herself wide at their coming, and they as husbands have with power impregned her. They to the pole have yoked the winds for coursers: their sweat have they made rain, these Sons of Soma.\np:Ho! Devas. Heroes, skilled in Law, immortal, be gracious unto us, ye rich in treasures, Ye hearers of the truth, ye sage and youthful, grown mighty, dwelling on the lofty mountains.",
    "next": "05059",
    "previous": "05057",
    "book": "05"
  },
  "created": 1638555192710,
  "updated": 1638647018072
}