{
  "key": "05051",
  "title": "RigVeda Hymn 05051",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LI. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05051.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05050.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05052.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LI. Vi&#347;vedevas.</h3>  \n<p>1. WITH all assistants, Agni, come hither to drink the Soma-juice;<br> With Gods unto our sacred gifts.<br> 2 Come to the sacrifice, O ye whose ways are right, whose laws are true,<br> And drink the draught with Agni's tongue.<br> 3 O Singer, with the singers, O Gracious, with those who move at dawn,<br> Come to the Soma-draught with Gods.<br> 4 To Indra and to V&#257;yu dear, this Soma, by the mortar pressed,<br> Is now poured forth to fill the jar.<br> 5 V&#257;yu, come hither to the feast, wellpleased unto our sacred gifts:<br> Drink of the Soma juice effused come to the food.<br> 6 Ye, Indra, V&#257;yu, well deserve to drink the juices pressed by us.<br> Gladly accept them, spotless Pair come to the food.<br> 7 For Indra and for V&#257;yu pressed are Soma juices blent with curd,<br> As rivers to the lowland flow: come to the food.<br> 8 Associate with all the Gods, come, with the A&#347;vins and with Dawn,<br> Agni, as erst with Atri, so enjoy the juice.<br> 9 Associate with Varu&#7751;a, with Mitra, Soma, Vi&#7779;&#7751;u, come,<br> Agni, as erstwith Atri, so enjoy the juice.<br> 10 Associate with Vasus, with &#256;dityas, Indra, Viyu, come, Agni as erst with Atri, so enjoy the juice.<br> 11 May Bhaga and the A&#347;vins grant us health and wealth, and Goddess Adid and he whom none resist.<br> The Asura P&#363;&#7779;an grant us all prosperity, and Heaven and Earth most wise vouchsafe us happiness.<br> 12 Let us solicit V&#257;yu for prosperity, and Soma who is Lord of all the world for weal;<br> For weal B&#7771;haspati with all his company. May the &#256;dityas bring us health and happiness.<br> 13 May all the Gods, may Agni the beneficent, God of all men, this day be with us for our weal.<br> Help us the &#7770;bhus, the Divine Ones, for our good. May Rudra bless and keep us from calamity.<br> 14 Prosper us, Mitra, Varu&#7751;a. O wealthy Pathya, prosper us.<br> Indra and Agni, prosper us; prosper us thou, O Aditi.<br> 15 Like Sun and Moon may we pursue in full prosperity our path,<br> And meet with one who gives again, -who knows us well and slays us not.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05052.htm\">Next: HYMN LII Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05051.html",
  "api": "json/hymns/05051.json",
  "data": {
    "title": "HYMN LI. Vi&#347;vedevas.",
    "describe": "WITH all assistants, Agni, come hither -juice;",
    "feecting": "p:WITH all assistants, Agni, come hither -juice; With Devas unto our sacred gifts.\np:Come to the offering, O ye whose ways are right, whose laws are true, and drink the draught with Agni's tongue.\np:O Singer, with the singers, O Gracious, with those who move at dawn, Come to the Soma-draught with Devas.\np:To Indra and to V&#257;yu dear, this Soma, by the mortar pressed, is now poured forth to fill the jar.\np:V&#257;yu, come hither to the feast, wellpleased unto our sacred gifts: Drink of the Soma juice effused come to the food.\np:Ye, Indra, V&#257;yu, well deserve to drink the juices pressed by us.\np: Gladly accept them, spotless Pair come to the food.\r\np:For Indra and for V&#257;yu pressed are Soma juices blent with curd, as rivers to the lowland flow: come to the food.\np:Associate with all the Devas, come, with the A&#347;vins and with Dawn, Agni, as erst with Atri, so enjoy the juice.\np:Associate with Varu&#7751;a, with Mitra, Soma, Vi&#7779;&#7751;u, come, Agni, as erstwith Atri, so enjoy the juice.\np:Associate with Devas, with &#256;dityas, Indra, Viyu, come, Agni as erst with Atri, so enjoy the juice.\np:May Bhaga and the A&#347;vins grant us health and wealth, and Goddess Adid and he whom none resist. The Devas P&#363;&#7779;an grant us all prosperity, and Heaven and Earth most wise vouchsafe us happiness.\np:Let us solicit V&#257;yu for prosperity, and Soma who is Lord of all the world for weal; For weal B&#7771;haspati with all his company. May the &#256;dityas bring us health and happiness.\np:May all the Devas. May Agni the beneficent, God of all men, this day be with us for our weal. Help us the &#7770;bhus, the Divine Ones, for our good. May Soma bless and keep us from calamity.\np:Prosper us, Mitra, Varu&#7751;a. O wealthy Pathya, prosper us. Indra and Agni, prosper us; prosper us thou, O Aditi.\np:Like Sun and Moo. May we pursue in full prosperity our path, and meet with one who gives again, -who knows us well and subdues us not.",
    "next": "05052",
    "previous": "05050",
    "book": "05"
  },
  "created": 1638555155724,
  "updated": 1638790697973
}