{
  "key": "05053",
  "title": "RigVeda Hymn 05053",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LIII. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05053.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05052.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05054.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LIII. Maruts.</h3>  \n<p>1. Who knows the birth of these, or who lived in the Maruts&#146; favour in the days of old<br> What time their spotted deer were yoked?<br> 2 Who, when they stood upon their cars, hath heard them tell the way they went?<br> Who was the bounteous man to whom their kindred rains flowed down with food of sacrifice?<br> 3 To me they told it, and they came with winged steeds radiant to the draught,<br> Youths, Heroes free from spot or stain: Behold us here and praise thou us;<br> 4 Who shine self-luminous with ornaments and swords, with breastplates, armlets, and with wreaths,<br> Arrayed on chariots and with bows.<br> 5 O swift to pour your bounties down, ye Maruts, with delight I look upon your cars,<br> Like splendours coming through the rain.<br> 6 Munificent Heroes, they have cast heaven's treasury down for the worshipper's behoof:<br> They set the storm-cloud free to stream through both the worlds, and rainfloods flow o&#146;er desert spots.<br> 7 The bursting streams m billowy flood have spread abroad, like milch-kine, o&#146;er the firmament.<br> Like swift steeds hasting to their journey's resting-place, to every side run glittering brooks.<br> 8 Hither, O Maruts, come from heaven, from mid-air, or from near at hand<br> Tarry not far away from us.<br> 9 So let not Ras&#257;, Krumu, or Anitabha, Kubha, or Sindhu hold you back.<br> Let not the watery Sarayti obstruct your way. With us be all the bliss ye give.<br> 10 That brilliant gathering of your cars, the company of Maruts, of the Youthful Ones,<br> The rain-showers, speeding on, attend.<br> 11 With eulogies and hymns may we follow your army, troop by troop, and band by band,<br> And company by company.<br> 12 To what oblation-giver, sprung of noble ancestry, have sped<br> The Maruts on this course to-day?<br> 13 Vouchsafe to us the bounty, that which we implore, through which, for child and progeny,<br> Ye give the seed of corn that wasteth not away, and bliss that reacheth to all life.<br> 14 May we in safety pass by those who slander us, leaving behind disgrace and hate.<br> Maruts, may we be there when ye, at dawn, in rest and toil, rain waters down and balm.<br> 15 Favoured by Gods shall he the man, O Heroes, Marutr! and possessed of noble sons,<br> Whom ye protect. Such may we be.<br> 16 Praise the Free-givers. At this liberal patron's rite they joy like cattle in the mead.<br> So call thou unto them who come as ancient Friends: hymn those who love thee with a song.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05054.htm\">Next: HYMN LIV. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05053.html",
  "api": "json/hymns/05053.json",
  "data": {
    "key": "05053",
    "title": "HYMN LIII. Devas.",
    "describe": "Who knows the birth of these, or who lived in the Devas’ favour in the days of old What time their spotted deer were yoked?",
    "feecting": "p:Who knows the birth of these, or who lived in the Devas’ favour in the days of old What time their spotted deer were yoked?\np:Who, when they stood upon their cars, hath heard them tell the way they went? Who was the bounteous man to whom their kindred rains flowed down with food of offering?\np:To me they told it, and they came with winged steeds radiant to the draught, Youths. Heroes free from spot or stain: Behold us here and praise thou us;\np:Who shine self-luminous with ornaments and swords, with breastplates, armlets, and with wreaths, Arrayed on chariots and with bows.\np:O swift to pour your bounties down, ye Devas, with delight I look upon your cars, like splendours coming through the rain.\np:Munificent Heroes, they have cast Heaven's treasury down for the worshipper's behoof: They set the storm-cloud free to stream through both the worlds, and rainfloods flow o’er desert spots.\np:The bursting streams m billowy flood have spread abroad, like milch-kine, o’er the Firmament.\np: Like swift steeds hasting to their journey's resting-place, to every side run glittering brooks.\r\np:Hither, O Devas, come from Heaven, from mid-air, or from near at hand Tarry not far away from us.\np:So let not Rasā, Krumu, or Anitabha, Kubha, or Sindhu hold you back. Let not the watery Sarayti obstruct your way. With us be all the bliss ye give.\np:That brilliant gathering of your cars, the company of Devas, of the Youthful Ones, the rain-showers, speeding on, attend.\np:With eulogies and hymn. May we follow your army, troop by troop, and band by band, and company by company.\np:To what oblation-giver, sprung of noble ancestry, have sped The Devas on this course to-day?\np:Vouchsafe to us the bounty, that which we implore, through which, for child and progeny, Ye give the seed of corn that wasteth not away, and bliss that reacheth to all life.\np:May we in safety pass by those who slander us, leaving behind disgrace and hate, Devas. May we be there when ye, at dawn, in rest and toil, rain waters down and balm.\np:Favoured by Devas shall he the man, O Heroes, Marutr! and possessed of noble sons, whom ye protect. Suc. May we be.\np:Praise the Free-givers. At this liberal patron's rite they joy like cattle in the mead. So call thou unto them who come as ancient Friends: hymn those who love thee with a song.",
    "meta": {
      "next": "05054",
      "previous": "05052",
      "book": "05",
      "original": "https://sacred-texts.com/hin/rigveda/rv05053.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv05053.htm"
    },
    "deities": [
      {
        "name": "O swift",
        "hymns": [
          {
            "key": "05053",
            "title": "HYMN LIII. Devas."
          }
        ]
      },
      {
        "name": "O Devas",
        "hymns": [
          {
            "key": "05053",
            "title": "HYMN LIII. Devas."
          }
        ]
      },
      {
        "name": "O Heroes",
        "hymns": [
          {
            "key": "05053",
            "title": "HYMN LIII. Devas."
          }
        ]
      }
    ]
  },
  "created": 1638555166270,
  "updated": 1639023784533
}