{
  "key": "05061",
  "title": "RigVeda Hymn 05061",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LXI. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05061.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05060.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05062.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXI. Maruts.</h3>  \n<p>1. O HEROES lordliest of all, who are ye that have singly come<br> Forth from a region most remote?<br> 2. Where are your horses, where the reins? How came ye? how had ye the power?<br> Rein was on nose and seat on back.<br> 3 The whip is laid upon the flank. The heroes stretch their thighs apart,<br> Like women when the babe is born.<br> 4 Go ye, O Heroes, far away, ye bridegrooms with a lovely Spouse<br> That ye may warm you at the fire.<br> 5 May she gain cattle for her meed, hundreds of sheep and steeds and kine,<br> Who threw embracing arms around the hero whom gyavaiva praised.<br> 6 Yea, many a woman is more firm and better than the man who turns<br> Away from Gods, andoffers not.<br> 7 She who discerns the weak and worn, the man who thirsts and is in want<br> She sets her mind upon the Gods.<br> 8 And yet full many a one, unpraised, mean niggard, is entitled man:<br> Only in weregild is he such.<br> 9 And she, the young, the joyous-spirited, divulged the path to &#346;y&#257;va, yea, to me.<br> Two red steeds carried me to Purum&#299;lha's side, that sage of far-extended fame,<br> 10 Him who, like Vaidadasvi, like Taranta, hath bestowed on me<br> A hundred cows in liberal gift.<br> 11 They who are borne by rapid steeds, drinking the meath that gives delight,<br> They have attained high glories here.<br> 12 They by whose splendour both the worlds are over-spread they shine on cars<br> As the gold gleams above in heaven.<br> 13 That Marut band is ever young, borne on bright cars, unblamable,<br> Moving to victory, checked by none.<br> 14 Who knoweth, verily, of these where the All-shakers take delight,<br> Born, spotless, after sacred Law?<br> 15 Guides are ye, lovers of the song to mortal man through holy hymn,<br> And hearers when he cries for help.<br> 16 Do ye, destroyers of the foe, worshipful and exceeding bright,<br> Send down the treasures that we crave.<br> 17 OUrmya, bear thou far away to Darbhya this my hymn of praise,<br> Songs, Goddess, as if chariot-borne.<br> 18 From me to Rathaviti say, when he hath pressed the Soma juice,<br> The wish I had departeth not.<br> 19 This wealthy Rathaviti dwells among the people rich in kine,<br> Among the mountains, far withdrawn.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05062.htm\">Next: HYMN LXII. Mitra-Varu&#7751;a</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05061.html",
  "api": "json/hymns/05061.json",
  "data": {
    "key": "05061",
    "title": "HYMN LXI. Devas.",
    "describe": "O HEROES lordliest of all, who are ye that have singly come Forth from a region most remote?",
    "feecting": "p:O HEROES lordliest of all, who are ye that have singly come Forth from a region most remote?\np:Where are your horses, where the reins? How came ye? how had ye the power? Rein was on nose and seat on back.\np:The whip is laid upon the flank. The heroes stretch their thighs apart, like women when the babe is born.\np:Go ye, O Heroes, far away, ye bridegrooms with a lovely Spouse That y. May warm you at the fire.\np:May she gain cattle for her meed, hundreds of sheep and steeds and kine, who threw embracing arms around the hero whom gyavaiva praised.\np:Yea, many a woman is more firm and better than the man who turns Away from Devas, andoffers not.\np:She who discerns the weak and worn, the man who thirsts and is in want She sets her mind upon the Devas.\np:And yet full many a one, unpraised, mean niggard, is entitled man: Only in weregild is he such.\np:And she, the young, the joyous-spirited, divulged the path to Śyāva, yea, to me.\np: Two red steeds carried me to Purumīlha's side, that sage of far-extended fame,\r\np:Him who, like Vaidadasvi, like Taranta, hath bestowed on me A hundred cows in liberal gift.\np:They who are borne by rapid steeds, drinking the meath that gives delight, they have attained high glories here.\np:They by whose splendour both the worlds are over-spread they shine on cars As the gold gleams above in Heaven.\np:That Marut band is ever young, borne on bright cars, unblamable, Moving to victory, checked by none.\np:Who knoweth, verily, of these where the All-shakers take delight, Born, spotless, after sacred Law?\np:Guides are ye, lovers of the song to mortal man through holy hymn, and hearers when he cries for help.\np:Do ye, destroyers of the foe, worshipful and exceeding bright, Send down the treasures that we crave.\np:OUrmya, bear thou far away to Darbhya this my hymn of praise, Songs, Goddess, as if chariot-borne.\np:From me to Rathaviti say, when he hath pressed the Soma juice, the wish I had departeth not.\np:This wealthy Rathaviti dwells among the people rich in kine, Among the mountains, far withdrawn.",
    "meta": {
      "next": "05062",
      "previous": "05060",
      "book": "05",
      "original": "https://sacred-texts.com/hin/rigveda/rv05061.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv05061.htm"
    },
    "deities": [
      {
        "name": "O HEROES",
        "hymns": [
          {
            "key": "05061",
            "title": "HYMN LXI. Devas."
          },
          {
            "key": "05061",
            "title": "HYMN LXI. Devas."
          }
        ]
      }
    ]
  },
  "created": 1638555208527,
  "updated": 1667450403277
}