{
  "key": "05062",
  "title": "RigVeda Hymn 05062",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LXII. Mitra-Varu&#7751;a</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05062.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05061.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05063.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXII. Mitra-Varu&#7751;a</h3>  \n<p>1. BY your high Law firm order is established there where they loose for travel S&#363;rya's horses.<br> Ten hundred stood together: there I looked on this the most marvellous Deities' one chief glory.<br> 2 This, Mitra-Varu&#7751;a, is your special greatness: floods that stood there they with the days attracted.<br> Ye cause to flow all voices of the cowpen: your single chariotfelly hath rolled hither.<br> 3 O Mitra-Varu&#7751;a, ye by your greatness, both Kings, have firmly stablished earth and heaven,<br> Ye caused the cows to stream, the plants to flourish, and, scattering swift drops, sent down the rain-flood.<br> 4 Let your well-harnessed horses bear you hither: hitherward let them come with reins drawn tightly.<br> A covering cloud of sacred oil attends you, and your streams flow to us from days aforetime.<br> 5 To make the lustre wider and more famous, guarding the sacred grass with veneration,<br> Ye, Mitra-Varu&#7751;a, firm, strong, awe-inspiring, are seated on a throne amid oblations.<br> 6 With hands that shed no blood, guarding the pious, whom, Varuni3, ye save amid oblations.<br> Ye Twain, together, Kings of willing spirit, uphold dominion based on thousand pillars.<br> 7 Adorned with gold, its columns are of iron. in heaven it glitters like a whip for horses;<br> Or stablished on a field deep-spoiled and fruitful. So may we share the meath that loads your car-seat.<br> 8 Ye mount your car gold-hued at break of morning, and iron-pillared when the Sun is setting,<br> And from that place, O Varu&#7751;a and Mitra, behold infinity and limit~tion.<br> 9 Bountiful guardians of the world! the shelter that is impenetrable, strongest, flawless,<br> Aid us with that, O Varu&#7751;a and Mitra, and when we long to win may we be victors.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05063.htm\">Next: HYMN LXIII. Mitra-Varu&#7751;a.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05062.html",
  "api": "json/hymns/05062.json",
  "data": {
    "title": "HYMN LXII. Mitra-Varu&#7751;a",
    "describe": "BY your high Law firm order is established there where they loose for travel S&#363;",
    "feecting": "p:BY your high Law firm order is established there where they loose for travel S&#363;rya's horses.\np: Ten hundred stood together: there I looked on this the most marvellous Deities' one chief glory.\r\np:This, Mitra-Varu&#7751;a, is your special greatness: floods that stood there they with the days attracted. Ye cause to flow all voices of the cowpen: your single chariotfelly hath rolled hither.\np:O Mitra-Varu&#7751;a, ye by your greatness, both Kings, have firmly stablished Earth and Heaven, Ye caused the cows to stream, the plants to flourish, and, scattering swift drops, sent down the rain-flood.\np:Let your well-harnessed horses bear you hither: hitherward let them come with reins drawn tightly. A covering cloud of sacred oil attends you, and your streams flow to us from days aforetime.\np:To make the lustre wider and more famous, guarding the sacred grass with veneration, Ye, Mitra-Varu&#7751;a, firm, strong, awe-inspiring, are seated on a throne amid oblations.\np:With hands that shed no blood, guarding the pious, whom, Varuni3, ye save amid oblations. Ye Twain, together, Kings of willing spirit, uphold dominion based on thousand pillars.\np:Adorned with gold, its columns are of iron. in Heaven it glitters like a whip for horses; Or stablished on a field deep-spoiled and fruitful. May we share the meath that loads your car-seat.\np:Ye mount your car gold-hued at break of morning, and iron-pillared when the Sun is setting, and from that place, O Varu&#7751;a and Mitra, behold infinity and limit~tion.\np:Bountiful guardians of the world! the shelter that is impenetrable, strongest, flawless, Aid us with that, O Varu&#7751;a and Mitra, and when we long to wi. May we be victors.",
    "next": "05063",
    "previous": "05061",
    "book": "05"
  },
  "created": 1638555213809,
  "updated": 1638647018077
}