{
  "key": "05060",
  "title": "RigVeda Hymn 05060",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LX. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05060.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05059.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05061.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LX. Maruts.</h3>  \n<p>1. I LAUD with reverence the gracious Agni: here may he sit and part our meed among us.<br> As with spoil-seeking cars I bring oblation: turned rightward I will swell the Marut's, praise-song.<br> 2 The Maruts, yea, the Rudras, who have mounted their famous spotted deer and cars swift-moving,&#151;<br> Before you, fierce Ones! woods bow down in terror: Earth, even the mountain, trembles at your coming.<br> 3 Though vast and tall, the mountain is affrighted, the height of heaven is shaken at your roaring<br> When, armed with lances, ye are sporting, Maruts, and rush along together like the waters.<br> 4 They, like young suitors, sons of wealthy houses, have with their golden natures decked their bodies.<br> Strong on their cars, the lordly Ones, for glory, have set their splendours on their forms for ever.<br> 5 None being eldest, none among them youngest, as brothers they have grown to happy fortune.<br> May their Sire Rudra, young and deft, and P&#7771;&#347;ni pouring much milk, bring fair days to the Maruts.<br> 6 Whether, O blessed Maruts, ye be dwelling in highest, midmost, or in lowest heaven,<br> Thence, O ye Rudras, and thou also, Agni, notice the sacrificial food we offer.<br> 7 O Maruts, Lords of all, when Agni and when ye drive downward from sublimest heaven along the heights,<br> Shakers of all, rejoicing, slayers of the foe, give riches to the Soma-pressing worshipper.<br> 8 O Agni, with the Maruts as they gleam and sing, gathered in troop, rejoicing drink the Soma juice;<br> With these the living ones who cleanse and further all, joined with thy banner, O Vai&#347;v&#257;nara, from of old.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05061.htm\">Next: HYMN LXI. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05060.html",
  "api": "json/hymns/05060.json",
  "data": {
    "key": "05060",
    "title": "HYMN LX. Devas.",
    "describe": "I LAUD with reverence the gracious Agni: her.",
    "feecting": "p:I LAUD with reverence the gracious Agni: her. May he sit and part our meed among us.\np: As with spoil-seeking cars I bring oblation: turned rightward I will swell the Marut's, praise-song.\r\np:The Devas, yea, the Somas, who have mounted their famous spotted deer and cars swift-moving. Before you, fierce Ones! woods bow down in terror: Earth, even the mountain, trembles at your coming.\np:Though vast and tall, the mountain is affrighted, the height of Heaven is shaken at your roaring When, armed with lances, ye are sporting, Devas, and rush along together like the waters.\np:They, like young suitors, sons of wealthy houses, have with their golden natures decked their bodies. Strong on their cars, the lordly Ones, for glory, have set their splendours on their forms forever.\np:None being eldest, none among them youngest, as brothers they have grown to happy fortune. May their Sire Soma, young and deft, and Pṛśni pouring much milk, bring fair days to the Devas.\np:Whether, O blessed Devas, ye be dwelling in highest, midmost, or in lowest Heaven, thence, O ye Somas, and thou also, Agni, notice the sacred food we offer.\np:O Devas, Lords of all, when Agni and when ye drive downward from sublimest Heaven along the heights, Shakers of all, rejoicing, slayers of the foe, give riches to the Soma-pressing worshipper.\np:O Agni, with the Devas as they gleam and sing, gathered in troop, rejoicing drink the Soma juice; With these the living ones who cleanse and further all, joined with thy banner, O Vaiśvānara, from of old.",
    "meta": {
      "next": "05061",
      "previous": "05059",
      "book": "05",
      "source": "https://sacred-texts.com/hin/rigveda/rv05060.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv05060.htm"
    },
    "deities": [
      {
        "name": "O blessed",
        "hymns": [
          {
            "key": "05060",
            "title": "HYMN LX. Devas."
          }
        ]
      },
      {
        "name": "O ye ",
        "hymns": [
          {
            "key": "05060",
            "title": "HYMN LX. Devas."
          }
        ]
      },
      {
        "name": "O Devas",
        "hymns": [
          {
            "key": "05060",
            "title": "HYMN LX. Devas."
          }
        ]
      },
      {
        "name": "O Agni",
        "hymns": [
          {
            "key": "05060",
            "title": "HYMN LX. Devas."
          }
        ]
      },
      {
        "name": "O Vai",
        "hymns": [
          {
            "key": "05060",
            "title": "HYMN LX. Devas."
          }
        ]
      }
    ]
  },
  "created": 1638555203264,
  "updated": 1638830292299
}