{
  "key": "05078",
  "title": "RigVeda Hymn 05078",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LXXVIII. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05078.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05077.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05079.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXVIII. A&#347;vins.</h3>  \n<p>1. YE A&#347;vins, hither come to us: N&#257;satyas, be not disinclined.<br> Fly hither like two swans unto the juice we shed.<br> 2 O A&#347;vins, like a pair of deer, like two wild cattle to the mead:<br> Fly hither like two swans unto the juice we shed.<br> 3 O A&#347;vins rich in gifts, accept our sacrifice to prosper it:<br> Fly hither like two swans unto the juice we shed.<br> 4 As Atri when descending to the cavern called on you loudly like a wailing woman.<br> Ye came to him, O A&#347;vins, with the freshest and most auspicious fleetness of a falcon.<br> 5 Tree, part asunder like the side of her who bringeth forth a child.<br> Ye A&#347;vins, listen to my call: loose Saptavadhri from his bonds.<br> 6 For Saptavadhri, for the seer affrighted when he wept and wailed,<br> Ye, A&#347;vins, with your magic powers rent up the tree and shattered it.<br> 7 Like as the wind on every side ruffles a pool of lotuses,<br> So stir in thee the babe unborn, so may the ten-month babe descend.<br> 8 Like as the wind, like as the wood, like as the sea is set astir,<br> So also, ten-month babe, descend together with the after-birth.<br> 9 The child who hath for ten months' time been lying in his mother's side,&#151;<br> May he come forth alive, unharmed, yea, living from the living dame.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05079.htm\">Next: HYMN LXXIX. Dawn.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05078.html",
  "api": "json/hymns/05078.json",
  "data": {
    "title": "HYMN LXXVIII. A&#347;vins.",
    "describe": "YE A&#347;",
    "feecting": "p:YE A&#347;vins, hither come to us: N&#257;satyas, be not disinclined.\np: Fly hither like two swans unto the juice we shed.\r\np:O A&#347;vins, like a pair of deer, like two wild cattle to the mead: Fly hither like two swans unto the juice we shed.\np:O A&#347;vins rich in gifts, accept our offering to prosper it: Fly hither like two swans unto the juice we shed.\np:As Atri when descending to the cavern called on you loudly like a wailing woman. Ye came to him, O A&#347;vins, with the freshest and most auspicious fleetness of a falcon.\np:Tree, part asunder like the side of her who bringeth forth a child. Ye A&#347;vins, listen to my call: loose Saptavadhri from his bonds.\np:For Saptavadhri, for the seer affrighted when he wept and wailed, Ye, A&#347;vins, with your magic powers rent up the tree and shattered it.\np:Like as the wind on every side ruffles a pool of lotuses, So stir in thee the babe unborn, s. May the ten-month babe descend.\np:Like as the wind, like as the wood, like as the sea is set astir, So also, ten-month babe, descend together with the after-birth.\np:The child who hath for ten months' time been lying in his mother's side,&#151; May he come forth alive, unharmed, yea, living from the living dame.",
    "next": "05079",
    "previous": "05077",
    "book": "05"
  },
  "created": 1638555298914,
  "updated": 1638791591640
}