{
  "key": "05079",
  "title": "RigVeda Hymn 05079",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LXXIX. Dawn.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05079.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05078.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05080.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXIX. Dawn.</h3>  \n<p>1. O HEAVENLY Dawn, awaken us to ample opulence to-day<br> Even as thou hast wakened us with Satyasravas, Vayya's son, high-born! delightful with thy steeds!<br> 2 Daughter of Heaven, thou dawnedst on Sunitha Sucadratha's son,<br> So dawn thou on one mightier still, on Satyasravas, Vayya's son, high-born! delightful with thy steeds!<br> 3 So, bringing treasure, dawn to-day on us thou Daughter of the Sky,<br> As thou, O mightier yet. didst shine for Satyatravas, Vayya's son, high-born! delightful with thy steeds!<br> 4 Here round about thee are the priests who laud thee, Bright One, with their hymns,<br> And men with gifts, O Bounteous Dame, splendid with wealth and offering much, high-born! delightful with thy steeds!<br> 5 Whatever these thy bands perform to please thee or to win them wealth,<br> E&#146;en fain they gird us round and give rich gifts which ne&#146;er are reft away, high-born! delightful with thy steeds!<br> 6 Give to these wealthy patrons fame, O affluent Dawn, with hero sons,<br> To these our princes who have brought rich gifts ne&#146;er to be reft away, highborn! delightful with thy steeds!<br> 7 Bring lofty and resplendent fame, O thou munificent Dawn, to these<br> Our wealthy patrons who bestow rich gifts on us of steeds and kine, high-born! delightful with thy steeds!<br> 8 Bring us, O Daughter of the Sky, subsistence in our herds of kine,<br> Together with the sunbeams, with the shine of pure refulgent flames, highborn! delightful with thy steeds!<br> 9 O Daughter of the Sky, shine forth; delay not to perform thy task.<br> Let not the Sun with fervent heat consume thee like a robber foe, high-born! delightful with the steeds!<br> 10 So much, and more exceedingly, O Dawn, it suits thee to bestow,<br> Thou Radiant One who ceasest not to shine for those who sing thy praise, highborn! delightful with thy steeds!</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05080.htm\">Next: HYMN LXXX. Dawn.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05079.html",
  "api": "json/hymns/05079.json",
  "data": {
    "key": "05079",
    "title": "HYMN LXXIX. Dawn.",
    "describe": "O HEAVENLY Dawn, awaken us to ample opulence to-day Even as thou hast wakened us with Satyasravas, Vayya's son, high-born!",
    "feecting": "p:O HEAVENLY Dawn, awaken us to ample opulence to-day Even as thou hast wakened us with Satyasravas, Vayya's son, high-born! delightful with thy steeds!\np:Daughter of Heaven, thou dawnedst on Sunitha Sucadratha's son, So dawn thou on one mightier still, on Satyasravas, Vayya's son, high-born! delightful with thy steeds!\np:So, bringing treasure, dawn to-day on us thou Daughter of the Sky, as thou, O mightier yet. didst shine for Satyatravas, Vayya's son, high-born! delightful with thy steeds!\np:Here round about thee are the monks who laud thee, Bright One, with their hymns, and men with gifts, O Bounteous Dame, splendid with wealth and offering much, high-born! delightful with thy steeds!\np:Whatever these thy bands perform to please thee or to win them wealth, E’en fain they gird us round and give rich gifts which ne’er are reft away, high-born! delightful with thy steeds!\np:Give to these wealthy patrons fame, O affluent Dawn, with hero sons, to these our princes who have brought rich gifts ne’er to be reft away, highborn! delightful with thy steeds!\np:Bring lofty and resplendent fame, O thou munificent Dawn, to these Our wealthy patrons who bestow rich gifts on us of steeds and kine, high-born! delightful with thy steeds!\np:Bring us, subsistence in our herds of kine, together with the sunbeams, with the shine of pure refulgent flames, highborn! delightful with thy steeds!\np:O Daughter of the Sky, shine forth; delay not to perform thy task.\np: Let not the Sun with fervent heat consume thee like a robber foe, high-born! delightful with the steeds!\r\np:So much, and more exceedingly, O Dawn, it suits thee to bestow, Thou Radiant One who ceasest not to shine for those who sing thy praise, highborn! delightful with thy steeds!",
    "meta": {
      "next": "05080",
      "previous": "05078",
      "book": "05",
      "original": "https://sacred-texts.com/hin/rigveda/rv05079.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv05079.htm"
    },
    "deities": [
      {
        "name": "O HEAVENLY",
        "hymns": [
          {
            "key": "05079",
            "title": "HYMN LXXIX. Dawn."
          }
        ]
      },
      {
        "name": "O mightier",
        "hymns": [
          {
            "key": "05079",
            "title": "HYMN LXXIX. Dawn."
          }
        ]
      },
      {
        "name": "O Bounteous",
        "hymns": [
          {
            "key": "05079",
            "title": "HYMN LXXIX. Dawn."
          }
        ]
      },
      {
        "name": "O affluent",
        "hymns": [
          {
            "key": "05079",
            "title": "HYMN LXXIX. Dawn."
          }
        ]
      },
      {
        "name": "O thou",
        "hymns": [
          {
            "key": "05079",
            "title": "HYMN LXXIX. Dawn."
          }
        ]
      },
      {
        "name": "O Daughter",
        "hymns": [
          {
            "key": "05079",
            "title": "HYMN LXXIX. Dawn."
          }
        ]
      },
      {
        "name": "O Dawn",
        "hymns": [
          {
            "key": "05079",
            "title": "HYMN LXXIX. Dawn."
          }
        ]
      }
    ]
  },
  "created": 1638555304190,
  "updated": 1639023784576
}