{
  "key": "05073",
  "title": "RigVeda Hymn 05073",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LXXIII. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05073.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05072.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05074.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXIII. A&#347;vins.</h3>  \n<p>1. WHETHER, O A&#347;vins, ye this day be far remote or near at hand,<br> In many spots or in mid-air, come hither, Lords of ample wealth.<br> 2 These here, who show o&#146;er widest space, bringing full many a wondrous act,<br> Resistless, lovingly I seek, I call the Mightiest to enjoy.<br> 3 Another beauteous wheel have ye fixed there to decorate your car.<br> With others through the realms ye roam in might unto the neighbouring tribes.<br> 4 That deed of yours that is extolled, Visvas! hath all been done with this.<br> Born otherwise, and spotless, ye have entered kinship's bonds with us.<br> 5 When S&#363;rya mounted on your car that rolls for ever rapidly,<br> Birds of red hue were round about and burning splendours compassed you.<br> 6 Atri bethinks himself of you, O Heroes, with a friendly mind,<br> What time, N&#257;satyas, with his mouth he stirs the spotless flame for you.<br> 7 Strong is your swiftly moving steed, famed his exertion in the course<br> When by your great deeds, A&#347;vins, Chiefs, Atri is brought to us again.<br> 8 Lovers of sweetness, Rudras, she who streams with sweetness waits on you.<br> When ye have travelled through the seas men bring you gifts of well-dressed food.<br> 9 A&#347;vins, with truth they call you Twain bestowers of felicity;<br> At sacrifice most prompt to hear, most gracious ye at sacrifice.<br> 10 Most pleasing to the A&#347;vins be these prayers which magnify their might,<br> Which we have fashioned, even as cars high reverence have we spoken forth.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05074.htm\">Next: HYMN LXXIV. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05073.html",
  "api": "json/hymns/05073.json",
  "data": {
    "title": "HYMN LXXIII. A&#347;vins.",
    "describe": "WHETHER, O A&#347;",
    "feecting": "p:WHETHER, O A&#347;vins, ye this day be far remote or near at hand, In many spots or in mid-air, come hither, Lords of ample wealth.\np:These here, who show o&#146;er widest space, bringing full many a wondrous act, Resistless, lovingly I seek, I call the Mightiest to enjoy.\np:Another beauteous wheel have ye fixed there to decorate your car.\np: With others through the realms ye roam in might unto the neighbouring tribes.\r\np:That deed of yours that is extolled, Visvas! hath all been done with this. Born otherwise, and spotless, ye have entered kinship's bonds with us.\np:When S&#363;rya mounted on your car that rolls forever rapidly, Birds of red hue were round about and burning splendours compassed you.\np:Atri bethinks himself of you, O Heroes, with a friendly mind, What time, N&#257;satyas, with his mouth he stirs the spotless flame for you.\np:Strong is your swiftly moving steed, famed his exertion in the course When by your great deeds, A&#347;vins, Chiefs, Atri is brought to us again.\np:Lovers of sweetness, Somas, she who streams with sweetness waits on you. When ye have travelled through the seas men bring you gifts of well-dressed food.\np:A&#347;vins, with truth they call you Twain bestowers of felicity; At offering most prompt to hear, most gracious ye at offering.\np:Most pleasing to the A&#347;vins be these prayers which magnify their might, Which we have fashioned, even as cars high reverence have we spoken forth.",
    "next": "05074",
    "previous": "05072",
    "book": "05"
  },
  "created": 1638555272553,
  "updated": 1638647018088
}