{
  "key": "05080",
  "title": "RigVeda Hymn 05080",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LXXX. Dawn.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05080.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05079.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05081.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXX. Dawn.</h3>  \n<p>1. THE singers welcome with their hymns and praises the Goddess Dawn who bringeth in the sunlight,<br> Sublime, by Law true to eternal Order, bright on her path, red-tinted, far-refulgent.<br> 2 She comes in front, fair, rousing up the people, making the pathways easy to be travelled.<br> High, on her lofty chariot, all-impelling, Dawn gives her splendour at the days' beginning.<br> 3 She, harnessing her car with purple oxen. injuring none, hath brought perpetual riches.<br> Opening paths to happiness, the Goddess shines, praised by all, giver of every blessing.<br> 4 With changing tints she gleams in double splendour while from the eastward she displays her body.<br> She travels perfectly the path of Order, nor fails to reach, as one who knows, the quarters.<br> 5 As conscious that her limbs are bright with bathing, she stands, as &#146;twere, erect that we may see her.<br> Driving away malignity and darkness, Dawn, Child of Heaven, hath come to us with lustre.<br> 6 The Daughter of the Sky, like some chaste woman, bends, opposite to men, her forehead downward.<br> The Maid, disclosing boons to him who worships, hath brought again the daylight as aforetime.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05081.htm\">Next: HYMN LXXXI. Savitar.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/05080.html",
  "api": "json/hymns/05080.json",
  "data": {
    "key": "05080",
    "title": "HYMN LXXX. Dawn.",
    "describe": "THE singers welcome with their hymns and praises the Goddess Dawn who bringeth in the sunlight, Sublime, by Law true to eternal Order, bright on her path, red-tinted, far-refulgent.",
    "feecting": "p:THE singers welcome with their hymns and praises the Goddess Dawn who bringeth in the sunlight, Sublime, by Law true to eternal Order, bright on her path, red-tinted, far-refulgent.\np:She comes in front, fair, rousing up the people, making the pathways easy to be travelled.\np: High, on her lofty chariot, all-impelling, Dawn gives her splendour at the days' beginning.\r\np:She, harnessing her car with purple oxen. injuring none, hath brought perpetual riches. Opening paths to happinessdess shines, praised by all, giver of every blessing.\np:With changing tints she gleams in double splendour while from the eastward she displays her body. She travels perfectly the path of Order, nor fails to reach, as one who knows, the quarters.\np:As conscious that her limbs are bright with bathing, she stands, as ’twere, erect that we may see her. Driving away malignity and darkness, Dawn, Child of Heaven, hath come to us with lustre.\np:The Daughter of the Sky, like some chaste woman, bends, opposite to men, her forehead downward. The Maid, disclosing boons to him who worships, hath brought again the daylight as aforetime.",
    "meta": {
      "next": "05081",
      "previous": "05079",
      "book": "05",
      "original": "https://sacred-texts.com/hin/rigveda/rv05080.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv05080.htm"
    },
    "deities": []
  },
  "created": 1638555309454,
  "updated": 1667442752896
}