{
  "key": "05085",
  "title": "RigVeda Hymn 05085",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 5: HYMN LXXXV. Varu&#7751;a.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv05085.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi05.htm\">Rig-Veda, Book 5 Index</A><BR>\n&nbsp;\n<A HREF=\"rv05084.htm\">Previous</A>&nbsp;\n<A HREF=\"rv05086.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXV. Varu&#7751;a.</h3>  \n<p>1. SING forth a hymn sublime and solemn, grateful to glorious. Varu&#7751;a, imperial Ruler,<br> Who hath struck out, like one who slays the victim, earth as a skin to spread in front of S&#363;rya.<br> 2 In the tree-tops the air he hath extended, put milk in kine and vigorous speed in horses,<br> Set intellect in hearts, fire in the waters, Siurya in heaven and Soma on the mountain.<br> 3 Varu&#7751;a lets the big cask, opening downward, flow through the heaven and earth and air's mid-region.<br> Therewith the universe's Sovran waters earth as the shower of rain bedews the barley.<br> 4 When Varu&#7751;a is fain for milk he moistens the sky, the land, and earth to her foundation.<br> Then straight the mountains clothe them in the rain-cloud: the Heroes, putting forth their vigour, loose them.<br> 5 I will declare this mighty deed of magic, of glorious Varu&#7751;a the Lord Immortal,<br> Who standing in the firmament hath meted the earth out with the Sun as with a measure.<br> 6 None, verily, hath ever let or hindered this the most wise God's mighty deed of magic,<br> Whereby with all their flood, the lucid rivers fill not one sea wherein they pour their waters.<br> 7 If we have sinned against the man who loves us, have ever wronged a brother, friend, or comrade,<br> The neighbour ever with us, or a stranger, O Varu&#7751;a, remove from us the trespass.<br> 8 If we, as gamesters cheat at play, have cheated, done wrong unwittingly or sinned of purpose,<br> Cast all these sins away like loosened fetters, and, Varu&#7751;a let us be thine own beloved.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv05086.htm\">Next: HYMN LXXXVI. Indra-Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/05085.html",
  "api": "hymns/05085json",
  "data": {
    "title": "HYMN LXXXV. Indra.",
    "describe": "SING forth a hymn sublime and solemn, grateful to glorious.",
    "feecting": "p:SING forth a hymn sublime and solemn, grateful to glorious. Indra, imperial Ruler, who hath struck out, like one who subdues the victim, Earth as a skin to spread in front of Sūrya.\np:In the tree-tops the air he hath extended, put milk in kine and vigorous speed in horses, Set intellect in hearts, fire in the waters, Siurya in Heaven and Soma on the mountain.\np:Indra lets the big cask, opening downward, flow through the Heaven and Earth and air's mid-region.\np: Therewith the universe's Sovran waters Earth as the shower of rain bedews the barley.\r\np:When Indra is fain for milk he moistens the sky, the land, and Earth to her foundation. Then straight the mountains clothe them in the rain-cloud: the Heroes, putting forth their vigour, loose them.\np:I will declare this mighty deed of magic, of glorious Indra the Lord Immortal, who standing in the Firmament hath meted the Earth out with the Sun as with a measure.\np:None, verily, hath ever let or hindered this the most wise Deva's mighty deed of magic, Whereby with all their flood, the lucid rivers fill not one sea wherein they pour their waters.\np:If we have sinned against the man who loves us, have ever wronged a brother, friend, or comrade, the neighbour ever with us, or a stranger, O Indra, remove from us the trespass.\np:If we, as gamesters cheat at play, have cheated, done wrong unwittingly or sinned of purpose, Cast all these sins away like loosened fetters, and, Indra let us be thine own beloved.",
    "next": "05086",
    "previous": "05084",
    "book": "05"
  },
  "created": 1638555336048
}