{
  "key": "06005",
  "title": "RigVeda Hymn 06005",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN V. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06005.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06004.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06006.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN V. Agni.</h3>  \n<p>1. I INVOCATE your Son of Strength, the Youthful, with hymns, the Youngest God, whose speech is guileless;<br> Sage who sends wealth comprising every treasure, bringer of many boons, devoid of malice.<br> 2 At eve and morn thy pious servants bring thee their precious gifts, O Priest of many aspects,<br> On whom, the Purifier, all things living as on firm. ground their happiness have stablished.<br> 3 Thou from of old hast dwelt among these people, by mental power the charioteer of blessings.<br> Hence sendest thou, O sapient J&#257;tavedas, to him who serves thee treasures in succession.<br> 4 Agni, whoever secretly attacks us, the neighbour, thou with Mitra's might! who harms us,<br> Burn him with thine own Steers for ever youthful, burning with burning heat, thou fiercest burner.<br> 5 He who serves thee with sacrifice and fuel, with hymn, O Son of Strength, and chanted praises,<br> Shines out, Immortal! in the midst of mortals, a sage, with wealth, with splendour and with glory.<br> 6 Do this, O Agni, when we urge thee, quickly, triumphant in thy might subdue our foemen.<br> When thou art praised with words and decked with brightness, accept this chanted hymn, the singer's worship.<br> 7 Help us, that we may gain this wish, O Agni, gain riches, Wealthy One! with store of heroes.<br> Desiring strength from thee may we be strengthened, and win, Eternal! thine eternal glory.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06006.htm\">Next: HYMN VI. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06005.html",
  "api": "json/hymns/06005.json",
  "data": {
    "title": "HYMN V. Agni.",
    "describe": "I INVOCATE your Son of Strength, the Youthful, with hymns, the Youngest Deva, whose speech is guileless;",
    "feecting": "p:I INVOCATE your Son of Strength, the Youthful, with hymns, the Youngest Deva, whose speech is guileless; Sage who sends wealth comprising every treasure, bringer of many boons, devoid of malice.\np:At eve and morn thy pious servants bring thee their precious gifts, O Monk of many aspects, On whom, the Purifier, all things living as on firm. ground their happiness have stablished.\np:Thou from of old hast dwelt among these people, by mental power the charioteer of blessings.\np: Hence sendest thou, O sapient J&#257;tavedas, to him who serves thee treasures in succession.\r\np:Agni, whoever secretly attacks us, the neighbour, thou with Mitra's might! who harms us, Burn him with thine own Steers forever youthful, burning with burning heat, thou fiercest burner.\np:He who serves thee with offering and fuel, with hymn, O Son of Strength, and chanted praises. Shines out, Immortal! in the midst of mortals, a sage, with wealth, with splendour and with glory.\np:Do this, O Agni, when we urge thee, quickly, triumphant in thy might subdue our foemen. When thou art praised with words and decked with brightness, accept this chanted hymn, the singer's worship.\np:Help us, that we may gain this wish, O Agni, gain riches, Wealthy One! with store of heroes. Desiring strength from the, may we be strengthened, and win, Eternal! thine eternal glory.",
    "next": "06006",
    "previous": "06004",
    "book": "06"
  },
  "created": 1638555372912,
  "updated": 1638791780691
}