{
  "key": "06009",
  "title": "RigVeda Hymn 06009",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN IX. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06009.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06008.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06010.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN IX. Agni.</h3>  \n<p>1. ONE half of day is dark, and bright the other: both atmospheres move on by sage devices.<br> Agni Vai&#347;v&#257;nara, when born as Sovran, hath with his lustre overcome the darkness.<br> 2 I know not either warp or woof, I know not the web they weave when moving to the contest.<br> Whose son shall here speak words that must be spoken without assistance from the Father near him?<br> 3 For both the warp and woof he understandeth, and in due time shall speak what should be spoken,<br> Who knoweth as the immortal world's Protector, descending, seeing with no aid from other.<br> 4 He is the Priest, the first of all: behold him. Mid mortal men he is the light immortal.<br> Here was he born, firm-seated in his station Immortal, ever waxing in his body.<br> 5 A firm light hath been set for men to look on: among all things that fly the mind is swiftest.<br> All Gods of one accord, with one intention, move unobstructed to a single purpose.<br> 6 Mine ears unclose to hear, mine eye to see him; the light that harbours in my spirit broadens.<br> Far roams my mind whose thoughts are in the distance. What shall I speak, what shall I now imagine?<br> 7 All the Gods bowed them down in fear before thee, Agni, when thou wast dwelling in the darkness.<br> Vai&#347;v&#257;nara be gracious to assist us, may the Immortal favour us and help us.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06010.htm\">Next: HYMN X. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06009.html",
  "api": "json/hymns/06009.json",
  "data": {
    "key": "06009",
    "title": "HYMN IX. Agni.",
    "describe": "ONE half of day is dark, and bright the other: both atmospheres move on by sage devices.",
    "feecting": "p:ONE half of day is dark, and bright the other: both atmospheres move on by sage devices.\np: Agni Vaiśvānara, when born as Sovran, hath with his lustre overcome the darkness.\r\np:I know not either warp or woof, I know not the web they weave when moving to the contest. Whose son shall here speak words that must be spoken without assistance from the Father near him?\np:For both the warp and woof he understandeth, and in due time shall speak what should be spoken, who knoweth as the immortal world's Protector, descending, seeing with no aid from other.\np:He is the Monk, the first of all: behold him. Mid mortal men he is the light immortal. Here was he born, firm-seated in his station Immortal, ever waxing in his body.\np:A firm light hath been set for men to look on: among all things that fly the mind is swiftest. All Devas of one accord, with one intention, move unobstructed to a single purpose.\np:Mine ears unclose to hear, mine eye to see him; the light that harbours in my spirit broadens. Far roams my mind whose thoughts are in the distance. What shall I speak, what shall I now imagine?\np:All the Devas bowed them down in fear before thee, Agni, when thou wast dwelling in the darkness. Vaiśvānara be gracious to assist us. May the Immortal favour us and help us.",
    "meta": {
      "next": "06010",
      "previous": "06008",
      "book": "06",
      "original": "https://sacred-texts.com/hin/rigveda/rv06009.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv06009.htm"
    },
    "deities": []
  },
  "created": 1638555393921,
  "updated": 1667442752929
}