{
  "key": "06018",
  "title": "RigVeda Hymn 06018",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN XVIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06018.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06017.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06019.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XVIII. Indra.</h3>  \n<p>1. GLORIFY him whose might is all-surpassing, Indra the much-invoked who fights uninjured.<br> Magnify with these songs the never-vanquished, the Strong, the Bull of men, the Mighty Victor.<br> 2 He, Champion, Hero, Warrior, Lord of battles, impetuous, loudly roaring, great destroyer,<br> Who whirls the dust on high, alone, oerthrower, hath made all races of mankind his subjects.<br> 3 Thou, thou alone, hast tamed the Dasyus; singly thou hast subdued the people for the &#256;rya.<br> In this, or is it not, thine hero exploit, Indra? Declare it at the proper season.<br> 4 For true, I deem, thy strength is, thine the Mighty, thine, O Most Potent, thine the Conquering Victor;<br> Strong, of the strong, Most Mighty, of the mighty, thine, driver of the churl to acts of bounty.<br> 5 Be this our ancient bond of friendship with you and with A&#7749;girases here who speak of Vala.<br> Thou, Wondrous, Shaker of things firm, didst smite him in his fresh strength, and force his doors and castles.<br> 6 With holy thoughts must he be called, the Mighty, showing his power in the great fight with V&#7771;tra.<br> He must be called to give us seed and offspring, the Thunderer must he moved and sped to battle.<br> 7 He in his might, with name that lives for ever, hath far surpassed all human generations.<br> He, most heroic, hath his home with splendour, with glory and with riches and with valour.<br> 8 Stranger to guile, who ne&#146;er was false or faithless, bearing a name that may be well remembered,<br> Indra crushed Cumuri, Dhuni, &#346;ambara, Pipru, and &#346;u&#7779;&#7751;a, that their castles fell in ruin.<br> 9 With saving might that must be praised and lauded, Indra, ascend thy car to smite down V&#7771;tra.<br> In thy right hand hold fast thy bolt of thunder, and weaken, Bounteous Lord, his art and magic.<br> 10 As Agni, as the dart burns the dry forest, like the dread shaft burn down the fiends, O Indra;<br> Thou who with high deep-reaching spear hast broken, hast covered over mischief and destroyed it.<br> 11 With wealth, by thousand paths come hither, Agni, paths that bring ample strength, O thou Most Splendid.<br> Come, Son of Strength, o&#146;er whom, Invoked of many! the godless hath no power to keep thee distant.<br> 12 From heaven, from earth is bruited forth the greatness of him the firm, the fiery, the resplendent.<br> No foe hath he, no counterpart, no refuge is there from him the Conqueror full of wisdom<br> 13 This day the deed that thou hast done is famous, when thou, for him, with many thousand others<br> Laidest low Kutsa, &#256;yu, Atithigva, and boldly didst deliver T&#363;rvay&#257;&#7751;a.<br> 14 In thee, O God, the wisest of the Sages, all Gods were joyful when thou slewest Ahi.<br> When lauded for thyself, thou gavest freedom to sore-afflicted Heaven and to the people.<br> 15 This power of thine both heaven and earth acknowledge, the deathless Gods acknowledge it, O Indra.<br> Do what thou ne&#146;er hast done, O Mighty Worker: beget a new hymn at thy sacrifices.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06019.htm\">Next: HYMN XIX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06018.html",
  "api": "json/hymns/06018.json",
  "data": {
    "key": "06018",
    "title": "HYMN XVIII. Indra.",
    "describe": "GLORIFY him whose might is all-surpassing, Indra the much-invoked who fights uninjured.",
    "feecting": "p:GLORIFY him whose might is all-surpassing, Indra the much-invoked who fights uninjured.\np: Magnify with these songs the never-vanquished, the Strong, the Bull of men, the Mighty Victor.\r\np:He, Champion. Hero, Warrior, Lord of battles, impetuous, loudly roaring, great destroyer, who whirls the dust on high, alone, oerthrower, hath made all races of mankind his subjects.\np:Thou, thou alone, hast tamed the Dasyus; singly thou hast subdued the people for the Ārya. In this, or is it not, thine hero exploit, Indra? Declare it at the proper season.\np:For true, I deem, thy strength is, thine the Mighty, thine, O Most Potent, thine the Conquering Victor; Strong, of the strong, most Mighty, of the mighty, thine, driver of the churl to acts of bounty.\np:Be this our ancient bond of friendship with you and with Aṅgirases here who speak of Vala. Thou, Wondrous, Shaker of things firm, didst smite him in his fresh strength, and force his doors and castles.\np:With holy thoughts must he be called, the Mighty, showing his power in the great fight with Vṛtra. He must be called to give us seed and offspring, the Thunderer must he moved and sped to battle.\np:He in his might, with name that lives forever, hath far surpassed all human generations. He, most heroic, hath his home with splendour, with glory and with riches and with valour.\np:Stranger to guile, who ne’er was false or faithless, bearing a name tha. May be well remembered, Indra crushed Cumuri, Dhuni, Śambara, Pipru, and Śuṣṇa, that their castles fell in ruin.\np:With saving might that must be praised and lauded, Indra, ascend thy car to smite down Vṛtra. In thy right hand hold fast thy bolt of thunder, and weaken, Bounteous Lord, his art and magic.\np:As Agni, as the dart burns the dry forest, like the dread shaft burn down the fiends, O Indra; Thou who with high deep-reaching spear hast broken, hast covered over mischief and conquered it.\np:With wealth, by thousand paths come hither, Agni, paths that bring ample strength, O thou Most Splendid. Come, Son of Strength, o’er whom, invoked of many! the godless hath no power to keep thee distant.\np:From Heaven, from Earth is bruited forth the greatness of him the firm, the fiery, the resplendent. No foe hath he, no counterpart, no refuge is there from him the Conqueror full of wisdom\np:This day the deed that thou hast done is famous, when thou, for him, with many thousand others Laidest low Kutsa, Āyu, Atithigva, and boldly didst deliver Tūrvayāṇa.\np:In thee, the wisest of the Sages, all Devas were joyful when thou slewest Ahi. When lauded for thyself, thou gavest freedom to sore-afflicted Heaven and to the people.\np:This power of thine both Heaven and Earth acknowledge, the deathless Devas acknowledge it, O Indra. Do what thou ne’er hast done, O Mighty Worker: beget a new hymn at thy offers.",
    "meta": {
      "next": "06019",
      "previous": "06017",
      "book": "06",
      "source": "https://sacred-texts.com/hin/rigveda/rv06018.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv06018.htm"
    },
    "deities": [
      {
        "name": "O Most",
        "hymns": [
          {
            "key": "06018",
            "title": "HYMN XVIII. Indra."
          }
        ]
      },
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "06018",
            "title": "HYMN XVIII. Indra."
          },
          {
            "key": "06018",
            "title": "HYMN XVIII. Indra."
          }
        ]
      },
      {
        "name": "O thou",
        "hymns": [
          {
            "key": "06018",
            "title": "HYMN XVIII. Indra."
          }
        ]
      },
      {
        "name": "O Mighty",
        "hymns": [
          {
            "key": "06018",
            "title": "HYMN XVIII. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638555441482,
  "updated": 1638830292366
}