{
  "key": "06013",
  "title": "RigVeda Hymn 06013",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN XIII. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06013.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06012.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06014.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XIII. Agni.</h3>  \n<p>1. FROM thee, as branches from a tree, O Agni, from thee, Auspicious God! spring all our blessings-<br> Wealth swiftly, strength in battle with our foemen, the rain besought of heaven, the flow of waters.<br> 2 Thou art our Bhaga to send wealth thou dwellest, like circumambient air, with wondrous splendour.<br> Friend art thou of the lofty Law, like Mitra, Controller, Agni! God! of many a blessing.<br> 3 Agni! the hero slays with might his foeman; the singer bears away the Pa&#7751;i's booty-<br> Even he whom thou, Sage, born in Law, incitest by wealth, accordant with the Child of Waters.<br> 4 The man who, Son of Strength 1 with sacrifices, hymns, lauds, attracts thy fervour to the altar,<br> Enjoys each precious thing, O God, O Agni, gains wealth of corn and is the lord of treasures.<br> 5 Grant, Son of Strength, to men for their subsistence such things as bring high fame and hero children.<br> For thou with might givest much food in cattle even to the wicked wolf when he is hungry.<br> 6 Eloquent, Son of Strength, Most Mighty, Agni, vouchsafe us seed and offspring, full of vigour.<br> May I by all my songs obtain abundance. May brave sons gladden us through a hundred winters.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06014.htm\">Next: HYMN XIV. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06013.html",
  "api": "json/hymns/06013.json",
  "data": {
    "title": "HYMN XIII. Agni.",
    "describe": "FROM thee, as branches from a tree, O Agni, from thee, Auspicious God!",
    "feecting": "p:FROM thee, as branches from a tree, O Agni, from thee, Auspicious God! spring all our blessings- Wealth swiftly, strength in battle with our foemen, the rain besought of Heaven, the flow of waters.\np:Thou art our Bhaga to send wealth thou dwellest, like circumambient air, with wondrous splendour.\np: Friend art thou of the lofty Law, like Mitra, Controller, Agni! God! of many a blessing.\r\np:Agni! the hero subdues with might his foeman; the singer bears away the Pa&#7751;i's booty- Even he whom thou, Sage, born in Law, incitest by wealth, accordant with the Child of Waters.\np:The man who, Son of Strength 1 with offers, hymns, lauds, attracts thy fervour to the altar, Enjoys each precious thing, O Agni, gains wealth of corn and is the lord of treasures.\np:Grant, Son of Strength, to men for their subsistence such things as bring high fame and hero children. For thou with might givest much food in cattle even to the wicked wolf when he is hungry.\np:Eloquent, Son of Strength, most Mighty, Agni, vouchsafe us seed and offspring, full of vigour. May I by all my songs obtain abundance. May brave sons gladden us through a hundred winters.",
    "next": "06014",
    "previous": "06012",
    "book": "06"
  },
  "created": 1638555415208,
  "updated": 1638792007860
}