{
  "key": "06024",
  "title": "RigVeda Hymn 06024",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN XXIV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06024.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06023.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06025.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXIV. Indra.</h3>  \n<p>1. STRONG rapturous joy, praise, glory are with Indra: impetuous God, he quaffs the juice of Soma:<br> That Maghavan whom men must laud with singing, Heaven-dweller, King of songs, whose help is lasting.<br> 2 He, Friend of man, most wise, victorious Hero, hears, with far-reaching aid, the singer call him.<br> Excellent, Praise of Men, the bard's Supporter, Strong, he gives strength, extolled in holy synod.<br> 3 The lofty axle of thy wheels, O Hero, is not surpassed by heaven and earth in greatness.<br> Like branches of a tree, Invoked of many manifold aids spring forth from thee, O Indra.<br> 4 Strong Lord, thine energies, endowed with vigour, are like the paths of kine converging homeward.<br> Like bonds of cord, Indra, that bind the younglings, no bonds are they, O thou of boundless bounty.<br> 5 One act to-day, another act tomorrow oft Indra makes what is not yet existeni.<br> Here have we Mitra, Varu&#7751;a, and P&#363;&#7779;an to overcome the foeman's domination.<br> 6 By song and sacrifice men brought the waters from thee, as from a mountain's ridge, O Indra.<br> Urging thy might, with these fair lauds they seek thee, O theme of song, as horses rush tobattle.<br> 7 That Indra whom nor months nor autumn seasons wither with age, nor fleeting days enfeeble,&#151;<br> Still may his body Wax, e&#146;en now so mighty, glorified by the lauds and hymns that praise him.<br> 8 Extolled, he bends not to the strong, the steadfast, nor to the bold incited by the Dasyu.<br> High mountains are as level plains to Indra: even in the deep he finds firm ground to rest on.<br> 9 Impetuous Speeder through all depth and distance, give strengthening food, thou drinker of the juices.<br> Stand up erect to help us, unreluctant, what time the gloom of night brightens to morning.<br> 10 Hasting to help, come hither and protect him, keep him from harm when he is here, O Indra.<br> At home, abroad, from injury preserve him. May brave sons gladden us through a hundred winters.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06025.htm\">Next: HYMN XXV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06024.html",
  "api": "json/hymns/06024.json",
  "data": {
    "title": "HYMN XXIV. Indra.",
    "describe": "STRONG rapturous joy, praise, glory are with Indra: impetuous Deva, he quaffs the juice of Soma: That Indra whom men must laud with singing.",
    "feecting": "p:STRONG rapturous joy, praise, glory are with Indra: impetuous Deva, he quaffs the juice of Soma: That Indra whom men must laud with singing. Heaven-dweller, King of songs, whose help is lasting.\np:He, Friend of man, most wise, victorious Hero, hears, with far-reaching aid, the singer call him.\np: Excellent, Praise of Men, the bard's Supporter, Strong, he gives strength, extolled in holy synod.\r\np:The lofty axle of thy wheels, O Hero, is not surpassed by Heaven and Earth in greatness. Like branches of a tree, invoked of many manifold aids spring forth from thee, O Indra.\np:Strong Lord, thine energies, endowed with vigour, are like the paths of kine converging homeward. Like bonds of cord, Indra, that bind the younglings, no bonds are they, O thou of boundless bounty.\np:One act to-day, another act tomorrow oft Indra makes what is not yet existeni. Here have we Mitra, Varu&#7751;a, and P&#363;&#7779;an to overcome the foeman's domination.\np:By song and offering men brought the waters from thee, as from a mountain's ridge, O Indra. Urging thy might, with these fair lauds they seek thee, O theme of song, as horses rush tobattle.\np:That Indra whom nor months nor autumn seasons wither with age, nor fleeting days enfeeble,&#151; Stil. May his body Wax, e&#146;en now so mighty, glorified by the lauds and hymns that praise him.\np:Extolled, he bends not to the strong, the steadfast, nor to the bold incited by the Dasyu. High mountains are as level plains to Indra: even in the deep he finds firm ground to rest on.\np:Impetuous Speeder through all depth and distance, give strengthening food, thou drinker of the juices. Stand up erect to help us, unreluctant, what time the gloom of night brightens to morning.\np:Hasting to help, come hither and protect him, keep him from harm when he is here, O Indra. At home, abroad, from injury preserve him. May brave sons gladden us through a hundred winters.",
    "next": "06025",
    "previous": "06023",
    "book": "06"
  },
  "created": 1638555473251,
  "updated": 1638791591682
}