{
  "key": "06026",
  "title": "RigVeda Hymn 06026",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN XXVI. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06026.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06025.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06027.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXVI. Indra.</h3>  \n<p>1. O INDRA, hear us. Raining down the Soma, we call on thee to win us mighty valour.<br> Give us strong succour on the day of trial, when the tribes gather on the field of battle.<br> 2 The warrior, son of warrior sire, invokes thee, to gain great strength that may be won as booty:<br> To thee, the brave man's Lord, the fiends' subduer, he looks when fighting hand to hand for cattle.<br> 3 Thou didst impel the sage to win the daylight, didst ruin &#346;u&#7779;&#7751;a for the pious Kutsa.<br> The invulnerable demon's head thou clavest when thou wouldst win the praise of Atithigva.<br> 4 The lofty battle-car thou broughtest forward; thou holpest Dasadyu the strong when fighting.<br> Along with Vetasu thou slewest Tugra, and madest Tuji strong, who praised thee, Indra.<br> 5 Thou madest good the laud, what time thou rentest a hundred thousand fighting foes, O Hero,<br> Slewest the D&#257;sa &#346;ambara of the mountain, and with strange aids didst succour Divod&#257;sa.<br> 6 Made glad with Soma-draughts and faith, thou sentest Cumuri to his sleep, to please Dabh&#299;ti.<br> Thou, kindly giving Raji to Pithinas, slewest with might, at once, the sixty thousand.<br> 7 May I too, with the liberal chiefs, O Indra, acquire thy blin supreme and domination,<br> When, Mightiest! Hero-girt! Nahu&#7779;a heroes boast them in thee, the triply-strong Defender.<br> 8 So may we he thy friends, thy best beloved, O Indra, at this holy invocation.<br> Best be Pratardani, illustrious ruler, in slaying foemen and in gaining riches.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06027.htm\">Next: HYMN XXVII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06026.html",
  "api": "json/hymns/06026.json",
  "data": {
    "title": "HYMN XXVI. Indra.",
    "describe": "O INDRA, hear us.",
    "feecting": "p:O INDRA, hear us. Raining down the Soma, we call on thee to win us mighty valour.\np: Give us strong succour on the day of trial, when the tribes gather on the field of battle.\r\np:The warrior, son of warrior sire, invokes thee, to gain great strength tha. May be won as booty: To thee, the brave man's Lord, the fiends' subduer, he looks when fighting hand to hand for cattle.\np:Thou didst impel the sage to win the daylight, didst ruin &#346;u&#7779;&#7751;a for the pious Kutsa. The invulnerable demon's head thou clavest when thou wouldst win the praise of Atithigva.\np:The lofty battle-car thou broughtest forward; thou holpest Dasadyu the strong when fighting. Along with Vetasu thou slewest Tugra, and madest Tuji strong, who praised thee, Indra.\np:Thou madest good the laud, what time thou rentest a hundred thousand fighting . O Hero, Slewest the D&#257;sa &#346;ambara of the mountain, and with strange aids didst succour Divod&#257;sa.\np:Made glad with Soma-draughts and faith, thou sentest Cumuri to his sleep, to please Dabh&#299;ti. Thou, kindly giving Raji to Pithinas, slewest with might, at once, the sixty thousand.\np:May I too, with the liberal chiefs, O Indra, acquire thy blin supreme and domination, when, Mightiest! Hero-girt! Nahu&#7779;a heroes boast them in thee, the triply-strong Defender.\np:May we he thy friends, thy best beloved, O Indra, at this holy invocation. Best be Pratardani, illustrious ruler, in subduing foemen and in gaining riches.",
    "next": "06027",
    "previous": "06025",
    "book": "06"
  },
  "created": 1638555483762,
  "updated": 1638791780724
}