{
  "key": "06029",
  "title": "RigVeda Hymn 06029",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN XXIX Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06029.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06028.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06030.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXIX Indra.</h3>  \n<p>1. YOUR men have followed Indra for his friendship, and for his loving-kindness glorified him.<br> For he bestows great wealth, the Thunder-wielder: worship him, Great and Kind, to win his favour.<br> 2 Him to whose hand, men closely cling, and drivers stand on his golden chariot firmly stationed.<br> With his firm arms he holds the reins; his Horses, the Stallions, are yoked ready for the journey.<br> 3 Thy devotees embrace thy feet for glory. Bold, thunder-armed, rich, through thy strength, in guerdon,<br> Robed in a garment fair as heaven to look on, thou hast displayed thee like an active dancer.<br> 4 That Soma when effused hath best consistence, for which the food is dressed and grain is mingled;<br> By which the men who pray, extolling Indra chief favourites of Gods, recite their praises.<br> 5 No limit of thy might hath been appointed, which by its greatness sundered earth and heaven.<br> These the Prince filleth full with strong endeavour, driving, as &#146;twere, with help his flocks to waters.<br> 6 So be the lofty Indra prompt to listen, Helper unaided, golden-visored Hero.<br> Yea, so may he, shown forth in might unequalled, smite down the many V&#7771;tras and the Dasyus.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06030.htm\">Next: HYMN XXX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06029.html",
  "api": "json/hymns/06029.json",
  "data": {
    "title": "HYMN XXIX Indra.",
    "describe": "YOUR men have followed Indra for his friendship, and for his loving-kindness glorified him.",
    "feecting": "p:YOUR men have followed Indra for his friendship, and for his loving-kindness glorified him.\np: For he bestows great wealth, the Thunder-wielder: worship him, Great and Kind, to win his favour.\r\np:Him to whose hand, men closely cling, and drivers stand on his golden chariot firmly stationed. With his firm arms he holds the reins; his Horses, the Stallions, are yoked ready for the journey.\np:Thy devotees embrace thy feet for glory. Bold, thunder-armed, rich, through thy strength, in guerdon, Robed in a garment fair as Heaven to look on, thou hast displayed thee like an active dancer.\np:That Soma when effused hath best consistence, for which the food is dressed and grain is mingled; By which the men who pray, extolling Indra chief favourites of Devas, recite their praises.\np:No limit of thy might hath been appointed, which by its greatness sundered Earth and Heaven. These the Prince filleth full with stron endeavour, driving, as &#146;twere, with help his flocks to waters.\np:So be the lofty Indra prompt to listen. Helper unaided, golden-visored Hero. Yea, s. May he, shown forth in might unequalled, smite down the many V&#7771;tras and the Dasyus.",
    "next": "06030",
    "previous": "06028",
    "book": "06"
  },
  "created": 1638555499512,
  "updated": 1638647072600
}