{
  "key": "06038",
  "title": "RigVeda Hymn 06038",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN XXXVIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06038.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06037.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06039.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXVIII. Indra.</h3>  \n<p>1. HE hath drunk hence, Most Marvellous, and carried away our great and splendid call on Indra.<br> The Bounteous, when we serve the Gods, accepteth song yet more famous and the gifts we bring him.<br> 2 The speaker filleth with a cry to Indra his ears who cometh nigh e&#146;en from a distance.<br> May this my call bring Indra to my presence, this call to Gods composed in sacred verses.<br> 3 Him have I sung with my best song and praises, Indra of ancient birth and Everlasting.<br> For prayer and songs in him are concentrated: let laud wax mighty when addressed to Indra:<br> 4 Indra, whom sacrifice shall strengthen, Soma, and song and hymn, and praises and devotion,<br> Whom Dawns shall strengthen when the night departeth, Indra whom days shall strengthen, months, and autumns.<br> 5 Him, born for conquering might in full perfection, and waxen strongfor bounty and for glory,<br> Great, Powerful, will we to-day, O singer, invite to aid. us and to quell our foemen.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06039.htm\">Next: HYMN XXXIX Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06038.html",
  "api": "json/hymns/06038.json",
  "data": {
    "title": "HYMN XXXVIII. Indra.",
    "describe": "HE hath drunk hence, most Marvellous, and carried away our great and splendid call on Indra.",
    "feecting": "p:HE hath drunk hence, most Marvellous, and carried away our great and splendid call on Indra.\np: The Bounteous, when we serve the Devas, accepteth song yet more famous and the gifts we bring him.\r\np:The speaker filleth with a cry to Indra his ears who cometh nigh e&#146;en from a distance. May this my call bring Indra to my presence, this call to Devas composed in sacred verses.\np:Him have I sung with my best song and praises, Indra of ancient birth and Everlasting. For prayer and songs in him are concentrated: let laud wax mighty when addressed to Indra:\np:Indra, whom offering shall strengthen, Soma, and song and hymn, and praises and devotion, whom Dawns shall strengthen when the night departeth, Indra whom days shall strengthen, months, and autumns.\np:Him, born for conquering might in full perfection, and waxen strongfor bounty and for glory, Great, Powerful, will we to-day, O singer, invite to aid. us and to quell our foemen.",
    "next": "06039",
    "previous": "06037",
    "book": "06"
  },
  "created": 1638555546811,
  "updated": 1638792007894
}