{
  "key": "06040",
  "title": "RigVeda Hymn 06040",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN XL. Indra</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<div class=\"filenav\">\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06040.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06039.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06041.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n</div>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XL. Indra</h3>  \n<p>1. DRINK, Indra; juice is shed to make thee joyful: loose thy Bay Steeds and give thy friends their freedom.<br> Begin the song, seated in our assembly. Give strength for sacrifice to him who singeth.<br> 2 Drink thou of this whereof at birth, O Indra, thou drankest, Mighty One for power and rapture.<br> The men, the pressing-stones, the cows, the waters have made this Soma ready for thy drinking.<br> 3 The fire is kindled, Soma pressed, O Indra: let thy Bays, best to draw, convey thee hither.<br> With mind devoted, Indra, I invoke thee. Come, for our great prosperity approach us.<br> 4 Indra, come hither: evermore thou camest through our great strong desire to drink the Soma.<br> Listen and hear the prayers which now we offer, and let this sacrifice increase thy vigour.<br> 5 Mayst thou, O Indra, on the day of trial, present or absent, wheresoe&#8217;er thou dwellest,<br> Thence, with thy team, accordant with the Maruts, Song-lover! guard our sacrifice, to help us.</p>  \n<p><div class=\"filenav\">\n<HR>\n<CENTER>\n<A HREF=\"rv06041.htm\">Next: HYMN XLI. Indra.</A></CENTER>\n</div>\n</BODY>\n</HTML>\n",
  "link": "hymns/06040.html",
  "api": "json/hymns/06040.json",
  "data": {
    "title": "HYMN XL. Indra",
    "describe": "DRINK, Indra;",
    "feecting": "p:DRINK, Indra; juice is shed to make thee joyful: loose thy Bay Steeds and give thy friends their freedom.\np: Begin the song, seated in our assembly. Give strength for offering to him who singeth.\r\np:Drink thou of this whereof at birth, O Indra, thou drankest, Mighty One for power and rapture. The men, the pressing-stones, the cows, the waters have made this Soma ready for thy drinking.\np:The fire is kindled, Soma pressed, O Indra: let thy Bays, best to draw, convey thee hither. With mind devoted, Indra, I invoke thee. Come, for our great prosperity approach us.\np:Indra, come hither: evermore thou camest through our great strong desire . Listen and hear the prayers which now we offer, and let this offering increase thy vigour.\np:Mayst thou, O Indra, on the day of trial, present or absent, wheresoe&#8217;er thou dwellest, thence, with thy team, accordant with the Devas, Song-lover! guard our offering, to help us.  \n<div class=\"filenav\">",
    "next": "06041",
    "previous": "06039",
    "book": "06"
  },
  "created": 1638555557316,
  "updated": 1638647790428
}