{
  "key": "06050",
  "title": "RigVeda Hymn 06050",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN L. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06050.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06049.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06051.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN L. Vi&#347;vedevas.</h3>  \n<p>1. I CALL with prayers on Aditi your Goddess, on Agni, Mitra, Varu&#7751;a for favour,<br> On Aryaman who gives unasked, the gracious, on Gods who save, on Savitar and Bhaga.<br> 2 Visit, to prove us free from sin, O S&#363;rya Lord of great might, the bright Gods sprung from Dak&#7779;a,<br> Twice-born and true, observing sacred duties, Holy and full of light, whose tongue is Agni.<br> 3 And, O ye Heaven and Earth, a wide dominion, O ye most blissful Worlds, our lofty shelter,<br> Give ample room and freedom for our dwelling, a home, ye Hemispheres, which none may rival.<br> 4 This day invited may the Sons of Rudra, resistless, excellent, stoop down to meet us;<br> For, when beset with slight or sore affliction, we ever call upon the Gods, the Maruts;<br> 5 To whom the Goddess Rodas&#299; clings closely, whom P&#363;&#7779;an follows bringing ample bounty.<br> What time ye hear our call and come, O Maruts, upon your separate path all creatures tremble.<br> 6 With a new hymn extol, O thou who singest, the Lover of the Song, the Hero Indra.<br> May he, exalted, hear our invocation, and grant us mighty wealth and strength when lauded.<br> 7 Give full protection, Friends of man, ye Waters, in peace and trouble, to our sons and grandsons.<br> For ye are our most motherly physicians, parents of all that standeth, all that moveth.<br> 8 May Savitar come hither and approach us, the God who rescues, Holy, goldenhanded,<br> The God who, bounteous as the face of Morning, discloses precious gifts for him who worships.<br> 9 And thou, O Son of Strength, do thou turn hither the Gods to-day to this our holy service.<br> May I for evermore enjoy thy bounty and, Agni, by thy grace be rich in heroes.<br> 10 Come also to my call, O ye N&#257;satyas, yea, verily, through my prayers, ye Holy Sages.<br> As from great darkness ye delivered Atri, protect us, Chiefs, from danger in the conflict.<br> 11 O Gods, bestow upon us riches, splendid with strength and heroes, bringing food in plenty.<br> Be gracious, helpful Gods of earth, of heaven, born of the Cow, and dwellers in the waters.<br> 12 May Rudra and Sarasvat&#299;, accordant, Vi&#7779;&#7751;u and V&#257;yu, pour down gifts and bless us;<br> &#7770;bhuk&#7779;an, V&#257;ja, and divine Vidhatar, Parjanya, V&#257;ta make our food abundant.<br> 13 May this God Savitar, the Lord, the Offspring of Waters, pouring down his dew be gracious,<br> And, with the Gods and Dames accordant, Tva&#7779;&#7789;ar; Dyaus with the Gods and Prthivi with oceans.<br> 14 May Aja-Ekap&#257;d and Ahibudhnya, and Earth and Ocean hear our invocation;<br> All Gods who strengthen Law, invoked and lauded, and holy texts uttered by sages, help us.<br> 15 So with my thoughts and hymns of praise the children of Bharadv&#257;ja sing aloud to please you.<br> The Dames invoked, and the resistless Vasus, and all ye Holy Ones have been exalted.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06051.htm\">Next: HYMN LI. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06050.html",
  "api": "json/hymns/06050.json",
  "data": {
    "title": "HYMN L. Vi&#347;vedevas.",
    "describe": "I CALL with prayers on Aditi your Goddess, on Agni, Mitra, Varu&#7751;",
    "feecting": "p:I CALL with prayers on Aditi your Goddess, on Agni, Mitra, Varu&#7751;a for favour, On Aryaman who gives unasked, the gracious, on Devas who save, on Indra and Bhaga.\np:Visit, to prove us free from sin, O S&#363;rya Lord of great might, the bright Devas sprung from Dak&#7779;a, Twice-born and true, observing sacred duties, Holy and full of light, whose tongue is Agni.\np:And, O ye Heaven and Earth, a wide dominion, O ye most blissful Worlds, our lofty shelter, Give ample room and freedom for our dwelling, a home, ye Hemispheres, which non. May rival.\np:This day invite. May the Sons of Soma, resistless, excellent, stoop down to meet us; For, when beset with slight or sore affliction, we ever call upon the Devas, the Devas;\np:To whom the Goddess Rodas&#299; clings closely, whom P&#363;&#7779;an follows bringing ample bounty.\np: What time ye hear our call and come, O Devas, upon your separate path all creatures tremble.\r\np:With a new hymn extol, O thou who singest, the Lover of the Song, the Hero Indra, may he, exalted, hear our invocation, and grant us mighty wealth and strength when lauded.\np:Give full protection, Friends of man, ye Waters, in peace and trouble, to our sons and grandsons. For ye are our most motherly physicians, parents of all that standeth, all that moveth.\np:May Indra come hither and approach us who rescues, Holy, goldenhanded who, bounteous as the face of Morning, discloses precious gifts for him who worships.\np:And thou, O Son of Strength, do thou turn hither the Devas to-day to this our holy service. May I forevermore enjoy thy bounty and, Agni, by thy grace be rich in heroes.\np:Come also to my call, O ye N&#257;satyas, yea, verily, through my meditations, ye Holy Sages. As from great darkness ye delivered Atri, protect us, Chiefs, from danger in the conflict.\np:O Devas, bestow upon us riches, splendid with strength and heroes, bringing food in plenty. Be gracious, helpful Devas of Earth, of Heaven, born of the Cow, and dwellers in the waters.\np:May Soma and Sarasvat&#299;, accordant, Vi&#7779;&#7751;u and V&#257;yu, pour down gifts and bless us; &#7770;bhuk&#7779;an, V&#257;ja, and divine Vidhatar, Parjanya, V&#257;ta make our food abundant.\np:May this Deva Indra, the Lord, the Offspring of Waters, pouring down his dew be gracious, and, with the Devas and Dames accordant, Tva&#7779;&#7789;ar; Devas with the Devas and Prthivi with oceans.\np:May Aja-Ekap&#257;d and Ahibudhnya, and Earth and Ocean hear our invocation; All Devas who strengthen Law, invoked and lauded, and holy texts uttered by sages, help us.\np:So with my thoughts and hymns of praise the children of Bharadv&#257;ja sing aloud to please you. The Dames invoked, and the resistless Devas, and all ye Holy Ones have been exalted.",
    "next": "06051",
    "previous": "06049",
    "book": "06"
  },
  "created": 1638555610143,
  "updated": 1638646519362
}