{
  "key": "06067",
  "title": "RigVeda Hymn 06067",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN LXVIL Mitra-Varu&#7751;a.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06067.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06066.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06068.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXVIL Mitra-Varu&#7751;a.</h3>  \n<p>1. NOW Mitra-Varu&#7751;a shall be exalted high by your songs, noblest of all existing;<br> They who, as &#146;twere with reins are best Controllers, unequalled with their arms to check the people.<br> 2 To you Two Gods is this my thought extended, turned to the sacred grass with loving homage.<br> Give us, O Mitra-Varu&#7751;a, a dwelling safe from attack, which ye shall guard, Boon-Givers!<br> 3 Come hither, Mitra-Varu&#7751;a, invited with eulogies and loving adoration,<br> Ye who with your might, as Work-Controllers, urge even men who quickly hear to labour.<br> 4 Whom, of pure origin, like two strong horses, Aditi bore as babes in proper season,<br> Whom, Mighty at your birth, the Mighty Goddess brought forth as terrors to the mortal foeman.<br> 5 As all the Gods in their great joy and gladness gave you with one accord your high dominion,<br> As ye surround both worlds, though wide and spacious your spies are ever true and never bewildered.<br> 6 So, through the days maintaining princely power. ye prop the height as &#146;twere from loftiest heaven.<br> The Star of all the Gods, established, filleth the heaven and earth with food of man who liveth.<br> 7 Take the strong drink, to quaff till ye are sated, when he and his attendants fill the chamber.<br> The young Maids brook not that none seeks to win them, when, Quickeners of all! they scatter moisture.<br> 8 So with your tongue come ever, when your envoy, faithful and very wise, attends our worship.<br> Nourished by holy oil! he this yGur glory: annihilate the sacrificer's trouble.<br> 9 When, Mitra-Varu&#7751;a, they strive against you and break tlie friendly laws ye have established,<br> They, neither Gods nor men in estimation, like Api's sons have godless sacrifices.<br> 10 When singers in their song uplift their voices, some chant the Nivid texts with steady purpose.<br> Then may we sing you lauds that shall be fruitful: dp ye not rival all the Gods in greatness?<br> 11 O Mitra-Varu&#7751;a, may your large bounty come to us hither, near to this our dwelling,<br> When the kine haste to us, and when they harness the fleet-foot mettled stallion for the battle.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06068.htm\">Next: HYMN LXVIII. Indra-Varu&#7751;a.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06067.html",
  "api": "json/hymns/06067.json",
  "data": {
    "key": "06067",
    "title": "HYMN LXVIL Mitra-Indra.",
    "describe": "NOW Mitra-Indra shall be exalted high by your songs, noblest of all existing;",
    "feecting": "p:NOW Mitra-Indra shall be exalted high by your songs, noblest of all existing; They who, as ’twere with reins are best Controllers, unequalled with their arms to check the people.\np:To you Two Devas is this my thought extended, turned to the sacred grass with loving homage.\np: Give us, O Mitra-Indra, a dwelling safe from attack, which ye shall guard, Boon-Givers!\r\np:Come hither invited with eulogies and loving adoration, Ye who with your might, as Work-Controllers, urge even men who quickly hear to labour.\np:Whom, of pure origin, like two strong horses, Aditi bore as babes in proper season, whom, Mighty at your birth, the Mighty Goddess brought forth as terrors to the mortal foeman.\np:As all the Devas in their great joy and gladness gave you with one accord your high dominion, as ye surround both worlds, though wide and spacious your spies are ever true and never bewildered.\np:So, through the days maintaining princely power. ye prop the height as ’twere from loftiest Heaven. The Star of all the Devas, established, filleth the Heaven and Earth with food of man who liveth.\np:Take the strong drink, to quaff till ye are sated, when he and his attendants fill the chamber. The young Maids brook not that none seeks to win them, when, Quickeners of all! they scatter moisture.\np:So with your tongue come ever, when your envoy, faithful and very wise, attends our worship. Nourished by holy oil! he this yGur glory: annihilate the trouble.\np:When they strive against you and break tlie friendly laws ye have established, they, neither Devas nor men in estimation, like Api's sons have godless offers.\np:When singers in their song uplift their voices, some chant the Nivid texts with steady purpose. The. May we sing you lauds that shall be fruitful: dp ye not rival all the Devas in greatness?\np:O Mitra-Indra, may your large bounty come to us hither, near to this our dwelling, when the kine haste to us, and when they harness the fleet-foot mettled stallion for the battle.",
    "meta": {
      "next": "06068",
      "previous": "06066",
      "book": "06",
      "source": "https://sacred-texts.com/hin/rigveda/rv06067.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv06067.htm"
    },
    "deities": [
      {
        "name": "O Mitra",
        "hymns": [
          {
            "key": "06067",
            "title": "HYMN LXVIL Mitra-Indra."
          },
          {
            "key": "06067",
            "title": "HYMN LXVIL Mitra-Indra."
          }
        ]
      }
    ]
  },
  "created": 1638555699852,
  "updated": 1638830292449
}