{
  "key": "06069",
  "title": "RigVeda Hymn 06069",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN LXIX. Indra-Vi&#7779;&#7751;u</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06069.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06068.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06070.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXIX. Indra-Vi&#7779;&#7751;u</h3>  \n<p>1. INDRA and Vi&#7779;&#7751;u, at my task's completion I urge you on with food and sacred service.<br> Accept the sacrifice and grant us riches, leading us on by unobstructed pathways.<br> 2 Ye who inspire all hymns, Indra and Vi&#7779;&#7751;u, ye vessels who contain the Soma juices,<br> May hymns of praise that now are sung address you, the lauds that are recited by the singers.<br> 3 Lords of joy-giving draughts, Indra and Vi&#7779;&#7751;u, come, giving gifts of treasure, to the Soma.<br> With brilliant rays of hymns let chanted praises, repeated with the lauds, adorn and deck you.<br> 4 May your foe-conquering horses bring you hither, Indra and Vi&#7779;&#7751;u, sharers of the banquet.<br> Of all our hymns accept the invocations list to my prayers and hear the songs I sing you.<br> 5 This your deed, Indra-Vi&#7779;&#7751;u, must be lauded: widely ye strode in the wild joy of Soma.<br> Ye made the firmament of larger compass, and made the regions broad for our existence.<br> 6 Strengthened with sacred offerings, IndraVi&#7779;&#7751;u, first eaters, served with worship ana oblation,<br> Fed with the holy oil, vouchsafe us riches ye are the lake, the vat that holds the Soma.<br> 7 Drink of this meath, O Indra, thou, and Vi&#7779;&#7751;u; drink ye your fill of Soma, Wonder-Workers.<br> The sweet exhilarating juice hath reached you. Hear ye my prayers, give ear unto my calling.<br> 8 Ye Twain have conquered, ne&#146;er have yc been conquered: never hath either of the Twain been vanquished.<br> Ye, Indra-Vi&#7779;&#7751;u, when ye fought the battle, produced this infinite with three divisions.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06070.htm\">Next: HYMN LXX. Heaven and Earth.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06069.html",
  "api": "json/hymns/06069.json",
  "data": {
    "title": "HYMN LXIX. Indra-Vi&#7779;&#7751;u",
    "describe": "INDRA and Vi&#7779;",
    "feecting": "p:INDRA and Vi&#7779;&#7751;u, at my task's completion I urge you on with food and sacred service.\np: Accept these offerings, leading us on by unobstructed pathways.\r\np:Ye who inspire all hymns, Indra and Vi&#7779;&#7751;u, ye vessels who contain the Soma juices, May hymns of praise that now are sung address you, the lauds that are recited by the singers.\np:Lords of joy-giving draughts, Indra and Vi&#7779;&#7751;u, come, giving gifts of treasure. With brilliant rays of hymns let chanted praises, repeated with the lauds, adorn and deck you.\np:May yourhorses bring you hither, Indra and Vi&#7779;&#7751;u, sharers of the banquet. Of all our hymns accept the invocations list to my meditations, and hear the songs I sing you.\np:This your deed, Indra-Vi&#7779;&#7751;u, must be lauded. Ye made the Firmament of larger compass, and made the regions broad for our existence.\np:Strengthened with sacred offerings, IndraVi&#7779;&#7751;u, first eaters, served with joy ana oblation.\np:Drink of this meath, O Indra and Vi&#7779;&#7751;u; drink ye your fill of Soma, Wonder-Workers.  Hear ye my meditations, give ear unto my calling.\np:Ye Twain have conquered, ne&#146;er have yc been conquered: never hath either of the Twain been vanquished. Ye, Indra-Vi&#7779;&#7751;u, when ye fought the battle, produced this infinite with three divisions.",
    "next": "06070",
    "previous": "06068",
    "book": "06"
  },
  "created": 1638555710379,
  "updated": 1638647018193
}