{
  "key": "06070",
  "title": "RigVeda Hymn 06070",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN LXX. Heaven and Earth.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06070.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06069.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06071.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXX. Heaven and Earth.</h3>  \n<p>1. FILLED full of fatness, compassing all things that be, wide, spacious, dropping meath, beautiful in their form,<br> The Heaven and the Earth by Varu&#7751;a's decree, unwasting, rich in germs, stand parted each from each.<br> 2 The Everlasting Pair, with full streams, rich in milk, in their pure rule pour fatness for the pious man.<br> Ye who are Regents of this world, O Earth and Heaven, pour into us the genial flow that prospers meit.<br> 3 Whoso, for righteous life, pours offerings to you, O Heaven and Earth, ye Hemispheres, that man succeeds.<br> He in his seed is born again and spreads by Law: from you flow things diverse in form, but ruled alike.<br> 4 Enclosed in fatness, Heaven and Earth are bright therewith: they mingle with the fatness which they still increase.<br> Wide, broad, set foremost at election of the priest, to them the singers pray for bliss to further them.<br> 5 May Heaven and Earth pour down the balmy rain for us, balm-dropping, yielding balm, with balm upon your path,<br> Bestowing by your Godhead sacrifice and wealth, great fame and strength for us and good heroic might.<br> 6 May Heaven and Earth make food swell plenteously for us, all-knowing Father, jother, wondrous in their works.<br> Pouring out bounties, may, in union, both the Worlds, all beneficial, send us gain, and power, and wealth.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06071.htm\">Next: HYMN LXXI. Savitar.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06070.html",
  "api": "json/hymns/06070.json",
  "data": {
    "title": "HYMN LXX. Heaven and Earth.",
    "describe": "FILLED full of fatness, compassing all things that be, wide, spacious, dropping meath, beautiful in their form, the Heaven and the Earth by Varu&#7751;",
    "feecting": "p:FILLED full of fatness, compassing all things that be, wide, spacious, dropping meath, beautiful in their form, the Heaven and the Earth by Varu&#7751;a's decree, unwasting, rich in germs, stand parted each from each.\np:The Everlasting Pair, with full streams, rich in milk, in their pure rule pour fatness for the pious man.\np: Ye who are Regents of this world, O Earth and Heaven, pour into us the genial flow that prospers meit.\r\np:Whoso, for righteous life, pours offerings to you, O Heaven and Earth, ye Hemispheres, that man succeeds. He in his seed is born again and spreads by Law: from you flow things diverse in form, but ruled alike.\np:Enclosed in fatness. Heaven and Earth are bright therewith: they mingle with the fatness which they still increase. Wide, broad, set foremost at election of the priest, to them the singers pray for bliss to further them.\np:May Heaven and Earth pour down the balmy rain for us, balm-dropping, yielding balm, with balm upon your path, bestowing by your Godhead offering and wealth, great fame and strength for us and good heroic might.\np:May Heaven and Earth make food swell plenteously for us, all-knowing Father, jother, wondrous in their works. Pouring out bounties. May, in union, both the Worlds, all beneficial, send us gain, and power, and wealth.",
    "next": "06071",
    "previous": "06069",
    "book": "06"
  },
  "created": 1638555716000,
  "updated": 1638642698607
}