{
  "key": "06071",
  "title": "RigVeda Hymn 06071",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 6: HYMN LXXI. Savitar.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv06071.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi06.htm\">Rig-Veda, Book 6 Index</A><BR>\n&nbsp;\n<A HREF=\"rv06070.htm\">Previous</A>&nbsp;\n<A HREF=\"rv06072.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXI. Savitar.</h3>  \n<p>1. FULL of effectual wisdom Savitar the God hath stretched out golden arms that he may bring forth life.<br> Young and most skilful, while he holds the region up, the Warrior sprinkles fatness over both his hands.<br> 2 May we enjoy the noblest vivifying force of Savitar the God, that he may give us wealth:<br> For thou art mighty to produce and lull to rest the world of life that moves on two feet and on four.<br> 3 Protect our habitation, Savitar, this day, with guardian aids around, auspicious, firm and true.<br> God of the golden tongue, keep us for newest bliss: let not the evil-wisher have us in his power.<br> 4 This Savitar the God, the golden-handed, Friend of the home, hath risen to meet the twilight.<br> With cheeks of brass, with pleasant tongue, the Holy, he sends the worshipper rich gifts in plenty.<br> 5 Like a Director, Savitar hath extended his golden arms, exceeding fair to look on.<br> He hath gone up the heights of earth and heaven, and made each monster fall and cease from troubling.<br> 6 Fair wealth, O Savitar, to-day, to-morrow, fair wealth produce for us each day that passes.<br> May we through this our song be happy gainers, God, of a fair and spacious habitation.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv06072.htm\">Next: HYMN LXXII. Indra-Soma.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/06071.html",
  "api": "json/hymns/06071.json",
  "data": {
    "key": "06071",
    "title": "HYMN LXXI. Indra.",
    "describe": "FULL of effectual wisdom Indra the Deva hath stretched out golden arms that h.",
    "feecting": "p:FULL of effectual wisdom Indra the Deva hath stretched out golden arms that h. May bring forth life.\np: Young and most skilful, while he holds the region up, the Warrior sprinkles fatness over both his hands.\r\np:May we enjoy the noblest vivifying force of Indra the Deva, that h. May give us wealth: For thou art mighty to produce and lull to rest the world of life that moves on two feet and on four.\np:Protect our habitation, Indra, this day, with guardian aids around, auspicious, firm and true. Deva of the golden tongue, keep us for newest bliss: let not the evil-wisher have us in his power.\np:This Indra the Deva, the golden-handed, Friend of the home, hath risen to meet the twilight. With cheeks of brass, with pleasant tongue, the Holy, he sends the worshipper rich gifts in plenty.\np:Like a Director, Indra hath extended his golden arms, exceeding fair to look on. He hath gone up the heights of Earth and Heaven, and made each monster fall and cease from troubling.\np:Fair wealth, O Indra, to-day, to-morrow, fair wealth produce for us each day that passes. May we through this our song be happy gainers, Deva, of a fair and spacious habitation.",
    "meta": {
      "next": "06072",
      "previous": "06070",
      "book": "06",
      "original": "https://sacred-texts.com/hin/rigveda/rv06071.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv06071.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "06071",
            "title": "HYMN LXXI. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638555721259,
  "updated": 1667440427508
}