{
  "key": "07003",
  "title": "RigVeda Hymn 07003",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN III. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07003.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07002.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07004.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN III. Agni.</h3>  \n<p>1. ASSOCIATE with fires, make your God Agni envoy at sacrifice, best skilled in worship,<br> Established firm among mankind, the Holy, flame-crowned and fed with oil, the Purifier.<br> 2 Like a steed neighing eager for the pasture, when he hath stepped forth from the great enclosure:<br> Then the wind following blows upon his splendour, and, straight, the path is black which thou hast travelled.<br> 3 From thee a Bull but newly born, O Agni, the kindled everlasting flames rise upward.<br> Aloft to heaven thy ruddy smoke ascendeth: Agni, thou speedest to the Gods as envoy.<br> 4 Thou whose fresh lustre o&#146;er the earth advanceth when greedily with thy jaws thy food thou eatest.<br> Like a host hurried onward comes thy lasso: fierce, with thy tongue thou piercest, as &#146;twere barley.<br> 5 The men have decked him both at eve and morning, Most Youthful Agni, as they tend a courser.<br> They kindle him, a guest within his dwelling: bright shines the splendour of the worshipped Hero.<br> 6 O fair of face, beautiful is thine aspect when, very near at hand, like gold thou gleamest,<br> Like Heaven's thundering roar thy might approaches, and like the wondrous Sun thy light thou showest.<br> 7 That we may worship, with your Hail to Agni! with sacrificial cakes and fat oblations,<br> Guard us, O Agni, with those boundless glories as with a hundred fortresses of iron.<br> 8 Thine are resistless songs for him who offers, and hero-giving hymns wherewith thou savest;<br> With these, O Son of Strength, O J&#257;tavedas, guard us, preserve these princes and the singers.<br> 9 When forth he cometh, like an axe new-sharpened, pure in his form, resplendent in his body,<br> Sprung, sought with eager longing, from his Parents, for the Gods&#146; worship, Sage and Purifier:<br> 10 Shine this felicity on us, O Agni: may we attain to perfect understanding.<br> All happiness be theirs who sing and praise thee. Ye Gods, preserve us evermore with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07004.htm\">Next: HYMN IV. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07003.html",
  "api": "json/hymns/07003.json",
  "data": {
    "title": "HYMN III. Agni.",
    "describe": "ASSOCIATE with fires, make your God Agni envoy at offering, best skilled in worship, Established firm among mankind, the Holy, flame-crowned and fed with oil, the Purifier.",
    "feecting": "p:ASSOCIATE with fires, make your God Agni envoy at offering, best skilled in worship, Established firm among mankind, the Holy, flame-crowned and fed with oil, the Purifier.\np:Like a steed neighing eager for the pasture, when he hath stepped forth from the great enclosure: Then the wind following blows upon his splendour, and, straight, the path is black which thou hast travelled.\np:From thee a Bull but newly born, O Agni, the kindled everlasting flames rise upward.\np: Aloft to Heaven thy ruddy smoke ascendeth: Agni, thou speedest to the Devas as envoy.\r\np:Thou whose fresh lustre o&#146;er the Earth advanceth when greedily with thy jaws thy food thou eatest. Like a host hurried onward comes thy lasso: fierce, with thy tongue thou piercest, as &#146;twere barley.\np:The men have decked him both at eve and morning, most Youthful Agni, as they tend a courser. They kindle him, a guest within his dwelling: bright shines the splendour of the worshipped Hero.\np:O fair of face, beautiful is thine aspect when, very near at hand, like gold thou gleamest, like Heaven's thundering roar thy might approaches, and like the wondrous Sun thy light thou showest.\np:That we may worship, with your Hail to Agni! with sacrificial cakes and fat oblations, Guard us, O Agni, with those boundless glories as with a hundred fortresses of iron.\np:Thine are resistless songs for him who offers, and hero-giving hymns wherewith thou savest; With these, O Son of Strength, O J&#257;tavedas, guard us, preserve these princes and the singers.\np:When forth he cometh, like an axe new-sharpened, pure in his form, resplendent in his body, Sprung, sought with eager longing, from his Parents, for the Devas&#146; worship, Sage and Purifier:\np:Shine this felicity on us, O Agni. May we attain to perfect understanding. All happiness be theirs who sing and praise thee. Ye Devas, preserve us evermore with blessings.",
    "next": "07004",
    "previous": "07002",
    "book": "07"
  },
  "created": 1638555758084,
  "updated": 1638791780775
}