{
  "key": "07002",
  "title": "RigVeda Hymn 07002",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN II. &#256;pr&#299;s.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07002.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07001.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07003.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN II. &#256;pr&#299;s.</h3>  \n<p>1. GLADLY accept, this day, our fuel, Agni: send up thy sacred smoke and shine sublimely.<br> Touch the celestial summits with thy columns, and overspread thee with the rays of S&#363;rya.<br> 2 With sacrifice to these we men will honour the majesty of holy Nar&#257;&#347;a&#7745;sa-<br> To these the pure, most wise, the thought. inspirers, Gods who enjoy both sorts of our oblations.<br> 3 We will extol at sacrifice for ever, as men may do, Agni whom Manu kindled,<br> Your very skilful Asura, meet for worship, envoy between both worlds, the truthful speaker.<br> 4 Bearing the sacred grass, the men who serve him strew it with reverence, on their knees, by Agni.<br> Calling him to the spotted grass, oil-sprinkled, adorn him, ye Adhvaryus, with oblation.<br> 5 With holy thoughts the pious have thrown open Doors fain for chariots in the Gods&#146; assembly.<br> Like two full mother cows who lick their youngling, like maidens for the gathering, they adorn them.<br> 6 And let the two exalted Heavenly Ladies, Morning and Night, like a cow good at milking,<br> Come, much-invoked, and on our grass be seated ' wealthy, deserving worship, for our welfare.<br> 7 You, Bards and Singers at men's sacrifices, both filled with wisdom, I incline to worship.<br> Send up our offerings when we call upon you, and so among the Gods obtain us treasures.<br> 8 May Bh&#257;rat&#299; with all her Sisters, I&#7735;&#257; accordant with the Gods, with mortals Agni,<br> Sarasvat&#299; with all her kindred Rivers, come to this grass, Three Goddesses, and seat them.<br> 9 Well pleased with us do thou, O God, O Tva&#7779;&#7789;ar, give ready issue to our procreant vigour,<br> Whence springs the hero, powerful, skilled in action, lover of Gods, adjuster of the press-stones.<br> 10 Send to the Gods the oblation, Lord of Forests, and let the Immolator, Agni, dress it.<br> He as the truer Priest shall offer worship, for the God'sgenerations well he knoweth.<br> 11 Come thou to us, O Agni, duly kindled, together with the potent Gods and Indra.<br> On this our grass sit Aditi, happy Mother, and let our Hail! delight the Gods Immortal.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07003.htm\">Next: HYMN III. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07002.html",
  "api": "json/hymns/07002.json",
  "data": {
    "title": "HYMN II. &#256;pr&#299;s.",
    "describe": "GLADLY accept, this day, our fuel, Agni: send up thy sacred smoke and shine sublimely.",
    "feecting": "p:GLADLY accept, this day, our fuel, Agni: send up thy sacred smoke and shine sublimely.\np: Touch the celestial summits with thy columns, and overspread thee with the rays of S&#363;rya.\r\np:With offering to these we men will honour the majesty of holy Nar&#257;&#347;a&#7745;sa- To these the pure, most wise, the thought. inspirers, Devas who enjoy both sorts of our oblations.\np:We will extol at offering forever, as me. May do, Agni whom Manu kindled, Your very skilful Devas, meet for worship, envoy between both worlds, the truthful speaker.\np:Bearing the sacred grass, the men who serve him strew it with reverence, on their knees, by Agni. Calling him to the spotted grass, oil-sprinkled, adorn him, ye Adhvaryus, with oblation.\np:With holy thoughts the pious have thrown open Doors fain for chariots in the Devas&#146; assembly. Like two full mother cows who lick their youngling, like maidens for the gathering, they adorn them.\np:And let the two exalted Heavenly Ladies, Morning and Night, like a cow good at milking, Come, much-invoked, and on our grass be seated ' wealthy, deserving worship, for our welfare.\np:You, Bards and Singers at men's offers, both filled with wisdom, I incline to worship. Send up our offerings when we call upon you, and so among the Devas obtain us treasures.\np:May Bh&#257;rat&#299; with all her Sisters, I&#7735;&#257; accordant with the Devas, with mortals Agni, Sarasvat&#299; with all her kindred Rivers, come to this grass, Three Goddesses, and seat them.\np:Well pleased with us do thou, O Tva&#7779;&#7789;ar, give ready issue to our procreant vigour, whence springs the hero, powerful, skilled in action, lover of Devas, adjuster of the press-stones.\np:Send to the Devas the oblation, Lord of Forests, and let the Immolator, Agni, dress it. He as the truer Monk shall offer worship, for the Deva'sgenerations well he knoweth.\np:Come thou to us, O Agni, duly kindled, together with the potent Devas and Indra. On this our grass sit Aditi, happy Mother, and let our Hail! delight the Devas Immortal.",
    "next": "07003",
    "previous": "07001",
    "book": "07"
  },
  "created": 1638555752829,
  "updated": 1638790698121
}