{
  "key": "07005",
  "title": "RigVeda Hymn 07005",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN V. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07005.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07004.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07006.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN V. Agni.</h3>  \n<p>1. BRING forth your song of praise to mighty Agni, the speedy messenger of earth and heaven,<br> Vai&#347;v&#257;nara, who, with those who wake, hath waxen great in the lap of all the Gods Immortal.<br> 2 Sought in the heavens, on earth is Agni stablished, leader of rivers, Bull of standing waters.<br> Vai&#347;v&#257;nara when he hath grown in glory, shines on the tribes of men with light and treasure.<br> 3 For fear of thee forth fled the dark-hued races, scattered abroad, deserting their possessions,<br> When, glowing, O Vai&#347;v&#257;nara, for P&#363;ru, thou Agni didst light up and rend their castles.<br> 4 Agni Vai&#347;v&#257;nara, both Earth and Heaven submit them to thy threefold jurisdiction.<br> Refulgent in thine undecaying lustre thou hast invested both the worlds with splendour.<br> 5 Agni, the tawny horses, loudly neighing our resonant hymns that drop with oil, attend thee;<br> Lord of the tribes, our Charioteer of riches, Ensign of days, Vai&#347;v&#257;nara of mornings.<br> 6 In thee, O bright as Mitra, Vasus seated the might of Aduras, for they loved thy spirit.<br> Thou dravest Dasyus from their home, O Agni, and broughtest forth broad light to light the &#256;rya.<br> 7 Born in the loftiest heaven thou in a moment reachest, like wind, the place where Gods inhabit.<br> Thou, favouring thine offspring, roaredst loudly when giving life to creatures, J&#257;tavedas.<br> 8 Send us that strength, Vai&#347;v&#257;nara, send it, Agni, that strength, O J&#257;tavedas, full of splendour,<br> Wherewith, all-bounteous God, thou pourest riches, as fame wide-spreading, on the man who offers.<br> 9 Agni, bestow upon our chiefs and nobles that famous power, that wealth which feedeth many.<br> Accordant with the Vasus and the Rudras, Agni, Vai&#347;v&#257;nara, give us sure protection.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07006.htm\">Next: HYMN VI. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07005.html",
  "api": "json/hymns/07005.json",
  "data": {
    "title": "HYMN V. Agni.",
    "describe": "BRING forth your song of praise to mighty Agni, the speedy messenger of Earth and Heaven, Vai&#347;",
    "feecting": "p:BRING forth your song of praise to mighty Agni, the speedy messenger of Earth and Heaven, Vai&#347;v&#257;nara, who, with those who wake, hath waxen great in the lap of all the Devas Immortal.\np:Sought in the heavens, on Earth is Agni stablished, leader of rivers, Bull of standing waters.\np: Vai&#347;v&#257;nara when he hath grown in glory, shines on the tribes of men with light and treasure.\r\np:For fear of thee forth fled the dark-hued races, scattered abroad, deserting their possessions, when, glowing, O Vai&#347;v&#257;nara, for P&#363;ru, thou Agni didst light up and rend their castles.\np:Agni Vai&#347;v&#257;nara, both Earth and Heaven submit them to thy threefold jurisdiction. Refulgent in thine undecaying lustre thou hast invested both the worlds with splendour.\np:Agni, the tawny horses, loudly neighing our resonant hymns that drop with oil, attend thee; Lord of the tribes, our Charioteer of riches, Ensign of days, Vai&#347;v&#257;nara of mornings.\np:In thee Devas seated the might of Aduras, for they loved thy spirit. Thou dravest Dasyus from their home, O Agni, and broughtest forth broad light to light the &#256;rya.\np:Born in the loftiest Heaven thou in a moment reachest, like wind, the place where Devas inhabit. Thou, favouring thine offspring, roaredst loudly when giving life to creatures, J&#257;tavedas.\np:Send us that strength, Vai&#347;v&#257;nara, send it, Agni, that strength, O J&#257;tavedas, full of splendour, Wherewith all-bounteous Deva, thou pourest riches, as fame wide-spreading on the man who offers.\np:Agni, bestow upon us that famous power, that wealth which feedeth many. Accordant with the Devas and the Somas, Agni, Vai&#347;v&#257;nara, give us sure protection.",
    "next": "07006",
    "previous": "07004",
    "book": "07"
  },
  "created": 1638555768870,
  "updated": 1638791780777
}