{
  "key": "07015",
  "title": "RigVeda Hymn 07015",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN XV. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07015.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07014.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07016.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XV. Agni.</h3>  \n<p>1. OFFER oblations in his mouth, the bounteous God's whom we must serve.<br> His who is nearest kin to us:<br> 2 Who for the Fivefold People's take hath seated him in every home<br> Wise, Youthful, Master of the house.<br> 3 On all sides may that Agni guard our household folk and property;<br> May he deliver us from woe.<br> 4 I have begotten this new hymn for Agni, Falcon of the sky:<br> Will he not give us of his wealth?<br> 5 Whose lories when he glows in front of sacrite are fair to see,<br> Like wealth of one with hero sons.<br> 6 May he enjoy this hallowed gift, Agni accept our songs, who bears<br> Oblations, best of worshippers.<br> 7 Lord of the house, whom men must seek, we set thee down, O Worshipped Onel<br> Bright, rich in heroes, Agni! God<br> 8 Shine forth at night and morn: through thee with fires are we provided well.<br> Thou, rich in heroes, art our Friend.<br> 9 The men come near thee for their gain, the singers with their songs of praise:<br> Speech, thousandfold, comes near to thee.<br> 10 Bright, Purifier, meet for praise, Immortal with refulgent glow,<br> Agni drives R&#257;k&#7779;asas away.<br> 11 As such, bring us abundant wealth, young Child of Strength, for this thou canst<br> May Bhaga give us what is choice.<br> 12 Thou, Agni, givest hero fame: Bhaga and Savitar the God,<br> And Did give us what is good.<br> 13 Agni, preserve us from distress: consume our enemies, O God,<br> Eternal, with the hottest flames.<br> 14 And, irresistible, be thou a mighty iron fort to us,<br> With hundred walls for man's defence.<br> 15 Do thou preserve us, eve and morn, from sorrow, from the wicked men,<br> Infallible! by day and night.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07016.htm\">Next: HYMN XVI. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07015.html",
  "api": "json/hymns/07015.json",
  "data": {
    "title": "HYMN XV. Agni.",
    "describe": "OFFER oblations in his mouth, the bounteous Deva's whom we must serve.",
    "feecting": "p:OFFER oblations in his mouth, the bounteous Deva's whom we must serve.\np: His who is nearest kin to us:\r\np:Who for the Fivefold People's take hath seated him in every home Wise, Youthful, Master of the house.\np:On all side. May that Agni guard our household folk and property; May he deliver us from woe.\np:I have begotten this new hymn for Agni, Falcon of the sky: Will he not give us of his wealth?\np:Whose lories when he glows in front of sacrite are fair to see, like wealth of one with hero sons.\np:May he enjoy this hallowed gift, Agni accept our songs, who bears Oblations, best of worshippers.\np:Lord of the house, whom men must seek, we set thee down, O Worshipped Onel Bright, rich in heroes, Agni! God\np:Shine forth at night and morn: through thee with fires are we provided well. Thou, rich in heroes, art our Friend.\np:The men come near thee for their gain, the singers with their songs of praise: Speech, thousandfold, comes near to thee.\np:Bright, Purifier, meet for praise, Immortal with refulgent glow, Agni drives R&#257;k&#7779;asas away.\np:As such, bring us abundant wealth, young Child of Strength, for this thou canst May Bhaga give us what is choice.\np:Thou, Agni, givest hero fame: Bhaga and Indra the Deva, and Did give us what is good.\np:Agni, preserve us from distress: consume our enemies, Eternal, with the hottest flames.\np:And, irresistible, be thou a mighty iron fort to us, with hundred walls for man's defence.\np:Do thou preserve us, eve and morn, from sorrow, from the wicked men, infallible! by day and night.",
    "next": "07016",
    "previous": "07014",
    "book": "07"
  },
  "created": 1638555821754,
  "updated": 1638790698135
}