{
  "key": "07023",
  "title": "RigVeda Hymn 07023",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN XXIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07023.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07022.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07024.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXIII. Indra.</h3>  \n<p>1. PRAYERS have been offered up through love of glory: Vasi&#7779;&#7789;ha, honour Indra in the battle.<br> He who with might extends through all existence hears words which I, his faithful servant, utter.<br> 2 A cry was raised which reached the Gods, O Indra, a cry to them to send us strength in combat.<br> None among men knows his own life's duration: bear us in safety over these our troubles.<br> 3 The Bays, the booty-seeking car I harness: my prayers have reached him who accepts them gladly.<br> Indra, when he had slain resistless foemen, forced with his might the two world-halves asunder.<br> 4 Like barren cows, moreover, swelled the waters: the singen sought thy holy rite, O Indra.<br> Come unto us as with his team comes V&#257;yu: thou, through our solemn hymns bestowest booty.<br> 5 So may these gladdening draughts rejoice thee, Indra, the Mighty, very bounteous to the singer.<br> Alone among the Gods thou pitiest mortals: O Hero, make thee glad at this libation.<br> 6 Thus the Vasisthas glorify with praises Indra, the Powerful whose arm wields thunder.<br> Praised, may he guard our wealth in kine and heroes. Ye Gods, preserve us evermore with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07024.htm\">Next: HYMN XXIV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07023.html",
  "api": "json/hymns/07023.json",
  "data": {
    "title": "HYMN XXIII. Indra.",
    "describe": "PRAYERS have been offered up through love of glory: Vasi&#7779;",
    "feecting": "p:PRAYERS have been offered up through love of glory: Vasi&#7779;&#7789;ha, honour Indra in the battle.\np: He who with might extends through all existence hears words which I, his faithful servant, utter.\r\np:A cry was raised which reached the Devas, O Indra, a cry to them to send us strength in combat. None among men knows his own life's duration: bear us in safety over these our troubles.\np:The Bays, the booty-seeking car I harness: my meditations have reached him who accepts them gladly. Indra, when he had slain resistless foemen, forced with his might the two world-halves asunder.\np:Like barren cows, moreover, swelled the waters: the singen sought thy holy rite, O Indra. Come unto us as with his team comes V&#257;yu: thou, through our solemn hymns bestowest booty.\np:May these gladdening draughts rejoice thee, Indra, the Mighty, very bounteous to the singer. Alone among the Devas thou pitiest mortals: O Hero, make thee glad at this libation.\np:Thus the Vasisthas glorify with praises Indra, the Powerful whose arm wields thunder. Praised. May he guard our wealth in kine and heroes. Ye Devas, preserve us evermore with blessings.",
    "next": "07024",
    "previous": "07022",
    "book": "07"
  },
  "created": 1638555863961,
  "updated": 1638791591762
}