{
  "key": "07021",
  "title": "RigVeda Hymn 07021",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN XXI. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07021.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07020.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07022.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXI. Indra.</h3>  \n<p>1. PRESSED is the juice divine with milk commingled: thereto hath Indra ever been accustomed.<br> We wake thee, Lord of Bays, with sacrifices: mark this our laud in the wild joy of Soma.<br> 2 On to the rite they move, the grass they scatter, these Soma-drinkers eloquent in synod.<br> Hither, for men to grasp, are brought the press-stones, far-thundering, famous, strong, that wait on heroes.<br> 3 Indra, thou settest free the many waters that were encompassed, Hero, by the Dragon.<br> Down rolled, as if on chariots borne, the rivers: through fear of thee all things created tremble.<br> 4 Skilled in all manly deeds the God terrific hath with his weapons mastered these opponents.<br> Indra in rapturous joy shook down their castles he slew them in his might, the Thunder-wielder.<br> 5 No evil spirits have impelled us, Indra, nor fiends, O Mightiest God, with their devices.<br> Let our true God subdue the hostile rabble: let not the lewd approach our holy worship.<br> 6 Thou in thy strength surpassest Earth and Heaven: the regions comprehend not all thy greatness.<br> With thine own power and might thou slewest V&#7771;tra: no foe hath found the end of thee in battle.<br> 7 Even the earlier Deities submitted their powers to thy supreme divine dominion.<br> Indra wins wealth and deals it out to other's: men in the strife for booty call on Indra.<br> 8 The humble hath invoked thee for protection, thee, Lord of great felicity, O Indra.<br> Thou with a hundred aids hast been our Helper: one who brings gifts like thee hath his defender.<br> 9 May we, O Indra, be thy friends for ever, eagerly, Conqueror, yielding greater homage.<br> May, through thy grace, the strength of us who battle quell in the shock the onset of the foeman.<br> 10 Place us by food which thou hast given, O Indra, us and the wealthy patrons who command us.<br> Let thy great power bring good to him who lauds thee. Ye Gods, preserve us evermore with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07022.htm\">Next: HYMN XXII Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07021.html",
  "api": "json/hymns/07021.json",
  "data": {
    "title": "HYMN XXI. Indra.",
    "describe": "PRESSED is the juice divine with milk commingled: thereto hath Indra ever been accustomed.",
    "feecting": "p:PRESSED is the juice divine with milk commingled: thereto hath Indra ever been accustomed.\np: We wake thee, Lord of Bays, with offers: mark this our laud in the wild joy of Soma.\r\np:On to the rite they move, the grass they scatter, these Soma-drinkers eloquent in synod. Hither, for men to grasp, are brought the press-stones, far-thundering, famous, strong, that wait on heroes.\np:Indra, thou settest free the many waters that were encompassed. Hero, by the Dragon. Down rolled, as if on chariots borne, the rivers: through fear of thee all things created tremble.\np:Skilled in all manly deeds the Deva terrific hath with his weapons mastered these opponents. Indra in rapturous joy shook down their castles he slew them in his might, the Thunder-wielder.\np:No evil spirits have impelled us, Indra, nor fiends, O Mightiest Deva, with their devices. Let our true God subdue the hostile rabble: let not the lewd approach our holy worship.\np:Thou in thy strength surpassest Earth and Heaven: the regions comprehend not all thy greatness. With thine own power and might thou slewest V&#7771;tra: no foe hath found the end of thee in battle.\np:Even the earlier Deities submitted their powers to thy supreme divine dominion. Indra wins wealth and deals it out to other's: men in the strife for booty call on Indra.\np:The humble hath invoked thee for protection, thee, Lord of great felicity, O Indra. Thou with a hundred aids hast been our Helper: one who brings gifts like thee hath his defender.\np:May we, O Indra, be thy friends forever, eagerly, Conqueror, yielding greater homage. May, through thy grace, the strength of us who battle quell in the shock the onset of the foeman.\np:Place us by food which thou hast given, O Indra, us and the wealthy patrons who command us. Let thy great power bring good to him who lauds thee. Ye Devas, preserve us evermore with blessings.",
    "next": "07022",
    "previous": "07020",
    "book": "07"
  },
  "created": 1638555853352,
  "updated": 1638791780794
}