{
  "key": "07027",
  "title": "RigVeda Hymn 07027",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN XXVII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07027.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07026.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07028.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXVII. Indra.</h3>  \n<p>1. MEN call on Indra in the armed encounter that he may make the hymns they sing decisive.<br> Hero, rejoicing in thy might, in combat give us a portion of the stall of cattle,<br> 2 Grant, Indra Maghavan, invoked of many, to these my friends the strength which thou possessest.<br> Thou, Maghavan, hast rent strong places open: unclose for us, Wise God, thy hidden bounty.<br> 3 King of the living world, of men, is Indra, of all in varied form that earth containeth.<br> Thence to the worshipper he giveth riches: may he enrich us also when we laud him.<br> 4 Maghavan Indra, when we all invoke him, bountiful ever sendeth strength to aid us:<br> Whose perfect guerdon, never failing, bringeth wealth to the men, to friends the thing they covet.<br> 5 Quick, Indra, give us room and way to riches, and let us bring thy mind to grant us treasures,<br> That we may win us cars and Steeds and cattle. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07028.htm\">Next: HYMN XXVIII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07027.html",
  "api": "json/hymns/07027.json",
  "data": {
    "title": "HYMN XXVII. Indra.",
    "describe": "MEN call on Indra in the armed encounter that h.",
    "feecting": "p:MEN call on Indra in the armed encounter that h. May make the hymns they sing decisive.\np: Hero, rejoicing in thy might, in combat give us a portion of the stall of cattle,\r\np:Grant, Indra Indra, invoked of many, to these my friends the strength which thou possessest. Thou, Indra, hast rent strong places open: unclose for us, Wise Deva, thy hidden bounty.\np:King of the living world, of men, is Indra, of all in varied form that Earth containeth. Thence to the worshipper he giveth riches. May he enrich us also when we laud him.\np:Indra Indra, when we all invoke him, bountiful ever sendeth strength to aid us: Whose perfect guerdon, never failing, bringeth wealth to the men, to friends the thing they covet.\np:Quick, Indra, give us room and way to riches, and let us bring thy mind to grant us treasures, that we may win us cars and Steeds and cattle. Preserve us evermore, ye Devas, with blessings.",
    "next": "07028",
    "previous": "07026",
    "book": "07"
  },
  "created": 1638555885014,
  "updated": 1638647018229
}