{
  "key": "07024",
  "title": "RigVeda Hymn 07024",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN XXIV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07024.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07023.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07025.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXIV. Indra.</h3>  \n<p>1. A HOME is made for thee to dwell in, Indra: O Much-invoked, go thitherwith the heroes.<br> That thou, to prosper us, mayst be our Helper, vouchsafe us wealth, rejoice with draughts of Soma.<br> 2 Indra, thy wish, twice-strong, is comprehended: pressed is the Soma, poured are pleasant juices.<br> This hymn of praise, from loosened tongue, made perfect, draws Indra to itself with loud invoking.<br> 3 Come, thou Impetuous; God, from earth or heaven; come to our holy grass to drink the Soma.<br> Hither to me let thy Bay Horses bring thee to listen to our hymns and make thee joyful.<br> 4 Come unto us with all thine aids, accordant, Lord of Bay Steeds, accepting our devotions,<br> Fair-helmeted, o&#146;ercoming with the mighty, and lending us the strength of bulls, O Indra.<br> 5 As to the chariot pole a vigorous courser, this laud is brought to the great strong Upholder.<br> This hymn solicits wealth of thee: in heaven, as &#146;twere above the sky, set thou our glory.<br> 6 With precious things. O Indra, thus content us: may we attain to thine exalted favour.<br> Send our chiefs plenteous food with hero children. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07025.htm\">Next: HYMN XXV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07024.html",
  "api": "json/hymns/07024.json",
  "data": {
    "title": "HYMN XXIV. Indra.",
    "describe": "A HOME is made for thee to dwell in, Indra: O Much-invoked, go thitherwith the heroes.",
    "feecting": "p:A HOME is made for thee to dwell in, Indra: O Much-invoked, go thitherwith the heroes.\np: That thou, to prosper us. Mayst be our Helper, vouchsafe us wealth, rejoice with draughts of Soma.\r\np:Indra, thy wish, twice-strong, is comprehended: pressed is the Soma, poured are pleasant juices. This hymn of praise, from loosened tongue, made perfect, draws Indra to itself with loud invoking.\np:Come, thou Impetuous; Deva, from Earth or Heaven; come to our holy grass . Hither to me let thy Bay Horses bring thee to listen to our hymns and make thee joyful.\np:Come unto us with all thine aids, accordant, Lord of Bay Steeds, accepting our devotions, Fair-helmeted, o&#146;ercoming with the mighty, and lending us the strength of bulls, O Indra.\np:As to the chariot pole a vigorous courser, this laud is brought to the great strong Upholder. This hymn solicits wealth of thee: in Heaven, as &#146;twere above the sky, set thou our glory.\np:With precious things. O Indra, thus content us. May we attain to thine exalted favour. Send our chiefs plenteous food with hero children. Preserve us evermore, ye Devas, with blessings.",
    "next": "07025",
    "previous": "07023",
    "book": "07"
  },
  "created": 1638555869233,
  "updated": 1638647072680
}