{
  "key": "07039",
  "title": "RigVeda Hymn 07039",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN XXXIX Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07039.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07038.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07040.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXIX Vi&#347;vedevas.</h3>  \n<p>1. AGNI, erect, hath shown enriching favour: the flame goes forward to the Gods&#146; assembly.<br> Like car-borne men the stones their path have chosen: let the priest, quickened, celebrate our worship.<br> 2 Soft to the tread, their sacred grass is scattered: these go like Kings amid the band around them,<br> At the folks early call on Night and Morning,&#151;V&#257;yu, and P&#363;&#7779;an with his team, to bless us.<br> 3 Here on their path the noble Gods proceeded: in the wide firmament the Beauteous decked them.<br> Bend your way hither, ye who travel widely: hear this our envoy who hath gone to meet you.<br> 4 For they are holy aids at sacrifices: all Gods approach the place of congregation.<br> Bring these, desirous, to our worship, Agni, swift the Nisatyas, Bhaga, and Purandhi.<br> 5 Agni, to these men's hymns, from earth, from heaven, bring Mitra, Varu&#7751;a, Indra, and Agni,<br> And Aryaman, and Aditi, and Vi&#7779;&#7751;u. Sarasvat&#299; be joyful, and the Maruts.<br> 6 Even as the holy wish, the gift is offered: may he, unsated, come when men desire him.<br> Give never-failing ever-conquering riches: with Gods for our allies may we be victors.<br> 7 Now have both worlds been praised by the Vasisthas; and holy Mitra, Varu&#7751;a, and Agni.<br> May they, bright Deities, make our song supremest. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07040.htm\">Next: HYMN XL. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07039.html",
  "api": "json/hymns/07039.json",
  "data": {
    "title": "HYMN XXXIX Vi&#347;vedevas.",
    "describe": "AGNI, erect, hath shown enriching favour: the flame goes forward to the Devas&#146;",
    "feecting": "p:AGNI, erect, hath shown enriching favour: the flame goes forward to the Devas&#146; assembly.\np: Like car-borne men the stones their path have chosen: let the priest, quickened, celebrate our worship.\r\np:Soft to the tread, their sacred grass is scattered: these go like Kings amid the band around them, At the folks early call on Night and Morning,&#151;V&#257;yu, and P&#363;&#7779;an with his team, to bless us.\np:Here on their path the noble Devas proceeded: in the wide Firmament the Beauteous decked them. Bend your way hither, ye who travel widely: hear this our envoy who hath gone to meet you.\np:For they are holy aids at offers: all Devas approach the place of congregation. Bring these, desirous, to our worship, Agni, swift the Nisatyas, Bhaga, and Purandhi.\np:Agni, to these men's hymns, from Earth, from Heaven, bring Mitra, Varu&#7751;a, Indra, and Agni, and Aryaman, and Aditi, and Vi&#7779;&#7751;u. Sarasvat&#299; be joyful, and the Devas.\np:Even as the holy wish, the gift is offered. May he, unsated, come when men desire him. Give never-failing ever-conquering riches: with Devas for our allie. May we be victors.\np:Now have both worlds been praised by the Vasisthas; and holy Mitra, Varu&#7751;a, and Agni. May they, bright Deities, make our song supremest. Preserve us evermore, ye Devas, with blessings.",
    "next": "07040",
    "previous": "07038",
    "book": "07"
  },
  "created": 1638555948148,
  "updated": 1638642698663
}