{
  "key": "07038",
  "title": "RigVeda Hymn 07038",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN XXXVIII. Savitar.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07038.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07037.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07039.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXVIII. Savitar.</h3>  \n<p>1. ON high hath Savitar, this God, extended the golden lustre which he spreads around him.<br> Now, now must Bhaga be invoked by mortals, Lord of great riches who distributes treasures.<br> 2 Rise up, O Savitar whose hands are golden, and hear this man while sacrifice is offered,<br> Spreading afar thy broad and wide effulgence, and bringing mortal men the food that feeds them.<br> 3 Let Savitar the God he hymned with praises, to whom the Vasus, even, all sing glory.<br> Sweet be our lauds to him whose due is worship: may he with all protection guard our princes.<br> 4 Even he whom Aditi the Goddess praises, rejoicing in God Savitar's incitement:<br> Even he who praise the high imperial Rulers, Varu&#7751;a, Mitra, Aryaman, sing in concert.<br> 5 They who come emulous to our oblation, dispensing bounty, from the earth and heaven.<br> May they and Ahibudhnya hear our calling: guard us Var&#363;tr&#299; with the Ekadhenus.<br> 6 This may the Lord of Life, entreated, grant us,&#151;the wealth which Savitar the God possesses.<br> The mighty calls on Bhaga for protection, on Bhaga calls the weak to give him riches.<br> 7 Bless us the Vajins when we call, while slowly they move, strong Singers, to the Gods&#146; assembly.<br> Crushing the wolf, the serpent, and the demons, may they completely banish all affliction.<br> 8 Deep-skilled in Law eternal, deathless, Singers, O Vajins, help us in each fray for booty.<br> Drink of this meath, he satisfied, be joyful: then go on paths which Gods are wont to travel.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07039.htm\">Next: HYMN XXXIX Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07038.html",
  "api": "json/hymns/07038.json",
  "data": {
    "title": "HYMN XXXVIII. Indra.",
    "describe": "ON high hath Indra, this Deva, extended the golden lustre which he spreads around him.",
    "feecting": "p:ON high hath Indra, this Deva, extended the golden lustre which he spreads around him.\np: Now, now must Bhaga be invoked by mortals, Lord of great riches who distributes treasures.\r\np:Rise up, O Indra whose hands are golden, and hear this man while offering is offered, Spreading afar thy broad and wide effulgence, and bringing mortal men the food that feeds them.\np:Let Indra the Deva he hymned with praises, to whom the Devas, even, all sing glory. Sweet be our lauds to him whose due is worship. May he with all protection guard our princes.\np:Even he whom Aditi the Goddess praises, rejoicing in God Indra's incitement: Even he who praise the high imperial Rulers, Varu&#7751;a, Mitra, Aryaman, sing in concert.\np:They who come emulous to our oblation, dispensing bounty, from the Earth and Heaven. May they and Ahibudhnya hear our calling: guard us Var&#363;tr&#299; with the Ekadhenus.\np:Thi. May the Lord of Life, entreated, grant us,&#151;the wealth which Indra the Deva possesses. The mighty calls on Bhaga for protection, on Bhaga calls the weak to give him riches.\np:Bless us the Vajins when we call, while slowly they move, strong Singers, to the Devas&#146; assembly. Crushing the wolf, the serpent, and the demons. May they completely banish all affliction.\np:Deep-skilled in Law eternal, deathless, Singers, O Vajins, help us in each fray for booty. Drink of this meath, he satisfied, be joyful: then go on paths which Devas are wont to travel.",
    "next": "07039",
    "previous": "07037",
    "book": "07"
  },
  "created": 1638555942873,
  "updated": 1638791780811
}