{
  "key": "07055",
  "title": "RigVeda Hymn 07055",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN LV. Vastospati.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07055.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07054.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07056.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LV. Vastospati.</h3>  \n<p>1. VASTOSPATI, who killest all disease and wearest every form,<br> Be an auspicious Friend to us.<br> 2 When, O bright Son of Saram&#257;, thou showest, tawny-hued! thy teeth,<br> They gleam like lances' points within thy mouth when thou wouldst bite; go thou to steep.<br> 3 Saram&#257;'s Son, retrace thy way: bark at the robber and the thief.<br> At Indra's singers barkest thou? Why dust thou seek to terrify us? Go to sleep.<br> 4 Be on thy guard against the boar, and let the boar beware of thee.<br> At Indra's singers barkest thou? Why dost thou seek to terrify us? Go to sleep.<br> 5 Sleep mother, let the father sleep, sleep dog and master of the house.<br> Let all the kinsmen sleep, sleep all the people who are round about.<br> 6 The man who sits, the man who walks, and whosoever looks on us,<br> Of these we closely shut the eyes, even as we closely shut this house.<br> 7 The Bull who hath a thousand horns, who rises up from out the sea,&#151;<br> By him the Strong and Mighty One we lull and make the people sleep.<br> 8 The women sleeping in the court, lying without, or stretched on beds,<br> The matrons with their odorous sweetsthese, one and all, we lull to sleep.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07056.htm\">Next: HYMN LVI. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07055.html",
  "api": "hymns/07055json",
  "data": {
    "title": "HYMN LV. Vastospati.",
    "describe": "VASTOSPATI, who killest all disease and wearest every form, be an auspicious Friend to us.",
    "feecting": "p:VASTOSPATI, who killest all disease and wearest every form, be an auspicious Friend to us.\np:When, O bright Son of Saramā, thou showest, tawny-hued! thy teeth, they gleam like lances' points within thy mouth when thou wouldst bite; go thou to steep.\np:Saramā's Son, retrace thy way: bark at the robber and the thief.\np: At Indra's singers barkest thou? Why dust thou seek to terrify us? Go to sleep.\r\np:Be on thy guard against the boar, and let the boar beware of thee. At Indra's singers barkest thou? Why dost thou seek to terrify us? Go to sleep.\np:Sleep mother, let the father sleep, sleep dog and master of the house. Let all the kinsmen sleep, sleep all the people who are round about.\np:The man who sits, the man who walks, and whosoever looks on us, Of these we closely shut the eyes, even as we closely shut this house.\np:The Bull who hath a thousand horns, who rises up from out the sea,— By him the Strong and Mighty One we lull and make the people sleep.\np:The women sleeping in the court, lying without, or stretched on beds, the matrons with their odorous sweetsthese, one and all, we lull to sleep.",
    "next": "07056",
    "previous": "07054",
    "book": "07"
  },
  "created": 1638556033000
}