{
  "key": "07059",
  "title": "RigVeda Hymn 07059",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN LIX. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07059.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07058.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07060.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LIX. Maruts.</h3>  \n<p>1. WHOMSO ye rescue here and there, whomso ye guide, O Deities,<br> To him give shelter, Agni, Mitra, Varu&#7751;a, ye Maruts, and thou Aryaman.<br> 2 Through your kind favour, Gods, on some auspicious day, the worshipper subdues his foes.<br> That man increases home and strengthening ample food who brings you offerings as ye list.<br> 3 Vasi&#7779;&#7789;ha will not overlook the lowliest one among you all.<br> O Maruts, of our Soma juice effused to-day drink all of you with eager haste.<br> 4 Your succour in the battle injures not the man to whom ye, Heroes, grant your gifts.<br> May your most recent favour turn to us again. Come quickly, ye who fain would drink.<br> 5 Come hitherward to drink the juice, O ye whose bounties give you joy.<br> These offerings are for you, these, Maruts, I present. Go not to any place but this.<br> 6 Sit on our sacred grass, be graciously inclined to give the wealth for which we long,<br> To take delight, ye Maruts, Friends of all, with Sv&#257;h&#257;, in sweet Soma juice.<br> 7 Decking the beauty of their forms in secret the Swans with purple backs have flown down hither.<br> Around me all the Company hath settled, like joyous Heroes glad in our libation.<br> 8 Maruts, the man whose wrath is hard to master, he who would slay us ere we think, O Vasus,<br> May he be tangled in the toils of mischief; smite ye him down with your most flaming weapon.<br> 9 O Maruts, ye consuming Gods, enjoy this offering brought for you,<br> To help us, ye who slay the foe.<br> 10 Sharers of household sacrifice, come, Maruts, stay not far away,<br> That ye may help us, Bounteous Ones.<br> 11 Here, Self-strong Maruts, yea, even here. ye Sages with your sunbright skins<br> I dedicate your sacrifice.<br> 12 Tryambaka we worship, sweet augmenter of prosperity.<br> As from its stem the cucumber, so may I be released from death, not reft of immortality.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07060.htm\">Next: HYMN LX. Mitra-Varu&#7751;a.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07059.html",
  "api": "json/hymns/07059.json",
  "data": {
    "title": "HYMN LIX. Devas.",
    "describe": "WHOMSO ye rescue here and there, whomso ye guide, O Deities, to him give shelter, Agni, Mitra, Varu&#7751;",
    "feecting": "p:WHOMSO ye rescue here and there, whomso ye guide, O Deities, to him give shelter, Agni, Mitra, Varu&#7751;a, ye Devas, and thou Aryaman.\np:Through your kind favour, Devas, on some auspicious day, the worshipper subdues his foes.\np: That man increases home and strengthening ample food who brings you offerings as ye list.\r\np:Vasi&#7779;&#7789;ha will not overlook the lowliest one among you all. O Devas, of our Soma juice effused to-day drink all of you with eager haste.\np:Your succour in the battle injures not the man to whom ye. Heroes, grant your gifts. May your most recent favour turn to us again. Come quickly, ye who fain would drink.\np:Come hitherward to drink the juice, O ye whose bounties give you joy. These offerings are for you, these, Devas, I present. Go not to any place but this.\np:Sit on our sacred grass, be graciously inclined to give the wealth for which we long, to take delight, ye Devas, Friends of all, with Sv&#257;h&#257;, in sweet Soma juice.\np:Decking the beauty of their forms in secret the Swans with purple backs have flown down hither. Around me all the Company hath settled, like joyous Heroes glad in our libation.\np:Devas, the man whose wrath is hard to master, he who would subdue us ere we think, O Devas, May he be tangled in the toils of mischief; smite ye him down with your most flaming weapon.\np:O Devas, ye consuming Devas, enjoy this offering brought for you, to help us, ye who subdue the foe.\np:Sharers of household offering, come, Devas, stay not far away, that y. May help us, Bounteous Ones.\np:Here, Self-strong Devas, yea, even here. ye Sages with your sunbright skins I dedicate your offering.\np:Tryambaka we worship, sweet augmenter of prosperity. As from its stem the cucumber, s. May I be released from death, not reft of immortality.",
    "next": "07060",
    "previous": "07058",
    "book": "07"
  },
  "created": 1638556053996,
  "updated": 1638647018261
}