{
  "key": "07057",
  "title": "RigVeda Hymn 07057",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN LVII. Maruts.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07057.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07056.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07058.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LVII. Maruts.</h3>  \n<p>1. YEA, through the power of your sweet juice, ye Holy! the Marut host is glad at sacrifices.<br> They cause even spacious heaven and earth to tremble, they make the spring flow when they come, the Mighty.<br> 2 The Maruts watch the man who sings their praises, promoters of the thought of him who worships.<br> Seat you on sacred grass in our assembly, this day, with friendly minds, to share the banquet.<br> 3 No others gleam so brightly as these Maruts with their own forms, their golden gauds, their weapons.<br> With all adornments, decking earth and heaven, they heighten, for bright show, their common splendour.<br> 4 Far from us be your blazing dart, O Maruts, when we, through human frailty, sin against you.<br> Let us not he exposed to that, ye Holy! May your most loving favour still attend us.<br> 5 May even what we have done delight the Maruts, the blameless Ones, the bright, the purifying.<br> Further us, O ye Holy, with your kindness: advance us mightily that we may prosper.<br> 6 And may the Maruts, praised by all their titles, Heroes, enjoy the taste of our oblations.<br> Give us of Am&#7771;ta for the sake of offspring: awake the excellent fair stores of riches.<br> 7 Hither, ye Maruts, praised, with all your succours, with all felicity come to our princes,<br> Who, of themselves, a hundredfold increase us. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07058.htm\">Next: HYMN LVIII. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07057.html",
  "api": "hymns/07057json",
  "data": {
    "title": "HYMN LVII. Devas.",
    "describe": "YEA, through the power of your sweet juice, ye Holy!",
    "feecting": "p:YEA, through the power of your sweet juice, ye Holy! the Marut host is glad at offers.\np: They cause even spacious Heaven and Earth to tremble, they make the spring flow when they come, the Mighty.\r\np:The Devas watch the man who sings their praises, promoters of the thought of him who worships. Seat you on sacred grass in our assembly, this day, with friendly minds, to share the banquet.\np:No others gleam so brightly as these Devas with their own forms, their golden gauds, their weapons. With all adornments, decking Earth and Heaven, they heighten, for bright show, their common splendour.\np:Far from us be your blazing dart, O Devas, when we, through human frailty, sin against you. Let us not he exposed to that, ye Holy! May your most loving favour still attend us.\np:May even what we have done delight the Devas Ones, the bright, the purifying. Further us, O ye Holy, with your kindness: advance us mightily that we may prosper.\np:An. May the Devas, praised by all their titles, Heroes, enjoy the taste of our oblations. Give us of Amṛta for the sake of offspring: awake the excellent fair stores of riches.\np:Hither, ye Devas, praised, with all your succours, with all felicity come to our princes, who, of themselves, a hundredfold increase us. Preserve us evermore, ye Devas, with blessings.",
    "next": "07058",
    "previous": "07056",
    "book": "07"
  },
  "created": 1638556043494
}