{
  "key": "07068",
  "title": "RigVeda Hymn 07068",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN LXVIII. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07068.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07067.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07069.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXVIII. A&#347;vins.</h3>  \n<p>1. COME, radiant A&#347;vins, with your noble horses: accept your servant's hymns, ye Wonder-Workers:<br> Enjoy oblations which we bring to greet you.<br> 2 The gladdening juices stand prepared before you: come quickly and partake of mine oblation.<br> Pass by the calling of our foe and bear us.<br> 3 Your chariot with a hundred aids, O A&#347;vins, beareth you swift as thought across the regions,<br> Speeding to us, O ye whose wealth is S&#363;rya.<br> 4 What time this stone of yours, the Gods&#146; adorer, upraised, sounds forth for you as Soma-presser,<br> Let the priest bring you, Fair Ones, through oblations.<br> 5 The nourishment ye have is, truly, wondrous: ye gave thereof a quickening store to Atri,<br> Who being dear to you, receives your favour.<br> 6 That gift, which all may gain, ye gave Cyav&#257;na, when he grew old, who offered you oblations,<br> When ye bestowed on him enduring beauty.<br> 7 What time his wicked friends abandoned Bhujyu, O A&#347;vins, in the middle of the ocean,<br> Your horse delivered him, your faithful servant.<br> 8 Ye lent your aid to Vrka when exhausted, and listened when invoked to &#346;ayu's calling.<br> Ye made the cow pour forth her milk like water, and, A&#347;vins, strengthened with your strength the barren.<br> 9 With his fair hymns this singer, too, extols you, waking with glad thoughts at the break of morning.<br> May the cow nourish him with milk to feed llim. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07069.htm\">Next: HYMN LXIX. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07068.html",
  "api": "json/hymns/07068.json",
  "data": {
    "title": "HYMN LXVIII. A&#347;vins.",
    "describe": "COME, radiant A&#347;",
    "feecting": "p:COME, radiant A&#347;vins, with your noble horses: accept your servant's hymns, ye Wonder-Workers: Enjoy oblations which we bring to greet you.\np:The gladdening juices stand prepared before you: come quickly and partake of mine oblation.\np: Pass by the calling of our foe and bear us.\r\np:Your chariot with a hundred aids, O A&#347;vins, beareth you swift as thought across the regions, Speeding to us, O ye whose wealth is S&#363;rya.\np:What time this stone of yourss&#146; adorer, upraised, sounds forth for you as Soma-presser, Let the Monk bring you, Fair Ones, through oblations.\np:The nourishment ye have is, truly, wondrous: ye gave thereof a quickening store to Atri, who being dear to you, receives your favour.\np:That gift, which al. May gain, ye gave Cyav&#257;na, when he grew old, who offered you oblations, when ye bestowed on him enduring beauty.\np:What time his wicked friends abandoned Bhujyu, O A&#347;vins, in the middle of the ocean, Your horse delivered him, your faithful servant.\np:Ye lent your aid to Vrka when exhausted, and listened when invoked to &#346;ayu's calling. Ye made the cow pour forth her milk like water, and, A&#347;vins, strengthened with your strength the barren.\np:With his fair hymns this singer, too, extols you, waking with glad thoughts at the break of morning. May the cow nourish him with milk to feed llim. Preserve us evermore, ye Devas, with blessings.",
    "next": "07069",
    "previous": "07067",
    "book": "07"
  },
  "created": 1638556101347,
  "updated": 1638647018272
}