{
  "key": "07071",
  "title": "RigVeda Hymn 07071",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN LXXI. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07071.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07070.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07072.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXI. A&#347;vins.</h3>  \n<p>1. THE Night retireth from the Dawn her Sister; the Dark one yieldeth to the Red her pathway.<br> Let us invoke you rich in steeds and cattle - by day and night keep far from us the arrow.<br> 2 Bearing rich treasure in your car, O A&#347;vins, come to the mortal who presents oblation.<br> Keep at a distance penury and sickness; Lovers of Sweetness, day and night preserve us.<br> 3 May your strong horses, seeking bliss, bring hither your chariot at the earliest flush of morning.<br> With coursers yoked by Law drive hither, A&#347;vins, your car whose reins are light, laden with treasure.<br> 4 The chariot, Princes, that conveys you, moving at daylight, triple-seated, fraught with riches,<br> Even with this come unto us, N&#257;satyas, that laden with all food it may approach us.<br> 5 Ye freed Cyav&#257;na from old age and weakness: ye brought the courser fleet of food to Pedu.<br> Ye rescued Atri from distress and darkness, and loosed for J&#257;hu&#7779;a the bonds that bound him.<br> 6 This is the thought, this is the song, O A&#347;vins: accept this hymn of ours, ye Steers, With favour.<br> May these our prayers addressed to you come nigh you. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07072.htm\">Next: HYMN LXXII. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07071.html",
  "api": "json/hymns/07071.json",
  "data": {
    "title": "HYMN LXXI. A&#347;vins.",
    "describe": "THE Night retireth from the Dawn her Sister;",
    "feecting": "p:THE Night retireth from the Dawn her Sister; the Dark one yieldeth to the Red her pathway.\np: Let us invoke you rich in steeds and cattle - by day and night keep far from us the arrow.\r\np:Bearing rich treasure in your car, O A&#347;vins, come to the mortal who presents oblation. Keep at a distance penury and sickness; Lovers of Sweetness, day and night preserve us.\np:May your strong horses, seeking bliss, bring hither your chariot at the earliest flush of morning. With coursers yoked by Law drive hither, A&#347;vins, your car whose reins are light, laden with treasure.\np:The chariot, Princes, that conveys you, moving at daylight, triple-seated, fraught with riches, Even with this come unto us, N&#257;satyas, that laden with all food i. May approach us.\np:Ye freed Cyav&#257;na from old age and weakness: ye brought the courser fleet of food to Pedu. Ye rescued Atri from distress and darkness, and loosed for J&#257;hu&#7779;a the bonds that bound him.\np:This is the thought, this is the song, O A&#347;vins: accept this hymn of ours, ye Steers, with favour. May these our meditations addressed to you come nigh you. Preserve us evermore, ye Devas, with blessings.",
    "next": "07072",
    "previous": "07070",
    "book": "07"
  },
  "created": 1638556117379,
  "updated": 1638790698195
}