{
  "key": "07070",
  "title": "RigVeda Hymn 07070",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN LXX. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07070.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07069.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07071.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXX. A&#347;vins.</h3>  \n<p>1. RICH in all blessings, A&#347;vins come ye hither: this place on earth is called your own possession,<br> Like a strong horse with a fair back it standeth, whereon, as in a lap, ye seat you firmly.<br> 2 This most delightful eulogy awaits you in the man's house drink-offering hath been heated,<br> Which bringeth you over the seas and rivers, yoking as&#146;twere two well-matched shining horses.<br> 3 Whatever dwellings ye possess, O A&#347;vins, in fields of men or in the streams of heaven,<br> Resting upon the summit of the mountain, or bringing food to him who gives oblation,<br> 4 Delight yourselves, ye Gods, in plants and waters when &#7770;&#7779;is give them and ye find they suit You.<br> Enriching us with treasures in abundance ye have looked back to former generations.<br> 5 A&#347;vins, though ye have heard them oft aforetime, regard the many prayers which &#7770;&#7779;is offer.<br> Come to the man even as his heart desireth: may we enjoy your most delightful favour.<br> 6 Come to the sacrifice offered you, N&#257;satyas, with men, oblations, and prayer duly uttered.<br> Come to Vasi&#7779;&#7789;ha as his heart desireth, for unto you these holy hymns are chanted.<br> 7 This is the thought, this is the song, O A&#347;vins: accept this hymn of ours, ye Steers, with favour.<br> May these our prayers addressed to you come nigh you. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07071.htm\">Next: HYMN LXXI. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/07070.html",
  "api": "hymns/07070json",
  "data": {
    "title": "HYMN LXX. Aśvins.",
    "describe": "RICH in all blessings, Aśvins come ye hither: this place on Earth is called your own possession, like a strong horse with a fair back it standeth, whereon, as in a lap, ye seat you firmly.",
    "feecting": "p:RICH in all blessings, Aśvins come ye hither: this place on Earth is called your own possession, like a strong horse with a fair back it standeth, whereon, as in a lap, ye seat you firmly.\np:This most delightful eulogy awaits you in the man's house drink-offering hath been heated, Which bringeth you over the seas and rivers, yoking as’twere two well-matched shining horses.\np:Whatever dwellings ye possess, O Aśvins, in fields of men or in the streams of Heaven, Resting upon the summit of the mountain, or bringing food to him who gives oblation,\np:Delight yourselves, ye Devas, in plants and waters when Ṛṣis give them and ye find they suit You.\np: Enriching us with treasures in abundance ye have looked back to former generations.\r\np:Aśvins, though ye have heard them oft aforetime, regard the many prayers which Ṛṣis offer. Come to the man even as his heart desireth. May we enjoy your most delightful favour.\np:Come to the offering offered you, Nāsatyas, with men, oblations, and prayer duly uttered. Come to Vasiṣṭha as his heart desireth, for unto you these holy hymns are chanted.\np:This is the thought, this is the song, O Aśvins: accept this hymn of ours, ye Steers, with favour. May these our meditations addressed to you come nigh you. Preserve us evermore, ye Devas, with blessings.",
    "next": "07071",
    "previous": "07069",
    "book": "07"
  },
  "created": 1638556112139
}