{
  "key": "07077",
  "title": "RigVeda Hymn 07077",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN LXXVIT. Dawn.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07077.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07076.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07078.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXVIT. Dawn.</h3>  \n<p>1. SHE hath shone brightly like a youthful woman, stirring to motion every living creature.<br> Agni hath come to feed on mortal? fuel. She hath made light and chased away the darkness.<br> 2 Turned to this All, far-spreading, she hath risen and shone in brightness with white robes about her.<br> She hath beamed forth lovely with golden colours, Mother of kine, Guide of the days she bringeth.<br> 3 Bearing the Gods&#146; own Eye, auspicious Lady, leading her Courser white and fair to look on,<br> Distinguished by her bean-is Dawn shines apparent, come forth to all the world with wondrous treasure.<br> 4 Draw nigh with wealth and dawn away the foeman: prepare for us wide pasture free from danger.<br> Drive away those who hate us, bring us riches: pour bounty, opulent Lady, on the singer.<br> 5 Send thy most excellent beams to shine and light us, giving us lengthened days, O Dawn, O Goddess,<br> Granting us food, thou who hast all things precious, and bounty rich in chariots, kine, and horses.<br> 6 O U&#7779;as, nobly-born, Daughter of Heaven, whom the Vasisthas with their hymns make mighty,<br> Bestow thou on us vast and glorious riches. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07078.htm\">Next: HYMN LXXVIII. Dawn.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07077.html",
  "api": "json/hymns/07077.json",
  "data": {
    "title": "HYMN LXXVIT. Dawn.",
    "describe": "SHE hath shone brightly like a youthful woman, stirring to motion every living creature.",
    "feecting": "p:SHE hath shone brightly like a youthful woman, stirring to motion every living creature.\np: Agni hath come to feed on mortal? fuel. She hath made light and chased away the darkness.\r\np:Turned to this All, far-spreading, she hath risen and shone in brightness with white robes about her. She hath beamed forth lovely with golden colours, Mother of kine, Guide of the days she bringeth.\np:Bearing the Devas&#146; own Eye, auspicious Lady, leading her Courser white and fair to look on, Distinguished by her bean-is Dawn shines apparent, come forth to all the world with wondrous treasure.\np:Draw nigh with wealth and dawn away the foeman: prepare for us wide pasture free from danger. Drive away those who hate us, bring us riches: pour bounty, opulent Lady, on the singer.\np:Send thy most excellent beams to shine and light us, giving us lengthened days, O Dawn, O Goddess, Granting us food, thou who hast all things precious, and bounty rich in chariots, kine, and horses.\np:O U&#7779;as, nobly-born, Daughter of Heaven, whom the Vasisthas with their hymns make mighty, bestow thou on us vast and glorious riches. Preserve us evermore, ye Devas, with blessings.",
    "next": "07078",
    "previous": "07076",
    "book": "07"
  },
  "created": 1638556149008,
  "updated": 1638791780844
}