{
  "key": "07087",
  "title": "RigVeda Hymn 07087",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN LXXXVII. Varu&#7751;a.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07087.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07086.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07088.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXVII. Varu&#7751;a.</h3>  \n<p>1. VARUNA cut a pathway out for S&#363;rya, and led the watery floods of rivers onward.<br> The Mares, as in a race, speed on in order. He made great channels for the days to follow.<br> 2 The wind, thy breath, hath sounded through the region like a wild beast that seeks his food in pastures.<br> Within these two, exalted Earth and Heaven, O Varu&#7751;a, are all the forms thou lovest.<br> 3 Varu&#7751;a's spies, sent forth upon their errand, survey the two world-halves well formed and fashioned.<br> Wise are they, holy, skilled in sacrifices, the furtherers of the praise-songs of the prudent.<br> 4 To me who understand hath Varu&#7751;a spoken, the names borne by the Cow are three times seven.<br> The sapient God, knowing the place's secret, shall speak as &#146;twere to teach the race that cometh.<br> 5 On him three heavens rest and are supported, and the three earths are there in sixfold order.<br> The wise King Varu&#7751;a hath made in heaven that Golden Swing to cover it with glory.<br> 6 Like Varu&#7751;a from heaven he sinks in Sindhu, like a white-shining spark, a strong wild creature.<br> Ruling in depths and meting out the region, great saving power hath he, this world's Controller.<br> 7 Before this Varu&#7751;a may we be sinless him who shows mercy even to the sinner-<br> While we are keeping Aditi's ordinances. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07088.htm\">Next: HYMN LXXXVIII. Varu&#7751;a.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07087.html",
  "api": "json/hymns/07087.json",
  "data": {
    "title": "HYMN LXXXVII. Varu&#7751;a.",
    "describe": "VARUNA cut a pathway out for S&#363;",
    "feecting": "p:VARUNA cut a pathway out for S&#363;rya, and led the watery floods of rivers onward.\np: The Mares, as in a race, speed on in order. He made great channels for the days to follow.\r\np:The wind, thy breath, hath sounded through the region like a wild beast that seeks his food in pastures. Within these two, exalted Earth and Heaven, O Varu&#7751;a, are all the forms thou lovest.\np:Varu&#7751;a's spies, sent forth upon their errand, survey the two world-halves well formed and fashioned. Wise are they, holy, skilled in offers, the furtherers of the praise-songs of the prudent.\np:To me who understand hath Varu&#7751;a spoken, the names borne by the Cow are three times seven. The sapient Deva, knowing the place's secret, shall speak as &#146;twere to teach the race that cometh.\np:On him three heavens rest and are supported, and the three earths are there in sixfold order. The wise King Varu&#7751;a hath made in Heaven that Golden Swing to cover it with glory.\np:Like Varu&#7751;a from Heaven he sinks in Sindhu, like a white-shining spark, a strong wild creature. Ruling in depths and meting out the region, great saving power hath he, this world's Controller.\np:Before this Varu&#7751;. May we be sinless him who shows mercy even to the sinner- While we are keeping Aditi's ordinances. Preserve us evermore, ye Devas, with blessings.",
    "next": "07088",
    "previous": "07086",
    "book": "07"
  },
  "created": 1638556201865,
  "updated": 1638791253216
}