{
  "key": "07086",
  "title": "RigVeda Hymn 07086",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN LXXXVI. Varu&#7751;a.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07086.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07085.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07087.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXVI. Varu&#7751;a.</h3>  \n<p>1. WISE, verily, are creatures through his greatness who stayed ever, spacious heaven and earth asunder;<br> Who urged the high and mighty sky to motion, the Star of old, and spread the earth before him.<br> 2 With mine own heart I commune on the question how Varu&#7751;a and I may be united.<br> What gift of mine will he accept unangered? When may I calmly look and find him gracious?<br> 3 Fain to know this is my sin I question others: I seek the wise, O Varu&#7751;a, and ask them.<br> This one same answer even the sages gave me, \"Surely this Varu&#7751;a is angry with thee.\"<br> 4 What, Varu&#7751;a, hath been my chief transgression, that thou wouldst slay the friend who sings thy praises?<br> Tell me, Unconquerable Lord, and quickly sinless will I approach thee with mine homage.<br> 5 Free us from sins committed by our fathers, from those wherein we have ourselves offended.<br> O King, loose, like a thief who feeds the cattle, as from the cord a calf, set free Vasi&#7779;&#7789;ha.<br> 6 Not our own will betrayed us, but seduction, thoughtlessness, Varu&#7751;a wine, dice, or anger.<br> The old is near to lead astray the younger: even sleep removeth not all evil-doing.<br> 7 Slavelike may I do service to the Bounteous, serve, free from sin, the God inclined to anger.<br> This gentle Lord gives wisdom to the simple: the wiser God leads on the wise to riches.<br> 8 O Lord, O Varu&#7751;a, may this laudation come close to thee and lie within thy spirit.<br> May it be well with us in rest and labour. Preserve us ever-more, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07087.htm\">Next: HYMN LXXXVII. Varu&#7751;a.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07086.html",
  "api": "json/hymns/07086.json",
  "data": {
    "title": "HYMN LXXXVI. Varu&#7751;a.",
    "describe": "WISE, verily, are creatures through his greatness who stayed ever, spacious Heaven and Earth asunder.",
    "feecting": "p:WISE, verily, are creatures through his greatness who stayed ever, spacious Heaven and Earth asunder. Who urged the high and mighty sky to motion, the Star of old, and spread the Earth before him.\np:With mine own heart I commune on the question how Varu&#7751;a and . May be united.\np: What gift of mine will he accept unangered? Whe. May I calmly look and find him gracious?\r\np:Fain to know this is my sin I question others: I seek the wise, O Varu&#7751;a, and ask them. This one same answer even the sages gave me, \"Surely this Varu&#7751;a is angry with thee.\"\np:What, Varu&#7751;a, hath been my chief transgression, that thou wouldst subdue the friend who sings thy praises? Tell me, Unconquerable Lord, and quickly sinless will I approach thee with mine homage.\np:Free us from sins committed by our fathers, from those wherein we have ourselves offended. O King, loose, like a thief who feeds the cattle, as from the cord a calf, set free Vasi&#7779;&#7789;ha.\np:Not our own will betrayed us, but seduction, thoughtlessness, Varu&#7751;a wine, dice, or anger. The old is near to lead astray the younger: even sleep removeth not all evil-doing.\np:Slavelik. May I do service to the Bounteous, serve, free from sin inclined to anger. This gentle Lord gives wisdom to the simple: the wiser God leads on the wise to riches.\np:O Lord, O Varu&#7751;a. May this laudation come close to thee and lie within thy spirit. May it be well with us in rest and labour. Preserve us ever-more, ye Devas, with blessings.",
    "next": "07087",
    "previous": "07085",
    "book": "07"
  },
  "created": 1638556196550,
  "updated": 1638791780852
}