{
  "key": "07099",
  "title": "RigVeda Hymn 07099",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN XCIX. Vi&#7779;&#7751;u.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07099.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07098.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07100.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCIX. Vi&#7779;&#7751;u.</h3>  \n<p>1. MEN come not nigh thy majesty who growest beyond all bound and measure with thy body.<br> Both thy two regions of the earth, O Vi&#7779;&#7751;u, we know: thou God, knowest the highest also.<br> 2 None who is born or being born, God Vi&#7779;&#7751;u, hath reached the utmost limit of thy grandeur.<br> The vast high vault of heaven hast thou supported, and fixed earth's eastern pinnacle securely.<br> 3 Rich in sweet food be ye, and rich in milch-kine, with fertile pastures, fain to do men service.<br> Both these worlds, Vi&#7779;&#7751;u, hast thou stayed asunder, and firmly fixed the earth with pegs around it.<br> 4 Ye have made spacious room for sacrificing by generating S&#363;rya, Dawn, and Agni.<br> O Heroes, ye have conquered in your battles even the bull-jawed D&#257;sa's wiles and magic.<br> 5 Ye have destroyed, thou, Indra, and thou Vi&#7779;&#7751;u, &#346;ambara's nine-and-ninety fenced castles.<br> Ye Twain smote down a hundred times a thousand resistless heroes of the royal Varcin.<br> 6 This is the lofty hymn of praise, exalting the Lords of Mighty Stride, the strong and lofty.<br> I laud you in the solemn synods, Vi&#7779;&#7751;u: pour ye food on us in our camps, O Indra.<br> 7 O Vi&#7779;&#7751;u, unto thee my lips cry Va&#7779;a&#7789;! Let this mine offering, Sipivista, please thee.<br> May these my songs of eulogy exalt thee. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07100.htm\">Next: HYMN C. Vi&#7779;&#7751;u.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07099.html",
  "api": "json/hymns/07099.json",
  "data": {
    "key": "07099",
    "title": "HYMN XCIX. Indra.",
    "describe": "MEN come not nigh thy majesty who growest beyond all bound and measure with thy body.",
    "feecting": "p:MEN come not nigh thy majesty who growest beyond all bound and measure with thy body.\np: Both thy two regions of the Earth, O Indra, we know: thou Deva, knowest the highest also.\r\np:None who is born or being born, Deva Indra, hath reached the utmost limit of thy grandeur. The vast high vault of Heaven hast thou supported, and fixed Earth's eastern pinnacle securely.\np:Rich in sweet food be ye, and rich in milch-kine, with fertile pastures, fain to do men service. Both these worlds, Indra, hast thou stayed asunder, and firmly fixed the Earth with pegs around it.\np:Ye have made spacious room for sacrificing by generating Sūrya, Dawn, and Agni. O Heroes, ye have conquered in your battles even the bull-jawed Dāsa's wiles and magic.\np:Ye have conquered Indra, and thou Indra, Śambara's nine-and-ninety fenced castles. Ye Twain smote down a hundred times a thousand resistless heroes of the royal Varcin.\np:This is the lofty hymn of praise, exalting the Lords of Mighty Stride, the strong and lofty. I laud you in the solemn synods, Indra: pour ye food on us in our camps, O Indra.\np:O Indra, unto thee my lips cry Vaṣaṭ! Let this mine offering, Sipivista, please thee. May these my songs of eulogy exalt thee. Preserve us evermore, ye Devas, with blessings.",
    "meta": {
      "next": "07100",
      "previous": "07098",
      "book": "07",
      "original": "https://sacred-texts.com/hin/rigveda/rv07099.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv07099.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "07099",
            "title": "HYMN XCIX. Indra."
          },
          {
            "key": "07099",
            "title": "HYMN XCIX. Indra."
          },
          {
            "key": "07099",
            "title": "HYMN XCIX. Indra."
          }
        ]
      },
      {
        "name": "O Heroes",
        "hymns": [
          {
            "key": "07099",
            "title": "HYMN XCIX. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638556264964,
  "updated": 1667450403992
}