{
  "key": "07091",
  "title": "RigVeda Hymn 07091",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN XCI. V&#257;yu.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07091.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07090.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07092.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCI. V&#257;yu.</h3>  \n<p>1. WERE not in sooth, the Gods aforetime blameless, whose pleasure was increased by adoration?<br> For V&#257;yu and for man in his affliction they caused the Morning to arise with S&#363;rya.<br> 2 Guardians infallible, eager as envoys' preserve us safe through many months and autumns.<br> Addressed to you, our fair praise, Indra-V&#257;yu, implores your favour and renewed well-being.<br> 3 Wise, bright, arranger of his teams, he. seeketh men with rich food whose treasures are abundant.<br> They have arranged them of one mind with V&#257;yu: the men have wrought all noble operations.<br> 4 So far as native power and strength permit you, so far as men behold whose eyes have vision,<br> O ye pure-drinkers, drink with us pure Soma: sit on this sacred grass, Indra and V&#257;yu.<br> 5 Driving down teams that bear the lovely Heroes, hitherward, Indra-V&#257;yu, come together.<br> To you this prime of savoury juice is offered: here loose your horses and be friendly-minded.<br> 6 Your hundred and your thousand teams, O Indra and V&#257;yu, all-munificent, which attend you,<br> With these most gracious-minded come ye hither, and drink, O Heroes of the meath we offer.<br> 7 Like coursers seeking fame will we Vasisthas, O Indra-V&#257;yu, with our fair laudations,<br> Exerting all our powe-,, call you to aid us. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07092.htm\">Next: HYMN XCII. V&#257;yu</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07091.html",
  "api": "json/hymns/07091.json",
  "data": {
    "title": "HYMN XCI. V&#257;yu.",
    "describe": "WERE not in sooths aforetime blameless, whose pleasure was increased by adoration?",
    "feecting": "p:WERE not in sooths aforetime blameless, whose pleasure was increased by adoration? For V&#257;yu and for man in his affliction they caused the Morning to arise with S&#363;rya.\np:Guardians infallible, eager as envoys' preserve us safe through many months and autumns.\np: Addressed to you, our fair praise, Indra-V&#257;yu, implores your favour and renewed well-being.\r\np:Wise, bright, arranger of his teams, he. seeketh men with rich food whose treasures are abundant. They have arranged them of one mind with V&#257;yu: the men have wrought all noble operations.\np:So far as native power and strength permit you, so far as men behold whose eyes have vision, O ye pure-drinkers, drink with us pure Soma: sit on this sacred grass, Indra and V&#257;yu.\np:Driving down teams that bear the lovely Heroes, hitherward, Indra-V&#257;yu, come together. To you this prime of savoury juice is offered: here loose your horses and be friendly-minded.\np:Your hundred and your thousand teams, O Indra and V&#257;yu, all-munificent, which attend you, with these most gracious-minded come ye hither, and drink, O Heroes of the meath we offer.\np:Like coursers seeking fame will we Vasisthas, O Indra-V&#257;yu, with our fair laudations, Exerting all our powe-, call you to aid us. Preserve us evermore, ye Devas, with blessings.",
    "next": "07092",
    "previous": "07090",
    "book": "07"
  },
  "created": 1638556222892,
  "updated": 1638647072748
}