{
  "key": "07100",
  "title": "RigVeda Hymn 07100",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN C. Vi&#7779;&#7751;u.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv07100.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07099.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07101.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN C. Vi&#7779;&#7751;u.</h3>  \n<p>1 NE&#146;ER doth the man repent, who, seeking profit, bringeth his gift to the far-striding Vi&#7779;&#7751;u.<br> He who adoreth him with all his spirit winneth himself so great a benefactor.<br> 2 Thou, Vi&#7779;&#7751;u, constant in thy courses, gavest good-will to all men, and a hymn that lasteth,<br> That thou mightst move us to abundant comfort of very splendid wealth with store of horses.<br> 3 Three times strode forth this God in all his grandeur over this earth bright with a hundred splendours.<br> Foremost be Vi&#7779;&#7751;u, stronger than the strongest: for glorious is his name who lives for ever.<br> 4 Over this earth with mighty step strode Vi&#7779;&#7751;u, ready to give it for a home to Manu.<br> In him the humble people trust for safety: he, nobly born, hath made them spacious dwellings.<br> 5 To-day I laud this name, O gipivista, I, skilled in rules, the name of thee the Noble.<br> Yea, I the poor and weak praise thee the Mighty who dwellest in the realm beyond this region.<br> 6 What was there to be blamed in thee, O Vi&#7779;&#7751;u, when thou declaredst, I am Sipivista?<br> Hide not this form from us, nor keep it secret, since thou didst wear another shape in battle.<br> 7 O Vi&#7779;&#7751;u, unto thee my lips cry Va&#7779;a&#7789;! Let this mine offering, Sipivista, please thee.<br> May these my songs of eulogy exalt thee. Preserve us evermore, ye Gods, with blessings.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07101.htm\">Next: HYMN CI. Parjanya.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07100.html",
  "api": "json/hymns/07100.json",
  "data": {
    "key": "07100",
    "title": "HYMN C. Indra.",
    "describe": "NE’ER doth the man repent, who, seeking profit, bringeth his gift to the far-striding Indra.",
    "feecting": "p:NE’ER doth the man repent, who, seeking profit, bringeth his gift to the far-striding Indra.\np: He who adoreth him with all his spirit winneth himself so great a benefactor.\r\np:Thou, Indra, constant in thy courses, gavest good-will to all men, and a hymn that lasteth, that thou mightst move us to abundant comfort of very splendid wealth with store of horses.\np:Three times strode forth this Deva in all his grandeur over this Earth bright with a hundred splendours. Foremost be Indra, stronger than the strongest: for glorious is his name who lives forever.\np:Over this Earth with mighty step strode Indra, ready to give it for a home to Manu. In him the humble people trust for safety: he, nobly born, hath made them spacious dwellings.\np:To-day I laud this name, O gipivista, I, skilled in rules, the name of thee the Noble. Yea, I the poor and weak praise thee the Mighty who dwellest in the realm beyond this region.\np:What was there to be blamed in thee, O Indra, when thou declaredst, I am Sipivista? Hide not this form from us, nor keep it secret, since thou didst wear another shape in battle.\np:O Indra, unto thee my lips cry Vaṣaṭ! Let this mine offering, Sipivista, please thee. May these my songs of eulogy exalt thee. Preserve us evermore, ye Devas, with blessings.",
    "meta": {
      "next": "07101",
      "previous": "07099",
      "book": "07",
      "original": "https://sacred-texts.com/hin/rigveda/rv07100.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv07100.htm"
    },
    "deities": [
      {
        "name": "O gipivista",
        "hymns": [
          {
            "key": "07100",
            "title": "HYMN C. Indra."
          },
          {
            "key": "07100",
            "title": "HYMN C. Indra."
          },
          {
            "key": "07100",
            "title": "HYMN C. Indra."
          },
          {
            "key": "07100",
            "title": "HYMN C. Indra."
          }
        ]
      },
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "07100",
            "title": "HYMN C. Indra."
          },
          {
            "key": "07100",
            "title": "HYMN C. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638556270219,
  "updated": 1667450403995
}