{
  "key": "07103",
  "title": "RigVeda Hymn 07103",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 7: HYMN CIII. Frogs.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n<BR><A HREF=\"rvi07.htm\">Rig-Veda, Book 7 Index</A><BR>\n&nbsp;\n<A HREF=\"rv07102.htm\">Previous</A>&nbsp;\n<A HREF=\"rv07104.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CIII. Frogs.</h3>  \n<p>1. THEY who lay quiet for a year, the Brahmans who fulfil their vows,<br> The Frogs have lifted up their voice, the voice Parjanya hath inspired.<br> 2 What time on these, as on a dry skin lying in the pool's bed, the floods of heaven descended,<br> The music of the Frogs comes forth in concert like the cows lowing with their calves beside them.<br> 3 When at the coming of the Rains the water has poured upon them as they yearned and thirsted,<br> One seeks another as he talks and greets him with cries of pleasure as a son his father.<br> 4 Each of these twain receives the other kindly, while they are revelling in the flow of waters,<br> When the Frog moistened by the rain springs forward, and Green and Spotty both combine their voices.<br> 5 When one of these repeats the other's language, as he who learns the lesson of the teacher,<br> Your every limb seems to be growing larger as ye converse with eloquence on the waters.<br> 6 Onc is Cow-bellow and Goat-bleat the other, one Frog is Green and one of them is Spotty.<br> They bear one common name, and yet they vary, and, talking, modulate the voice diversely.<br> 7 As Brahmans, sitting round the brimful vessel, talk at the Soma-rite of Atiratra,<br> So, Frogs, ye gather round the pool to honour this day of all the year, the first of Rain-time.<br> 8 These Brahmans with the Soma juice, performing their year-long rite, have lifted up their voices;<br> And these Adhvaryus, sweating with their kettles, come forth and show themselves, and none are hidden.<br> 9 They keep the twelve month's God-appointed order, and never do the men neglect the season.<br> Soon as the Rain-time in the year returneth, these who were heated kettles gain their freedom.<br> 10 Cow-bellow and Goat-bleat have granted riches, and Green and Spotty have vouchsafed us treasure.<br> The Frogs who give us cows in hundreds lengthen our lives in this most fertilizing season.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv07104.htm\">Next: HYMN CIV. Indra-Soma.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/07103.html",
  "api": "json/hymns/07103.json",
  "data": {
    "title": "HYMN CIII. Frogs.",
    "describe": "THEY who lay quiet for a year, the Brahmans who fulfil their vows, the Frogs have lifted up their voice, the voice Parjanya hath inspired.",
    "feecting": "p:THEY who lay quiet for a year, the Brahmans who fulfil their vows, the Frogs have lifted up their voice, the voice Parjanya hath inspired.\np:What time on these, as on a dry skin lying in the pool's bed, the floods of Heaven descended, the music of the Frogs comes forth in concert like the cows lowing with their calves beside them.\np:When at the coming of the Rains the water has poured upon them as they yearned and thirsted, One seeks another as he talks and greets him with cries of pleasure as a son his father.\np:Each of these twain receives the other kindly, while they are revelling in the flow of waters, when the Frog moistened by the rain springs forward, and Green and Spotty both combine their voices.\np:When one of these repeats the other's language, as he who learns the lesson of the teacher, Your every limb seems to be growing larger as ye converse with eloquence on the waters.\np:Onc is Cow-bellow and Goat-bleat the other, one Frog is Green and one of them is Spotty.\np: They bear one common name, and yet they vary, and, talking, modulate the voice diversely.\r\np:As Brahmans, sitting round the brimful vessel, talk at the Soma-rite of Atiratra, So, Frogs, ye gather round the pool to honour this day of all the year, the first of Rain-time.\np:These Brahmans with the Soma juice, performing their year-long rite, have lifted up their voices; And these Adhvaryus, sweating with their kettles, come forth and show themselves, and none are hidden.\np:They keep the twelve month's God-appointed order, and never do the men neglect the season. Soon as the Rain-time in the year returneth, these who were heated kettles gain their freedom.\np:Cow-bellow and Goat-bleat have granted riches, and Green and Spotty have vouchsafed us treasure. The Frogs who give us cows in hundreds lengthen our lives in this most fertilizing season.",
    "next": "07104",
    "previous": "07102",
    "book": "07"
  },
  "created": 1638556286011,
  "updated": 1638791253230
}