{
  "key": "08015",
  "title": "RigVeda Hymn 08015",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08015.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08014.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08016.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XV. Indra.</h3>  \n<p>1. SING forth to him whom many men invoke, to him whom many laud.<br> Invite the powerful Indra with your songs of praise.<br> 2 Whose lofty might-for doubly strong is he-supports the heavens and earth,<br> And hills and plains and floods and light with manly power.<br> 3 Such, Praised by many! thou art King alone thou smitest V&#7771;tras dead,<br> To gain, O Indra, spoils of war and high renown.<br> 4 We sing this strong and wild delight of thine which conquers in the fray,<br> Which, Caster of the Stone! gives room and shines like gold.<br> 5 Wherewith thou also foundest lights for &#256;yu and for Manu's sake:<br> Now joying in this sacred grass thou beamest forth.<br> 6 This day too singers of the hymn praise, as of old, this might of thine:<br> Win thou the waters day by day, thralls of the strong.<br> 7 That lofty Indra-power of thine, thy strength and thine intelligence,<br> Thy thunderbolt for which we long, the wish makes keen.<br> 8 O Indra, Heaven and Earth augment thy manly power and thy renown;<br> The waters and thy mountains stir and urge thee on.<br> 9 Vi&#7779;&#7751;u the lofty ruling Power, Varu&#7751;a, Mitra sing thy praise:<br> In thee the Marut3' company have great delight.<br> 10 O Indra, thou wast born the Lord of men, most liberal of thy gifts:<br> Excellent deeds for evermore are all thine own.<br> 11 Ever, alone, O highly-praised, thou sendest V&#7771;tras to their rest:<br> None else than Indra executes the mighty deed.<br> 12 Though here and there, in varied hymns, Indra, men call on thee for aid,<br> Still with our heroes fight and win the light of heaven.<br> 13 Already have all forms of him entered our spacious dwelling-place:<br> For victory stir thou Indra, up, the Lord of Might.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08016.htm\">Next: HYMN XVI. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/08015.html",
  "api": "hymns/08015json",
  "data": {
    "title": "HYMN XV. Indra.",
    "describe": "SING forth to him whom many men invoke, to him whom many laud.",
    "feecting": "p:SING forth to him whom many men invoke, to him whom many laud.\np: Invite the powerful Indra with your songs of praise.\r\np:Whose lofty might-for doubly strong is he-supports the heavens and Earth, and hills and plains and floods and light with manly power.\np:Such, Praised by many! thou art King alone thou smitest Vṛtras dead, to gain, O Indra, spoils of war and high renown.\np:We sing this strong and wild delight of thine which conquers in the fray, Which, Caster of the Stone! gives room and shines like gold.\np:Wherewith thou also foundest lights for Āyu and for Manu's sake: Now joying in this sacred grass thou beamest forth.\np:This day too singers of the hymn praise, as of old, this might of thine: Win thou the waters day by day, thralls of the strong.\np:That lofty Indra-power of thine, thy strength and thine intelligence, Thy thunderbolt for which we long, the wish makes keen.\np:O Indra, Heaven and Earth augment thy manly power and thy renown; The waters and thy mountains stir and urge thee on.\np:Indra the lofty ruling Power, Indra, Mitra sing thy praise: In thee the Marut3' company have great delight.\np:O Indra, thou wast born the Lord of men, most liberal of thy gifts: Excellent deeds forevermore are all thine own.\np:Ever, alone, O highly-praised, thou sendest Vṛtras to their rest: Non else than Indra executes the mighty deed.\np:Though here and there, in varied hymns, Indra, men call on thee for aid, Still with our heroes fight and win the light of Heaven.\np:Already have all forms of him entered our spacious dwelling-place: For victory stir thou Indra, up, the Lord of Might.",
    "next": "08016",
    "previous": "08014",
    "book": "08"
  },
  "created": 1638556370657
}