{
  "key": "08017",
  "title": "RigVeda Hymn 08017",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XVII Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08017.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08016.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08018.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XVII Indra.</h3>  \n<p>1. COME, we have pressed the juice for thee; O Indra, drink this Soma here<br> Sit thou on this my sacred grass.<br> 2 O Indra, let thy long-maned Bays, yoked by prayer, bring thee hitherward<br> Give car and listen to our prayers.<br> 3 We Soma-bearing Brahmans call thee Soma-drinker with thy friend,<br> We, Indra, bringing Soma juice.<br> 4 Come unto us who bring the juice, come unto this our eulogy,<br> Fair-visored! drink thou of the juice.<br> 5 I pour it down within thee, so through all thy members let it spread:<br> Take with. thy tongue the pleasant drink.<br> 6 Sweet to thy body let it be, delicious be the savoury juice:<br> Sweet be the Soma to thine heart.<br> 7 Like women, let this Soma-draught, invested with its robe, approach,<br> O active Indra, close to thee.<br> 8 Indra, transported with the juice, vast in his bulk, strong in his neck<br> And stout arms, smites the V&#7771;tras down.<br> 9 O Indra, go thou forward, thou who rulest over all by might:<br> Thou V&#7771;tra-slayer slay the fiends,<br> 10 Long be thy grasping-hook wherewith thou givest ample wealth to him<br> Who sheds the juice and worships thee.<br> 11 Here, Indra, is thy Soma-draught, made pure upon the sacred grass:<br> Run hither, come and drink thereof.<br> 12 Famed for thy radiance, worshipped well this juice is shed for thy delight<br> Thou art invoked, Akhandala!<br> 13 To Kundapayya, grandson's son, grandson of Srngavrs! to thee,<br> To him have I addressed my thought.<br> 14 Strong pillar thou, Lord of the home armour of Soma-offerers:<br> The drop of Soma breaketh all the strongholds down, and Indra is the &#7770;&#7779;is&#146; Friend.<br> 15 Holy Prdikusanu, winner of the spoil, one eminent o&#146;er many men,<br> Lead on the wild horse Indra with his vigorous grasp forward to drink the Soma juice.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08018.htm\">Next: HYMN XVIII. &#256;dityas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08017.html",
  "api": "json/hymns/08017.json",
  "data": {
    "title": "HYMN XVII Indra.",
    "describe": "COME, we have pressed the juice for thee;",
    "feecting": "p:COME, we have pressed the juice for thee; O Indra, drink this Soma here Sit thou on this my sacred grass.\np:O Indra, let thy long-maned Bays, yoked by prayer, bring thee hitherward Give car and listen to our meditations.\np:We Soma-bearing Brahmans call thee Soma-drinker with thy friend, We, Indra, bringing Soma juice.\np:Come unto us who bring the juice, come unto this our eulogy, Fair-visored! drink thou of the juice.\np:I pour it down within thee, so through all thy members let it spread: Take with. thy tongue the pleasant drink.\np:Sweet to thy body let it be, delicious be the savoury juice: Sweet be the Soma to thine heart.\np:Like women, let this Soma-draught, invested with its robe, approach, O active Indra, close to thee.\np:Indra, transported with the juice, vast in his bulk, strong in his neck And stout arms, smites the V&#7771;tras down.\np:O Indra, go thou forward, thou who rulest over all by might: Thou V&#7771;tra-slayer subdue the fiends,\np:Long be thy grasping-hook wherewith thou givest ample wealth to him Who sheds the juice and worships thee.\np:Here, Indra, is thy Soma-draught, made pure upon the sacred grass: Run hither, come and drink thereof.\np:Famed for thy radiance, worshipped well this juice is shed for thy delight Thou art invoked, Akhandala!\np:To Kundapayya, grandson's son, grandson of Srngavrs! to thee, to him have I addressed my thought.\np:Strong pillar thou, Lord of the home armour of Soma-offerers: The drop of Soma breaketh all the strongholds down, and Indra is the &#7770;&#7779;is&#146; Friend.\np:Holy Prdikusanu, winner of the spoil, on eminent o&#146;er many men, Lead on the wild horse Indra with his vigorous grasp forward  juice.",
    "next": "08018",
    "previous": "08016",
    "book": "08"
  },
  "created": 1638556381175,
  "updated": 1638791591867
}