{
  "key": "08011",
  "title": "RigVeda Hymn 08011",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XI. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08011.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08010.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08012.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XI. Agni.</h3>  \n<p>1. THOU Agni, God mid mortal men, art guard of sacred rites, thou art<br> To be adored at sacrifice.<br> 2 O Mighty Agni, thou must be glorified at our festivals,<br> Bearing our offerings to the Gods.<br> 3 O J&#257;tavedas Agni, fight and drive our foes afar from us,<br> Themand their godless enmities.<br> 4 Thou, J&#257;tavedas, seekest not the worship of a hostile man,<br> However nigh itbe to thee.<br> 5 We sages, mortals as we are, adore the mighty name oof thee,<br> Immortal J&#257;tavedas' name.<br> 6 Sages, we call the Sage to help, mortals, we call the God to aid:<br> We call on Agni with our songs.<br> 7 May Vatsa draw- thy mind away even from thy loftiest dwelling-place,<br> Agni, with song that yearns for thee.<br> 8 Thou art the same in many a place: mid all the people thou art Lord.<br> In fray and fightt we call on thee.<br> 9 When we are seeking strength we call Agni to help us in the strife,<br> The giver of rich gifts in war.<br> 10 Ancient, adorablie at sacrifices, Priest from of old, meet for our praise, thou sittest.<br> Fill full and satisfy thy body, Agni, and win us happiness by offering worship.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08012.htm\">Next: HYMN XII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08011.html",
  "api": "json/hymns/08011.json",
  "data": {
    "title": "HYMN XI. Agni.",
    "describe": "THOU Agni, God mid mortal men, art guard of sacred rites, thou art To be adored at offerings.",
    "feecting": "p:THOU Agni, God mid mortal men, art guard of sacred rites, thou art To be adored at offerings.\np:O Mighty Agni, thou must be glorified at our festivals, bearing our offerings to the Devas.\np:O J&#257;tavedas Agni, fight and drive our foes afar from us, themand their godless enmities.\np:Thou, J&#257;tavedas, seekest not the worship of a hostile man, However nigh itbe to thee.\np:We sages, mortals as we are, adore the mighty name oof thee, Immortal J&#257;tavedas' name.\np:Sages, we call the Sage to help, mortals, we call the Deva to aid: We call on Agni with our songs.\np:May Vatsa draw- thy mind away even from thy loftiest dwelling-place, Agni, with song that yearns for thee.\np:Thou art the same in many a place: mid all the people thou art Lord.\np: In fray and fightt we call on thee.\r\np:When we are seeking strength we call Agni to help us in the strife, the giver of rich gifts in war.\np:Ancient, adorablie at offers, Monk from of old, meet for our praise, thou sittest. Fill full and satisfy thy body, Agni, and win us happiness by offering worship.",
    "next": "08012",
    "previous": "08010",
    "book": "08"
  },
  "created": 1638556349624,
  "updated": 1638790698248
}