{
  "key": "08019",
  "title": "RigVeda Hymn 08019",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XIX. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08019.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08018.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08020.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XIX. Agni.</h3>  \n<p>1. SING praise to hiin, the Lord of Light. The Gods have made the God to be their messenger,<br> And sent oblation to Gods.<br> 2 Agni, the Bounteous Giver, bright with varied flames, laud thou, O singer Sobhari-<br> Him who controls this sacred food with Soma blent, who hath first claim to sacrifice.<br> 3 Thee have we chosen skilftillest in sacrifice, Immortal Priest among the Gods,<br> Wise finisher of this holy rite:<br> 4 The Son of Strength, the blessed, brightly shining One, Agni whose light is excellent.<br> May be by sacrifice win us in heaven the grace of Mitra, Varu&#7751;a, and the Floods.<br> 5 The mortal who hath ministered to Agni with oblation, fuel, ritual lore,<br> And reverence, skilled in sacrifice.<br> 6 Verily swift to run are his fleet-footed steeds, and most resplendent fame is his.<br> No trouble caused by Gods or wrought by mortal man from any side o&#146;ertaketh him.<br> 7 May we by thine own fires be well supplied with fire, O Son of Strength, O Lord of Might:<br> Thou as our Friend hast worthy men.<br> 8 Agni, who praises like a guest of friendly mind, is as a car that brings us gear.<br> Also in thee is found perfect security thou art the Sovran Lord of wealth.<br> 9 That man, moreover, merits praise who brings, auspicious Agni, sacrificial gifts<br> May he win riches by his thoughts.<br> 10 He for whose sacrifice thou standest up erect is prosperous and rules o&#146;er men.<br> He wins with coursers and with singers killed in song: with heroes he obtains the prize.<br> 11 He in whose dwelling Agni is chief ornament, and, all-desired, loves his laud well,<br> And zealously tends his offerings-<br> 12 His, or the lauding sage's word, his, Son of Strength! who Is most prompt with sacred gifts,<br> Set thou beneath the Gods, Vasu, above mankind, the speech of the intelligent.<br> 13 He who with sacrificial gifts or homage bringeth very skilful Agni nigh,<br> Or him who flashes fast with song,<br> 14 The mortal who with blazing fuel, as his laws command, adores the Perfect God,<br> Blest with his thoughts in splendour shall exceed all men, as though he overpassed the floods.<br> 15 Give us the splendour, Agni, which may overcome each greedy fiend in our abode,<br> The wrath of evil-hearted folk.<br> 16 That, wherewith Mitra, Varu&#7751;a, and Aryaman, the A&#347;vins, Bhaga give us light,<br> That may we, by thy power finding best furtherance, worship, O Indra, helped by thee.<br> 17 O Agni, most devout are they, the sages who have set thee Sage exceeding wise,<br> O God, for men to look upon:<br> 18 Who have arranged thine altar Blessed God, at morn brought thine oblation, pressed the juice.<br> They by their deeds of strength have won diem, mighty wealth, who have set all their hope in thee.<br> 19 -May Agni worshipped bring us bliss, may the gift, Blessed One, and sacrifice bring bliss;<br> Yea, may our praises bring us bliss.<br> 20 Show forth the mind that brings success in war with fiends, wherewith thou conquerest in fight.<br> Bring down the many firm hopes of our enemies, and let us vanquish with thine aid.<br> 21 I praise with song the Friend of man, whom Gods sent down to be herald and messenger,<br> Best worshipper, bearer of our gifts.<br> 22 Thou unto sharp-toothed Agni, Young and Radiant God, proclaimest with thy song the feast-<br> Agni, who for our sweet strains moulds heroic strength when sacred oil is offered him,<br> 23 While, served with sacrificial oil, now upward and now downward Agni moves his sword,<br> As doth the Asura his robe.<br> 24 The God, the Friend of man, who bears our gifts to heaven, the God with his sweet-smelling mouth,<br> Distributes, skilled in sacrifice, his precious things, Invoking Priest, Immortal God.<br> 25 Son of Strength, Agni, if thou wert the mortal, bright as Mitra, I worshipped with our gifts!<br> And I were the Immortal God<br> 26 I would not give thee up, Vasu, to calumny, or misery, O Bounteous One.<br> My worshipper should feel no hunger or distress, nor, Agni, should he live in sin.<br> 27 Like a son cherished in his father's houi&sect;e, let our oblation rise unto the Gods.<br> 28 With thine immediate aid may I, excellent Agni, ever gain my wish<br> A mortal with a God to help.<br> 29 O Agni, by thy wisdom, by thy bounties, by thy leading may I gather wealth.<br> Excellent Agni, thou art called my Providence: delight thou to be liberal.<br> 30 Agni, he conquers by thine aid that brings him store of noble heroes and great strength,<br> Whose bond of friendship is thy choice.<br> 31 Thy spark is black and crackling, kindled in due time, O Bounteous, it is taken up.<br> Thou art the dear Friend of the mighty Mornings: thou shinest in glimmerings of the night.<br> 32 We Sobharis have come to him, for succour, who is good to help with thousand powers,<br> The Sovran, Trasadasyu's Friend.<br> 33 O Agni, thou on whom all other fires depend, as branches on the parent stem,<br> I make the treasures of the folk, like songs, mine own, while I exalt thy sovran might.<br> 34 The mortal whom, &#256;dityas, ye, Guilelew, lead to the farther bank<br> Of all the princes, Bounteous Ones<br> 35 Whoe&#146;er he be, Man-ruling Kings! the Regent of the race of men-<br> May we, O Mitra, Varu&#7751;a, and Aryaman, like him be furtherers of your law.<br> 36 A gift of fifty female slaves hath Trasadasyu given me, Purukutsa's son,<br> Most liberal, kind, lord of the brave.<br> 37 And &#346;y&#257;va too for me led forth a strong steed at Suvastu's ford:<br> A herd of three times seventy kine, good lord of gifts, he gave to me.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08020.htm\">Next: HYMN XX Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08019.html",
  "api": "json/hymns/08019.json",
  "data": {
    "title": "HYMN XIX. Agni.",
    "describe": "SING praise to hiin, the Lord of Light.",
    "feecting": "p:SING praise to hiin, the Lord of Light. The Devas have made the Deva to be their messenger, and sent oblation to Devas.\np:Agni, the Bounteous Giver, bright with varied flames, laud thou, O singer Sobhari- Him who controls this sacred food with Soma blent, who hath first claim to offering.\np:Thee have we chosen skilftillest in offering, Immortal Monk among the Devas, Wise finisher of this holy rite:\np:The Son of Strength, the blessed, brightly shining One, Agni whose light is excellent.\np: May be by offering win us in Heaven the grace of Mitra, Varu&#7751;a, and the Floods.\r\np:The mortal who hath ministered to Agni with oblation, fuel, ritual lore, and reverence, skilled in offering.\np:Verily swift to run are his fleet-footed steeds, and most resplendent fame is his. No trouble caused by Devas or wrought by mortal man from any side o&#146;ertaketh him.\np:May we by thine own fires be well supplied with fire, O Son of Strength, O Lord of Might: Thou as our Friend hast worthy men.\np:Agni, who praises like a guest of friendly mind, is as a car that brings us gear. Also in thee is found perfect security thou art the Sovran Lord of wealth.\np:That man, moreover, merits praise who brings, auspicious Agni, sacrificial gifts May he win riches by his thoughts.\np:He for whose offering thou standest up erect is prosperous and rules o&#146;er men. He wins with coursers and with singers killed in song: with heroes he obtains the prize.\np:He in whose dwelling Agni is chief ornament, and, all-desired, loves his laud well, and zealously tends his offerings-\np:His, or the lauding sage's word, his, Son of Strength! who Is most prompt with sacred gifts, Set thou beneath the Devas, Vasu, above mankind, the speech of the intelligent.\np:He who with sacrificial gifts or homage bringeth very skilful Agni nigh, or him who flashes fast with song,\np:The mortal who with blazing fuel, as his laws command, adores the Perfect Deva, Blest with his thoughts in splendour shall exceed all men, as though he overpassed the floods.\np:Give us the splendour, Agni, whic. May overcome each greedy fiend in our abode, the wrath of evil-hearted folk.\np:That, wherewith Mitra, Varu&#7751;a, and Aryaman, the A&#347;vins, Bhaga give us light, tha. May we, by thy power finding best furtherance, worship, O Indra, helped by thee.\np:O Agni, most devout are they, the sages who have set thee Sage exceeding wise, for men to look upon:\np:Who have arranged thine altar Blessed Deva, at morn brought thine oblation, pressed the juice. They by their deeds of strength have won diem, mighty wealth, who have set all their hope in thee.\np:-May Agni worshipped bring us bliss. May the gift, Blessed One, and offering bring bliss; Yea. May our praises bring us bliss.\np:Show forth the mind that brings success in war with fiends, wherewith thou conquerest in fight. Bring down the many firm hopes of our enemies, and let us vanquish with thine aid.\np:I praise with song the Friend of man, whom Devas sent down to be herald and messenger, best worshipper, bearer of our gifts.\np:Thou unto sharp-toothed Agni, Young and Radiant Deva, proclaimest with thy song the feast- Agni, who for our sweet strains moulds heroic strength when sacred oil is offered him,\np:While, served with sacrificial oil, now upward and now downward Agni moves his sword, as doth the Devas his robe.\np:The Deva, the Friend of man, who bears our gifts to Heaven with his sweet-smelling mouth, Distributes, skilled in offering, his precious things, invoking Monk, Immortal God.\np:Son of Strength, Agni, if thou wert the mortal, bright as Mitra, I worshipped with our gifts! And I were the Immortal God\np:I would not give thee up, Vasu, to calumny, or misery, O Bounteous One. My worshipper should feel no hunger or distress, nor, Agni, should he live in sin.\np:Like a son cherished in his father's houi&sect;e, let our oblation rise unto the Devas.\np:With thine immediate ai. May I, excellent Agni, ever gain my wish A mortal with a God to help.\np:O Agni, by thy wisdom, by thy bounties, by thy leadin. May I gather wealth. Excellent Agni, thou art called my Providence: delight thou to be liberal.\np:Agni, he conquers by thine aid that brings him store of noble heroes and great strength, whose bond of friendship is thy choice.\np:Thy spark is black and crackling, kindled in due time, O Bounteous, it is taken up. Thou art the dear Friend of the mighty Mornings: thou shinest in glimmerings of the night.\np:We Sobharis have come to him, for succour, who is good to help with thousand powers, the Sovran, Trasadasyu's Friend.\np:O Agni, thou on whom all other fires depend, as branches on the parent stem, I make the treasures of the folk, like songs, mine own, while I exalt thy sovran might.\np:The mortal whom, &#256;dityas, ye, Guilelew, lead to the farther bank Of all the princes, Bounteous Ones\np:Whoe&#146;er he be, Man-ruling Kings! the Regent of the race of men- May we, O Mitra, Varu&#7751;a, and Aryaman, like him be furtherers of your law.\np:A gift of fifty female slaves hath Trasadasyu given me, Purukutsa's son, most liberal, kind, lord of the brave.\np:And &#346;y&#257;va too for me led forth a strong steed at Suvastu's ford: A herd of three times seventy kine, good lord of gifts, he gave to me.",
    "next": "08020",
    "previous": "08018",
    "book": "08"
  },
  "created": 1638556391682,
  "updated": 1638791780901
}