{
  "key": "08014",
  "title": "RigVeda Hymn 08014",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XIV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08014.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08013.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08015.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XIV. Indra.</h3>  \n<p>1. IF I, O Indra, were, like thee, the single Sovran of all wealth,<br> My worshipper should be rich in kine.<br> 2 I should be fain, O Lord of Power, to strengthen and enrich the sage,<br> Were I the Lord of herds of kine.<br> 3 To worshippers who press the juice thy goodness, Indra, is a cow<br> Yielding in plenty kine and steeds.<br> 4 None is there, Indra, God or man, to hinder thy munificence,<br> The wealth which, lauded, thou wilt give.<br> 5 The sacrifice made Indra strong when he unrolled the earth, and made<br> Himself a diadem in heaven.<br> 6 Thine aid we claim, O Indra, thine who after thou hast waxen great<br> Hast won all treasures for thine own.<br> 7 In Soma's ecstasy Indra spread the firmament and realms of light,<br> When he cleft Vala limb from limb.<br> 8 Showing the hidden he drave forth the cows for the A&#7749;girases,<br> And Vala he cast headlong down.<br> 9 By Indra were the lumirious realms of heaven established and secured,<br> Firm and immovable from their place.<br> 10 Indra, thy laud moves quickly like a joyous wave of water-floods:<br> Bright shine the drops that gladden thee.<br> 11 For thou, O Indra, art the God whom hymns and praises magnify:<br> Thou blessest those who worship thee.<br> 12 Let the two long-maned Bay Steeds bring Indra to drink the Soma juice,<br> The Bountiful to our sacrifice.<br> 13 With waters' foam thou torest off, Indra, the head of Namuci,<br> Subduing all contending hosts.<br> 14 The Dasyus, when they fain would climb<br> by magic arts and mount to heaven,<br> Thou, Indra, castest down to earth.<br> 15 As Soma-drinker conquering all, thou scatteredst to every side<br> Their settlement who poured no gifts.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08015.htm\">Next: HYMN XV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08014.html",
  "api": "json/hymns/08014.json",
  "data": {
    "title": "HYMN XIV. Indra.",
    "describe": "IF I, O Indra, were, like thee, the single Sovran of all wealth, My worshipper should be rich in kine.",
    "feecting": "p:IF I, O Indra, were, like thee, the single Sovran of all wealth, My worshipper should be rich in kine.\np:I should be fain, O Lord of Power, to strengthen and enrich the sage, Were I the Lord of herds of kine.\np:To worshippers who press the juice thy goodness, Indra, is a cow Yielding in plenty kine and steeds.\np:None is there, Indra, God or man, to hinder thy munificence, the wealth which, lauded, thou wilt give.\np:The offering made Indra strong when he unrolled the Earth, and made Himself a diadem in Heaven.\np:Thine aid we claim, O Indra, thine who after thou hast waxen great Hast won all treasures for thine own.\np:In Soma's ecstasy Indra spread the Firmament and realms of light, when he cleft Vala limb from limb.\np:Showing the hidden he drave forth the cows for the A&#7749;girases, and Vala he cast headlong down.\np:By Indra were the lumirious realms of Heaven established and secured, Firm and immovable from their place.\np:Indra, thy laud moves quickly like a joyous wave of water-floods: Bright shine the drops that gladden thee.\np:For thou, O Indra, art the Deva whom hymns and praises magnify: Thou blessest those who worship thee.\np:Let the two long-maned Bay Steeds bring Indra  juice, the Bountiful to our offering.\np:With waters' foam thou torest off, Indra, the head of Namuci, Subduing all contending hosts.\np:The Dasyus, when they fain would climb by magic arts and mount to Heaven, Thou, Indra, castest down to Earth.\np:As Soma-drinker conquering all, thou scatteredst to every side Their settlement who poured no gifts.",
    "next": "08015",
    "previous": "08013",
    "book": "08"
  },
  "created": 1638556365401,
  "updated": 1638642698767
}