{
  "key": "08025",
  "title": "RigVeda Hymn 08025",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XXV. Mitra-Varu&#7751;a.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08025.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08024.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08026.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXV. Mitra-Varu&#7751;a.</h3>  \n<p>1. I WORSHIP you who guard this All, Gods, holiest among the Gods,<br> You, faithful to the Law, whose power is sanctified.<br> 2 So, too, like charioteers are they, Mitra and sapient Varu&#7751;a,<br> Sons high-born from of old, whose holy laws stand fast.<br> 3 These Twain, possessors of all wealth, most glorious, for supremest sway<br> Aditi, Mighty Mother, true to Law, brought forth.<br> 4 Great Varu&#7751;a and Mitra, Gods, Asuras and imperial Lords,<br> True to Eternal Law proclaim the high decree.<br> 5 The offspring of a lofty Power, Dak&#7779;a's Two Sons exceeding strong,<br> Who, Lords of flowing rain, dwell in the place of food.<br> 6 Ye who have gathered up your gifts, celestial and terrestrial food,<br> Let your rain come to us fraught with the mist of heaven.<br> 7 The Twain, who from the lofty sky seem to look down on herds below,<br> Holy, imperial Lords, are set to be revered.<br> 8 They, true to Law, exceeding strong, have sat them down for savran rule:<br> Princes whose laws stand fast, they have obtained their sway.<br> 9 Pathfinders even better than the eye, with unobstructed sight,<br> Even when they close their lids, observant, they perceive.<br> 10 So may the Goddess Aditi, may the N&#257;satyas guard us well,<br> The Martits guard us well,.endowed with mighty strength.<br> 11 Do ye, O Bounteous Gods, protect our dwelling lace by day and night:<br> With you for our defenders may we go unharmed.<br> 12 May we, unharmed, serve bountiful Vi&#7779;&#7751;u, the God who slayeth none:<br> Self-moving Sindhu hear and be the first to mark.<br> 13 This sure protection we elect, desirable and reaching far,<br> Which Mitra, Varu&#7751;a, and Aryaman afford.<br> 14 And may the Sindhu of the floods, the Maruts, and the ASvin Pair,<br> Boon Indra, and boon Vi&#7779;&#7751;u have one mind with us.<br> 15 Because these warring Heroes stay the enmity of every foe,<br> As the fierce water-flood repels the furious ones.<br> 16 Here this one God, the Lord of men, looks forth exceeding far and wide:<br> And we, for your advantage, keep his holy laws.<br> 17 We keep the old accustomed laws, the statutes of supremacy,<br> The Iong-known laws of Mitra and of Varu&#7751;a.<br> 18 He who hath measured with his ray the boundaries of heaven and earth,<br> And with his majesty hath filled the two worlds full,<br> 19 S&#363;rya hath spread his light aloft up to the region of the sky,<br> Like Agni all aflame when gifts are offered him.<br> 20 With him who sits afar the word is lord of food that comes from kine,<br> Controller of the gift of unempoisoned food.<br> 21 So unto S&#363;rya, Heaven, and Earth at morning and at eve I speak.<br> Bringing enjoyments ever rise thou up for us.<br> 22 From Uksanyayana a bay, from Harayana a white steed,<br> And from Susaman we obtained a hamessed car.<br> 23 These two shall bring me further gain of troops of tawny-coloured steeds,<br> The carriers shall they be of active men of war.<br> 24 And the two sages have I gained who hold the reins and bear the whip,<br> And the two great strong coursers, with my newest song.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08026.htm\">Next: HYMN XXVI. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08025.html",
  "api": "json/hymns/08025.json",
  "data": {
    "key": "08025",
    "title": "HYMN XXV. Mitra-Indra.",
    "describe": "I WORSHIP you who guard this All, Devas, holiest among the Devas, You, faithful to the Law, whose power is sanctified.",
    "feecting": "p:I WORSHIP you who guard this All, Devas, holiest among the Devas, You, faithful to the Law, whose power is sanctified.\np:So, too, like charioteers are they, Mitra and sapient Indra, Sons high-born from of old, whose holy laws stand fast.\np:These Twain, possessors of all wealth, most glorious, for supremest sway Aditi, Mighty Mother, true to Law, brought forth.\np:Great Indra and Mitra, Devas, Devass and imperial Lords, True to Eternal Law proclaim the high decree.\np:The offspring of a lofty Power, Dakṣa's Two Son exceeding strong, who, Lords of flowing rain, dwell in the place of food.\np:Ye who have gathered up your gifts, celestial and terrestrial food, Let your rain come to us fraught with the mist of Heaven.\np:The Twain, who from the lofty sky seem to look down on herds below, Holy, imperial Lords, are set to be revered.\np:They, true to Law, exceeding strong, have sat them down for savran rule: Princes whose laws stand fast, they have obtained their sway.\np:Pathfinders even better than the eye, with unobstructed sight, Even when they close their lids, observant, they perceive.\np:May the Goddess Aditi. May the Nāsatyas guard us well, the Martits guard us well.endowed with mighty strength.\np:Do ye, O Bounteous Devas, protect our dwelling lace by day and night: With you for our defender. May we go unharmed.\np:May we, unharmed, serve bountiful Indra who slayeth none: Self-moving Sindhu hear and be the first to mark.\np:This sure protection we elect, desirable and reaching far, Which Mitra, Indra, and Aryaman afford.\np:An. May the Sindhu of the floods, the Devas, and the ASvin Pair, Boon Indra, and boon Indra have one mind with us.\np:Because these warring Heroes stay the enmity of every foe, as the fierce water-flood repels the furious ones.\np:Here this one Deva, the Lord of men, looks forth exceeding far and wide: And we, for your advantage, keep his holy laws.\np:We keep the old accustomed laws, the statutes of supremacy, the Iong-known laws of Mitra and of Indra.\np:He who hath measured with his ray the boundaries of Heaven and Earth, and with his majesty hath filled the two worlds full,\np:Sūrya hath spread his light aloft up to the region of the sky, like Agni all aflame when gifts are offered him.\np:With him who sits afar the word is lord of food that comes from kine, Controller of the gift of unempoisoned food.\np:So unto Sūrya. Heaven, and Earth at morning and at eve I speak.\np: Bringing enjoyments ever rise thou up for us.\r\np:From Uksanyayana a bay, from Harayana a white steed, and from Susaman we obtained a hamessed car.\np:These two shall bring me further gain of troops of tawny-coloured steeds, the carriers shall they be of active men of war.\np:And the two sages have I gained who hold the reins and bear the whip, and the two great strong coursers, with my newest song.",
    "meta": {
      "next": "08026",
      "previous": "08024",
      "book": "08",
      "original": "https://sacred-texts.com/hin/rigveda/rv08025.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv08025.htm"
    },
    "deities": [
      {
        "name": "O Bounteous",
        "hymns": [
          {
            "key": "08025",
            "title": "HYMN XXV. Mitra-Indra."
          }
        ]
      }
    ]
  },
  "created": 1638556423293,
  "updated": 1667442753379
}