{
  "key": "08027",
  "title": "RigVeda Hymn 08027",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XXVII. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08027.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08026.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08028.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXVII. Vi&#347;vedevas.</h3>  \n<p>1. CHEIF Priest is Agni at the laud, as stones and grass at sacrifice:<br> With song I seek the Maruts, Brahma&#7751;aspati, Gods for help much to be desired.<br> 2 I sing to cattle and to Earth, to trees, to Dawns, to Night, to plants.<br> O all ye Vasus, ye possessors of all wealth, be ye the furtherers of our thoughts.<br> 3 Forth go, with Agni, to the Gods our sacrifice of ancient use,<br> To the &#256;dityas, Varu&#7751;a whose Law stands fast, and the all-lightening Marut troop.<br> 4 Lords of all wealth, may they be strengtheners of man, destroyers of his enemies.<br> Lords of all wealth, do ye, with guards which none may harm, preserve our dwelling free from foes.<br> 5 Come to us with one mind to-day, come to us all with one accord,<br> Maruts with holy song, and, Goddess Aditi, Mighty One, to our house and home.<br> 6 Send us delightful things, ye Maruts, on your steeds: come ye, O Mitra, to our gifts.<br> Let Indra, Varu&#7751;a, and the &#256;dityas sit, swift Heroes, on our sacred grass.<br> 7 We who have trimmed the grass for you, and set the banquet in array,<br> And pressed the Soma, call you, Varuina, like men, with sacrificial fires aflame.<br> 8 O Maruts, Visinu, A&#347;vins, P&#363;&#7779;an, haste away with minds turned hitherward to Me.<br> Let the Strong Indra, famed as V&#7771;tra's slayer, come first with the winners of the spoil.<br> 9 Ye Guileless Gods, bestow on us a refuge strong on every side,<br> A sure protection, Vasus, unassailable from near at hand or from afar.<br> 10 Kinship have I with you, and close alliance O ye Gods, destroyers of our foes.<br> Call us to our prosperity of former days, and soon to new klicity.<br> 11 For now have I sent forth to you, that I may win a fair reward,<br> Lords of all wealth, with homage, this my song of praise. like a milch-cow that faileth not.<br> 12 Excellent Savitar hath mounted up on high for you, ye sure and careful Guides.<br> Bipeds and quadrupeds, with several hopes and aims, and birds have settled to their tasks.<br> 13 Singing their praise with God-like thought let us invoke each God for grace,<br> Each God to bring you help, each God to strengthen you.<br> 14 For of one spirit are the Gods with mortal man, co-sharers all of gracious gifts.<br> May they increase our strength hereafter and to-day, providing case and ample room.<br> 15 I laud you, O ye Guileless Gods, here where we meet to render praise.<br> None, Varu&#7751;a and Mitra, harins the mortal, man who honours and obeys your laws.<br> 16 He makes his house endure, he gathers plenteous food who pays obedience to your will.<br> Born in his sons anew he spreads as Law commands, and prospers every way unharmed.<br> 17 E&#146;en without war he gathers wealth, and goes hisway on pleasant paths,<br> Whom Mitra, Varu&#7751;a and Aryaman protect, sharing the gift,of one accord.<br> 18 E&#146;en on the plain for him ye make a sloping path, an easy way where road is none:<br> And far away from him the ineffectual shaft must vanish, shot at him in vain.<br> 19 If ye appoint the rite to-day, kind Rulers, when the Sun ascends,<br> Lords of all wealth, at sunset or at wakingtime, or be it at the noon of day,<br> 20 Or, Asuras, when ye have sheltered the worshipper who goes to sacrifice, at eve<br> may we, O Vasus, ye possessors of all wealth, come then into the midst of You.<br> 21 If ye to-day at sunrise, or at noon, or in the gloom of eve,<br> Lords of all riches, give fair treasure to the man, the wise man who hath sacrificed,<br> 22 Then we, imperial Rulers, claim of you this boon, your wide protection, as a son.<br> May we, &#256;dityas, offering holy gifts, obtain that which shall bring us greater bliss.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08028.htm\">Next: HYMN XXVIII. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08027.html",
  "api": "json/hymns/08027.json",
  "data": {
    "title": "HYMN XXVII. Vi&#347;vedevas.",
    "describe": "CHEIF Monk is Agni at the laud, as stones and grass at offering: With song I seek the Devas, Brahma&#7751;",
    "feecting": "p:CHEIF Monk is Agni at the laud, as stones and grass at offering: With song I seek the Devas, Brahma&#7751;aspati, Devas for help much to be desired.\np:I sing to cattle and to Earth, to trees, to Dawns, to Night, to plants.\np: O all ye Devas, ye possessors of all wealth, be ye the furtherers of our thoughts.\r\np:Forth go, with Agni, to the Devas our offering of ancient use, to the &#256;dityas, Varu&#7751;a whose Law stands fast, and the all-lightening Marut troop.\np:Lords of all wealth. May they be strengtheners of man, destroyers of his enemies. Lords of all wealth, do ye, with guards which non. May harm, preserve our dwelling free from foes.\np:Come to us with one mind to-day, come to us all with one accord, Devas with holy song, and, Goddess Aditi, Mighty One, to our house and home.\np:Send us delightful things, ye Devas, on your steeds: come ye, O Mitra, to our gifts. Let Indra, Varu&#7751;a, and the &#256;dityas sit, swift Heroes, on our sacred grass.\np:We who have trimmed the grass for you, and set the banquet in array, and pressed the Soma, call you, Varuina, like men, with sacrificial fires aflame.\np:O Devas, Visinu, A&#347;vins, P&#363;&#7779;an, haste away with minds turned hitherward to Me. Let the Strong Indra, famed as V&#7771;tra's slayer, come first with the winners of the spoil.\np:Ye Guileless Devas, bestow on us a refuge strong on every side, a sure protection, Devas, unassailable from near at hand or from afar.\np:Kinship have I with you, and close alliance O ye Devas, destroyers of our foes. Call us to our prosperity of former days, and soon to new klicity.\np:For now have I sent forth to you, that . May win a fair reward, Lords of all wealth, with homage, this my song of praise. like a milch-cow that faileth not.\np:Excellent Indra hath mounted up on high for you, ye sure and careful Guides. Bipeds and quadrupeds, with several hopes and aims, and birds have settled to their tasks.\np:Singing their praise with God-like thought let us invoke each God for grace, Each God to bring you help, each God to strengthen you.\np:For of one spirit are the Devas with mortal man, co-sharers all of gracious gifts. May they increase our strength hereafter and to-day, providing case and ample room.\np:I laud you, O ye Guileless Devas, here where we meet to render praise. None, Varu&#7751;a and Mitra, harins the mortal, man who honours and obeys your laws.\np:He makes his house endure, he gathers plenteous food who pays obedience to your will. Born in his sons anew he spreads as Law commands, and prospers every way unharmed.\np:E&#146;en without war he gathers wealth, and goes hisway on pleasant paths, whom Mitra, Varu&#7751;a and Aryaman protect, sharing the gift,of one accord.\np:E&#146;en on the plain for him ye make a sloping path, an easy way where road is none: And far away from him the ineffectual shaft must vanish, shot at him in vain.\np:If ye appoint the rite to-day, kind Rulers, when the Sun ascends, Lords of all wealth, at sunset or at wakingtime, or be it at the noon of day,\np:Or, Devass, when ye have sheltered the worshipper who goes to offering, at ev. May we, O Devas, ye possessors of all wealth, come then into the midst of You.\np:If ye to-day at sunrise, or at noon, or in the gloom of eve, Lords of all riches, give fair treasure to the man, the wise man who hath offered,\np:Then we, imperial Rulers, claim of you this boon, your wide protection, as a son. May we, &#256;dityas, offering holy gifts, obtain that which shall bring us greater bliss.",
    "next": "08028",
    "previous": "08026",
    "book": "08"
  },
  "created": 1638556433800,
  "updated": 1638647072809
}