{
  "key": "08032",
  "title": "RigVeda Hymn 08032",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XXXII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08032.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08031.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08033.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXII. Indra.</h3>  \n<p>1. KANVAS, tell forth with song the deeds of Indra, the Impetuous,<br> Wrought in the Soma's wild delight.<br> 2 Strong God, he slew Anarsani, Srbinda, Pipru, and the fiend,<br> Ah&#299;&#347;uva, and loosed the floods.<br> 3. Thou broughtest down the dwelling-place, the height of lofty Arbuda.<br> That exploit, Indra, must be famed.<br> 4 Bold, to your famous Soma I call the fair-visored God for aid,<br> Down like a torrent from the hill.<br> 5 Rejoicing in the Soma-draughts, Hero, burst open, like a fort,<br> The stall of horses and of kine.<br> 6 If my libation gladdens, if thou takest pleasure in my laud,<br> Come with thy Godhead from afar.<br> 7 O Indra, Lover of the Song, the singers of thy praise are we:<br> O Soma-drinker, quicken us.<br> 8 And, taking thy delight with us bring us still undiminished food:<br> Great is thy wealth, O Maghavan.<br> 9 Make thou us rich in herds of kine, in steeds, in gold: let us exert<br> Our strength in sacrificial gifts.<br> 10 Let us call him to aid whose hands stretch far, to whom high laud is due.<br> Who worketh well to succour us.<br> 11 He, &#346;atakratu, even in fight acts as a V&#7771;tra-slayer s,till:<br> He gives his worshippers much wealth.<br> 12 May he, this A;akra, strengthen us, Boon God who satisfies our needs,<br> Indra, with all lhis saving helps.<br> 13 To him, the mighty stream of wealth, the Soma-presser's rescuing Friend,<br> To Indra sing your song of praise;<br> 14 Who bringeth what is great and firm, who winneth glory in his wars,<br> Lord of vast wealth through power and might.<br> 15 There liveth none to cheek or stay his energies and gracious deeds:<br> None who can say, He giveth not.<br> 16 No debt is due by Brahmans now, by active men who press the juice:<br> Well hath each Soma-draught been paid.<br> 17 Sing ye to him who must be praised, say lauds to him who must be praised,<br> Bring prayer to him who must be praised.<br> 18 May be, unchecked, strong, meet for praise, bring hundreds, thousands forth to light,<br> Indra who aids the worshipper.<br> 19 Go with thy God-like nature forth, go where the folk are calling thee:<br> Drink, Indra, of the drops we pour.<br> 20 Drink milky draughts which are thine own, this too which was with Tugrya once,<br> This is it, Indra, that is thine.<br> 21 Pass him who psours libations out in angry mood or after sin:<br> Here drink the juice we offer thee.<br> 22 Over the three great distances, past the Five Peoples go thy way,<br> O Indra, noticing our voice.<br> 23 Send forth thy ray like S&#363;rya: let my songs attract thee hitherward,<br> Like waters gathering to the vale.<br> 24 Now to the Hero fair of cheek, Adhvaryu, pour the Soma forth:<br> Bring of the juice that he may drink<br> 25 Who cleft the water-cloud in twain, loosed rivers for their downward flow,<br> And set the ripe milk in the kine.<br> 26 He, meet for praise, slew V&#7771;tra, slew Ah&#299;&#347;uva, Urnavabha's son,<br> And pierced th:rough Arbuda with frost.<br> 27 To him your matchless Mighty One, unconquerable Conqueror,<br> Sing forth the prayer which Gods have given:<br> 28 Indra, who in the wild delight of Soma juice considers here<br> All holy Laws among the Gods.<br> 29 Hither let these thy Bays who share thy banquet, Steeds with golden manes,<br> Convey thee to the feast prepared.<br> 30 Hither, O thou whom many laud, the Bays whom Priyamedha praised,<br> Shall bring thee to the Soma-draught.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08033.htm\">Next: HYMN XXXIII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08032.html",
  "api": "json/hymns/08032.json",
  "data": {
    "title": "HYMN XXXII. Indra.",
    "describe": "KANVAS, tell forth with song the deeds of Indra, the Impetuous, Wrought in the Soma's wild delight.",
    "feecting": "p:KANVAS, tell forth with song the deeds of Indra, the Impetuous, Wrought in the Soma's wild delight.\np:Strong Deva, he slew Anarsani, Srbinda, Pipru, and the fiend, Ah&#299;&#347;uva, and loosed the floods.\np:Thou broughtest down the dwelling-place, the height of lofty Arbuda.\np: That exploit, Indra, must be famed.\r\np:Bold, to your famous Soma I call the fair-visored God for aid, Down like a torrent from the hill.\np:Rejoicing in the Soma-draughts. Hero, burst open, like a fort, the stall of horses and of kine.\np:If my libation gladdens, if thou takest pleasure in my laud, Come with thy Godhead from afar.\np:O Indra, Lover of the Song, the singers of thy praise are we: O Soma-drinker, quicken us.\np:And, taking thy delight with us bring us still undiminished food: Great is thy wealth, O Indra.\np:Make thou us rich in herds of kine, in steeds, in gold: let us exert Our strength in sacrificial gifts.\np:Let us call him to aid whose hands stretch far, to whom high laud is due. Who worketh well to succour us.\np:He, &#346;atakratu, even in fight acts as a V&#7771;tra-slayer s,till: He gives his worshippers much wealth.\np:May he, this A;akra, strengthen us, Boon Deva who satisfies our needs, Indra, with all lhis saving helps.\np:To him, the mighty stream of wealth, we's rescuing Friend, to Indra sing your song of praise;\np:Who bringeth what is great and firm, who winneth glory in his wars, Lord of vast wealth through power and might.\np:There liveth none to cheek or stay his energies and gracious deeds: None who can say. He giveth not.\np:No debt is due by Brahmans now, by active men who press the juice: Well hath each Soma-draught been paid.\np:Sing ye to him who must be praised, say lauds to him who must be praised, Bring prayer to him who must be praised.\np:May be, unchecked, strong, meet for praise, bring hundreds, thousands forth to light, Indra who aids the worshipper.\np:Go with thy God-like nature forth, go where the folk are calling thee: Drink, Indra, of the drops we pour.\np:Drink milky draughts which are thine own, this too which was with Tugrya once, This is it, Indra, that is thine.\np:Pass him who psours libations out in angry mood or after sin: Here drink the juice we offer thee.\np:Over the three great distances, past the Five Peoples go thy way, O Indra, noticing our voice.\np:Send forth thy ray like S&#363;rya: let my songs attract thee hitherward, like waters gathering to the vale.\np:Now to the Hero fair of cheek, Adhvaryu, pour the Soma forth: Bring of the juice that h. May drink\np:Who cleft the water-cloud in twain, loosed rivers for their downward flow, and set the ripe milk in the kine.\np:He, meet for praise, slew V&#7771;tra, slew Ah&#299;&#347;uva, Urnavabha's son, and pierced th:rough Arbuda with frost.\np:To him your matchless Mighty One, unconquerable Conqueror, Sing forth the prayer which Devas have given:\np:Indra, who in the wild delight of Soma juice considers here All holy Laws among the Devas.\np:Hither let these thy Bays who share thy banquet, Steeds with golden manes, Convey thee to the feast prepared.\np:Hither, O thou whom many laud, the Bays whom Priyamedha praised, Shall bring thee to the Soma-draught.",
    "next": "08033",
    "previous": "08031",
    "book": "08"
  },
  "created": 1638556460094,
  "updated": 1638647790658
}