{
  "key": "08039",
  "title": "RigVeda Hymn 08039",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XXXIX. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08039.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08038.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08040.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXIX. Agni.</h3>  \n<p>1. THE glorious Agni have I praised, and worshipped with. the sacred food.<br> May Agni deck the Gods for us. Between both gathering-places he goes on his embassy, the Sage. May all the others die away.<br> 2 Agni, burn down the word within their bodies through our newest speech,<br> All hatreds of the godless, all the wicked man's malignities. Away let the destroyers go. May all the others die away.<br> 3 Agni, I offer hymns to thee, like holy oil within thy mouth.<br> Acknowledge them. among the Gods, for thou art the most excellent, the worshipper's blissful messenger. Let all the others die away.<br> 4 Agni bestows all vital power even as each man supplicates.<br> He brings the Vasus strengthening gifts, and grants delight, in rest and stir, for every calling on the Gods. Let all the others die away.<br> 5 Agni hath made himself renowned by wonderful victorious act.<br> He is the Priest of all the tribes, chosen with sacrificial meeds. He urges Deities to receive. Let all the others die away.<br> 6 Agni knows all that springs from Gods, he knows the mystery of men.<br> Giver of wealth is Agni, he uncloses both the doors to us when worshipped with our newest gift. Let all the others die away.<br> 7 Agni inhabiteth with Gods and men who offer sacrifice.<br> He cherisheth with great delight much wisdom, as all things that be, God among Gods adorable. May all the others die away.<br> 8 Agni who liveth in all streams, Lord of the Sevenfold Race of men,<br> Him dweller in three homes we seek, best slayer of the Dasyus for Mandh&#257;tar, first in sacrifice. Let all the others die away.<br> 9 Agni the Wise inhabiteth three gathering-places, triply formed.<br> Decked as our envoy let the Sage bring hither and conciliate the Thrice Eleven Deities. Let all the others die away.<br> 10 Our Agni, thou art first among the Gods, and first mid living men.<br> Thou only rulest over wealth. Round about thee, as natural dams, circumfluous the waters run. Let all the others die away.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08040.htm\">Next: HYMN XL. Indra-Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08039.html",
  "api": "json/hymns/08039.json",
  "data": {
    "title": "HYMN XXXIX. Agni.",
    "describe": "THE glorious Agni have I praised, and worshipped with.",
    "feecting": "p:THE glorious Agni have I praised, and worshipped with. the sacred food.\np: May Agni deck the Devas for us. Between both gathering-places he goes on his embassy, the Sage. May all the others die away.\r\np:Agni, burn down the word within their bodies through our newest speech, All hatreds of the godless, all the wicked man's malignities. Away let the destroyers go. May all the others die away.\np:Agni, I offer hymns to thee, like holy oil within thy mouth. Acknowledge them. among the Devas, for thou art the most excellent, the worshipper's blissful messenger. Let all the others die away.\np:Agni bestows all vital power even as each man supplicates. He brings the Devas strengthening gifts, and grants delight, in rest and stir, forevery calling on the Devas. Let all the others die away.\np:Agni hath made himself renowned by wonderful victorious act. He is the Monk of all the tribes, chosen with sacrificial meeds. He urges Deities to receive. Let all the others die away.\np:Agni knows all that springs from Devas, he knows the mystery of men. Giver of wealth is Agni, he uncloses both the doors to us when worshipped with our newest gift. Let all the others die away.\np:Agni inhabiteth with Devas and men who offer offering. He cherisheth with great delight much wisdom, as all things that be, God among Devas adorable. May all the others die away.\np:Agni who liveth in all streams, Lord of the Sevenfold Race of men, him dweller in three homes we seek, best slayer of the Dasyus for Mandh&#257;tar, first in offering. Let all the others die away.\np:Agni the Wise inhabiteth three gathering-places, triply formed. Decked as our envoy let the Sage bring hither and conciliate the Thrice Eleven Deities. Let all the others die away.\np:Our Agni, thou art first among the Devas, and first mid living men. Thou only rulest over wealth. Round about thee, as natural dams, circumfluous the waters run. Let all the others die away.",
    "next": "08040",
    "previous": "08038",
    "book": "08"
  },
  "created": 1638556496882,
  "updated": 1638647790670
}