{
  "key": "08043",
  "title": "RigVeda Hymn 08043",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XLIII. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08043.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08042.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08044.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XLIII. Agni.</h3>  \n<p>1. THESE songs of mine go forth as lauds of Agni, the disposing Sage,<br> Whose worshipper is ne&#146;er o&#146;erthrown.<br> 2 Wise Agni J&#257;tavedas, I beget a song of praise for thee.<br> Who willingly receivest it.<br> 3 Thy sharpened flames, O Agni, like the gleams of light that glitter through,<br> Devour the forests with their teeth.<br> 4 Gold-coloured, bannered with the smoke, urged by the wind, aloft to heaven<br> Rise, lightly borne, the flames of fire.<br> 5 These lightly kindled fiery flames are all around made visible,<br> Even as the gleanings of the Dawns.<br> 6 As J&#257;tavedas speeds along, the dust is black beneath his feet,<br> When Agni spreads upon the earth.<br> 7 Making the plants his nourishment, Agni devours and wearies not,<br> Seeking the tender shrubs again.<br> 8 Bending him down with all his tongues, he flickers with his fiery glow<br> Splendid is Agni in the woods.<br> 9 Agni, thine home is in the floods: into the plants thou forcest way,<br> And as their Child art born anew.<br> 10 Worshipped with offerings shines thy flame, O Agni, from the sacred oil,<br> With kisses on the ladle's mouth.<br> 11 Let us serve Agni with our hymns, Disposer, fed on ox and cow,<br> Who bears the Soma on his back.<br> 12 Yea, thee, O Agni, do we seek with homage and with fuel, Priest<br> Whose wisdom is most excellent.<br> 13 O worshipped with oblations, pure Agni, we call on thee as erst,<br> Did Bh&#7771;gu, Manus, A&#7749;giras.<br> 14 For thou, O Agni, by the fire, Sage by the Sage, Good by the Good,<br> Friend by the Friend, art lighted up.<br> 15 So wealth in thousands, food with store of heroes give thou to the sage,<br> O Agni, to the worshipper.<br> 16 O Agni, Brother, made by strength, Lord of red steeds and brilliant sway,<br> Take pleasure in this laud of mine.<br> 17 My praises, Agni, go to thee, as the cows seek the stall to meet,<br> The lowing calf that longs for milk.<br> 18 Agni, best A&#7749;giras, to thee all people who have pleasant homes,<br> Apart, have turned as to their wish.<br> 19 The sages skilled in holy song and thinkers with their thoughts have urged<br> Agni to share the sacred feast.<br> 20 So, Agni, unto thee the Priest, Invoker, strong in forays, pray<br> Those who spin out the sacrifice.<br> 21 In many a place, the same in look art thou, a Prince o&#146;er all the tribes<br> In battles we invoke thine aid.<br> 22 Pray thou to Agni, pray to him who blazes served with sacred oil:<br> Let him give ear to this our call.<br> 23 We call on thee as such, as one who hears, as J&#257;tavedas, one,<br> Agni! who beats away our foes.<br> 24 I pray to Agni, King of men, the Wonderful, the President<br> Of holy Laws: may he give ear.<br> 25 Him like a bridegroom, him who stirs all people, like a noble horse,<br> Like a fleet steed, we instigate.<br> 26 Slaying things deadly, burning up foes, R&#257;k&#7779;asas, on every side,<br> Shine, Agni, with thy sharpened flame.<br> 27 Thou whom the people kindle even as Manus did, best A&#7749;giras!<br> O Agni, mark thou this my speech.<br> 28 O Agni, made by strength! be thou born in the heavens or born in floods,<br> As such we call on thee with songs.<br> 29 Yea, all the people, all the folk who have good dwellings, each apart,<br> Send food for thee to eat thereof.<br> 30 O Agni, so may we, devout, gazed at by men, throughout our days,<br> Pass lightly over all distress.<br> 31 We venerate with cheerful hearts the cheerful Agni, dear to all,<br> Burning, with purifying flame.<br> 32 So thou, O Agni rich in light, beaming like S&#363;rya with thy rays<br> Boldly demolishest the gloom,<br> 33 We pray to thee for this thy gift, Victor the gift that faileth not,<br> O Agni, choicest wealth from thee.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08044.htm\">Next: HYMN XLIV. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08043.html",
  "api": "json/hymns/08043.json",
  "data": {
    "title": "HYMN XLIII. Agni.",
    "describe": "THESE songs of mine go forth as lauds of Agni, the disposing Sage, whose worshipper is ne&#146;",
    "feecting": "p:THESE songs of mine go forth as lauds of Agni, the disposing Sage, whose worshipper is ne&#146;er o&#146;erthrown.\np:Wise Agni J&#257;tavedas, I beget a song of praise for thee.\np: Who willingly receivest it.\r\np:Thy sharpened flames, O Agni, like the gleams of light that glitter through, Devour the forests with their teeth.\np:Gold-coloured, bannered with the smoke, urged by the wind, aloft to Heaven Rise, lightly borne, the flames of fire.\np:These lightly kindled fiery flames are all around made visible, Even as the gleanings of the Dawns.\np:As J&#257;tavedas speeds along, the dust is black beneath his feet, when Agni spreads upon the Earth.\np:Making the plants his nourishment, Agni devours and wearies not, Seeking the tender shrubs again.\np:Bending him down with all his tongues, he flickers with his fiery glow Splendid is Agni in the woods.\np:Agni, thine home is in the floods: into the plants thou forcest way, and as their Child art born anew.\np:Worshipped with offerings shines thy flame, O Agni, from the sacred oil, with kisses on the ladle's mouth.\np:Let us serve Agni with our hymns, Disposer, fed on ox and cow, who bears the Soma on his back.\np:Yea, thee, O Agni, do we seek with homage and with fuel, Monk Whose wisdom is most excellent.\np:O worshipped with oblations, pure Agni, we call on thee as erst, Did Bh&#7771;gu, Manus, A&#7749;giras.\np:For thou, O Agni, by the fire, Sage by the Sage, Good by the Good, Friend by the Friend, art lighted up.\np:So wealth in thousands, food with store of heroes give thou to the sage, O Agni, to the worshipper.\np:O Agni, Brother, made by strength, Lord of red steeds and brilliant sway, Take pleasure in this laud of mine.\np:My praises, Agni, go to thee, as the cows seek the stall to meet, the lowing calf that longs for milk.\np:Agni, best A&#7749;giras, to thee all people who have pleasant homes, Apart, have turned as to their wish.\np:The sages skilled in holy song and thinkers with their thoughts have urged Agni to share the sacred feast.\np:So, Agni, unto thee the Monk, Invoker, strong in forays, pray Those who spin out the offering.\np:In many a place, the same in look art thou, a Prince o&#146;er all the tribes In battles we invoke thine aid.\np:Pray thou to Agni, pray to him who blazes served with sacred oil: Let him give ear to this our call.\np:We call on thee as such, as one who hears, as J&#257;tavedas, one, Agni! who beats away our foes.\np:I pray to Agni, King of men, the Wonderful, the President Of holy Laws. May he give ear.\np:Him like a bridegroom, him who stirs all people, like a noble horse, like a fleet steed, we instigate.\np:Slaying things deadly, burning up foes, R&#257;k&#7779;asas, on every side, Shine, Agni, with thy sharpened flame.\np:Thou whom the people kindle even as Manus did, best A&#7749;giras! O Agni, mark thou this my speech.\np:O Agni, made by strength! be thou born in the heavens or born in floods, as such we call on thee with songs.\np:Yea, all the people, all the folk who have good dwellings, each apart, Send food for thee to eat thereof.\np:O Agni, s. May we, devout, gazed at by men, throughout our days, Pass lightly over all distress.\np:We venerate with cheerful hearts the cheerful Agni, dear to all, Burning, with purifying flame.\np:So thou, O Agni rich in light, beaming like S&#363;rya with thy rays Boldly demolishest the gloom,\np:We meditate to thee for this thy gift, Victor the gift that faileth not, O Agni, choicest wealth from thee.",
    "next": "08044",
    "previous": "08042",
    "book": "08"
  },
  "created": 1638556517942,
  "updated": 1638647790675
}