{
  "key": "08053",
  "title": "RigVeda Hymn 08053",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08053.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08052.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08054.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LIII. Indra.</h3>  \n<p>1. MAY our hymns give thee great delight. Display thy bounty, Thunderer.<br> Drive off the enemies of prayer.<br> 2 Crush with thy foot the niggard churls who bring no gifts. Mighty art thou<br> There is not one to equal thee.<br> 3 Thou art the Lord of Soma pressed, Soma impressed is also thine.<br> Thou art the Sovran of the folk.<br> 4 Come, go thou forth, dwelling in heaven and listening to the prayers of men:<br> Thou fillest both the heavens and earth.<br> 5 Even that hill with rocky heights, with hundreds, thousands, held within.<br> Thou for thy worshippers brakest through.<br> 6 We call on thee both night and day to taste the flowing Soma juice:<br> Do thou fulfil our heart's desire.<br> 7 Where is that ever-youthful Steer, strong. necked and never yet bent down?<br> What Brahman ministers to him?<br> 8 To whose libation doth the Steer, betake him with delight therein?<br> Who takes delight in Indra now?<br> 9 Whom, V&#7771;tra-slayer, have thy gift and hero powers accompanied?<br> Who is thy dearest in the laud?<br> 10 For thee among mankind, among the P&#363;rus is this Soma shed.<br> Hasten thou hither: drink thereof.<br> 11 This, growing by Soma and by &#346;arya&#7751;&#257;v&#257;n, dear to thee,<br> In &#256;rj&#299;k&#299;ya, cheers thee best.<br> 12 Hasten thou hitherward, and drink this for munificence to-day,<br> Delightful for thine eager draught.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08054.htm\">Next: HYMN LIV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08053.html",
  "api": "json/hymns/08053.json",
  "data": {
    "title": "HYMN LIII. Indra.",
    "describe": "MAY our hymns give thee great delight.",
    "feecting": "p:MAY our hymns give thee great delight. Display thy bounty, Thunderer.\np: Drive off the enemies of prayer.\r\np:Crush with thy foot the niggard churls who bring no gifts. Mighty art thou There is not one to equal thee.\np:Thou art the Lord of Soma pressed, Soma impressed is also thine. Thou art the Sovran of the folk.\np:Come, go thou forth, dwelling in Heaven and listening to the prayers of men: Thou fillest both the heavens and Earth.\np:Even that hill with rocky heights, with hundreds, thousands, held within. Thou for thy worshippers brakest through.\np:We call on thee both night and day to taste the flowing Soma juice: Do thou fulfil our heart's desire.\np:Where is that ever-youthful Steer, strong. necked and never yet bent down? What Brahman ministers to him?\np:To whose libation doth the Steer, betake him with delight therein? Who takes delight in Indra now?\np:Whom, V&#7771;tra-slayer, have thy gift and hero powers accompanied? Who is thy dearest in the laud?\np:For thee among mankind, among the P&#363;rus is this Soma shed. Hasten thou hither: drink thereof.\np:This, growing by Soma and by &#346;arya&#7751;&#257;v&#257;n, dear to thee, in &#256;rj&#299;k&#299;ya, cheers thee best.\np:Hasten thou hitherward, and drink this for munificence to-day, Delightful for thine eager draught.",
    "next": "08054",
    "previous": "08052",
    "book": "08"
  },
  "created": 1638556570559,
  "updated": 1638792008132
}