{
  "key": "08050",
  "title": "RigVeda Hymn 08050",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN L. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08050.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08049.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08051.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN L. Indra.</h3>  \n<p>1. BOTH boons,&#151;may Indra, hitherward turned, listen to this prayer of ours,<br> And mightiest Maghavan with thought inclined to us come near to drink the Soma juice.<br> 2 For him, strong, independent Ruler, Heaven and Earth have fashioned forth for power and might.<br> Thou seatest thee as first among thy peers in place, for thy soul longs for Soma juice.<br> 3 Fill thyself full, O Lord of wealth, O Indra, with the juice we shed.<br> We know thee, Lord of Bay Steeds victor in the fight, vanquishing e&#146;en the invincible.<br> 4 Changeless in truth, O Maghavan Indra, let it be as thou in wisdom willest it.<br> May we, O fair of check, win booty with thine aid, O Thunderer, swiftly seeking it.<br> 5 Indra, with all thy saving helps give us assistance, Lord of power.<br> For after thee we follow even as glorious bliss, thee, Hero, finder-out of wealth.<br> 6 Increaser of our steeds and multiplying kine, a golden well, O God, art thou,<br> For no one may impair the gifts laid up in thee. Bring me whatever thing I ask.<br> 7 For thou,&#151;come to the worshipper!&#151;wilt find great wealth to make us rich.<br> Fill thyself full, O Maghavan, for gain of kine, full, Indra, for the gain of steeds.<br> 8 Thou as thy gift bestowest many hundred herds, yea, many thousands dost thou give.<br> With singers' hymns have we brought the Fort-render near, singing to Indra for his grace.<br> 9 Whether the simple or the sage, Indra, have offered praise to thee,<br> He &#346;atakratu! by his love hath gladdened thee, ambitious! ever pressing on!<br> 10 If he the Strong of arm, the breaker-down of forts, the great Destroyer, hear my call,<br> We, seeking riches cry to Indra, Lord of wealth, to &#346;atakratu with our lauds.<br> 11 We count not then as sinners, nor as niggardly or foolish men,<br> When with the Soma juice which we have shed we make Indra, the Mighty One, our Friend.<br> 12 Him have we yoked in fight, the powerful Conqueror, debt-claimer, not to be deceived.<br> Best charioteer, the Victor marks each fault, he knows the strong to whom he will come near.<br> 13 Indra, give us security from that whereof we are afraid.<br> Help us, O Maghavan, let thy succour give us this: drive away foes and enemies.<br> 14 For thou, O liberal Lord of bounty, strengthenest his ample home who worships thee.<br> So Indra, Maghavan, thou Lover of the Song, we with pressed Soma call on thee,<br> 15 Indra is V&#7771;tra-slayer, guard, our best defender from the foe.<br> May he preserve our last and middlemost, and keep watch from behind us and before.<br> 16 Defend us from behind, below, above, in front, on all sides, Indra, shield us well.<br> Keep far away from us the terror sent from heaven: keep impious weapons far away.<br> 17 Protect us, Indra, each to-day, each morrow, and each following day.<br> Our singers, through all days, shalt thou, Lord of the brave, keep safely both by day and night.<br> 18 A crushing Warrior, passing rich is Maghavan, endowed with all heroic might.<br> Thine arms, O &#346;atakratu, are exceeding strong, arms which have grasped the thunderbolt.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08051.htm\">Next: HYMN LI. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08050.html",
  "api": "json/hymns/08050.json",
  "data": {
    "key": "08050",
    "title": "HYMN L. Indra.",
    "describe": "BOTH boons.",
    "feecting": "p:BOTH boons.may Indra, hitherward turned, listen to this prayer of ours, and mightiest Indra with thought inclined to us come near  juice.\np:For him, strong, independent Ruler. Heaven and Earth have fashioned forth for power and might.\np: Thou seatest thee as first among thy peers in place, for thy soul longs for Soma juice.\r\np:Fill thyself full, O Lord of wealth, O Indra, with the juice we shed. We know thee, Lord of Bay Steeds victor in the fight, vanquishing e’en the invincible.\np:Changeless in truth, O Indra Indra, let it be as thou in wisdom willest it. May we, O fair of check, win booty with thine aid, O Thunderer, swiftly seeking it.\np:Indra, with all thy saving helps give us assistance, Lord of power. For after thee we follow even as glorious bliss, thee. Hero, finder-out of wealth.\np:Increaser of our steeds and multiplying kine, a golden well, art thou, for no on. May impair the gifts laid up in thee. Bring me whatever thing I ask.\np:For thou.come to the worshipper!—wilt find great wealth to make us rich. Fill thyself full, O Indra, for gain of kine, full, Indra, for the gain of steeds.\np:Thou as thy gift bestowest many hundred herds, yea, many thousands dost thou give. With singers' hymns have we brought the Fort-render near, singing to Indra for his grace.\np:Whether the simple or the sage, Indra, have offered praise to thee. He Śatakratu! by his love hath gladdened thee, ambitious! ever pressing on!\np:If he the Strong of arm, the breaker-down of forts, the great Destroyer, hear my call, We, seeking riches cry to Indra, Lord of wealth, to Śatakratu with our lauds.\np:We count not then as sinners, nor as niggardly or foolish men, when with the Soma juice which we have shed we make Indra, the Mighty One, our Friend.\np:Him have we yoked in fight, the powerful Conqueror, debt-claimer, not to be deceived. Best charioteer, the Victor marks each fault, he knows the strong to whom he will come near.\np:Indra, give us security from that whereof we are afraid. Help us, O Indra, let thy assist give us this: drive away foes and enemies.\np:For thou, O liberal Lord of bounty, strengthenest his ample home who worships thee. So Indra, Indra, thou Lover of the Song, we with pressed Soma call on thee,\np:Indra is Vṛtra-slayer, guard, our best defender from the foe. May he preserve our last and middlemost, and keep watch from behind us and before.\np:Defend us from behind, below, above, in front, on all sides, Indra, shield us well. Keep far away from us the terror sent from Heaven: keep impious weapons far away.\np:Protect us, Indra, each to-day, each morrow, and each following day. Our singers, through all days, shalt thou, Lord of the brave, keep safely both by day and night.\np:A crushing Warrior, passing rich is Indra, endowed with all heroic might. Thine arms, are exceeding strong, arms which have grasped the thunderbolt.",
    "meta": {
      "next": "08051",
      "previous": "08049",
      "book": "08",
      "source": "https://sacred-texts.com/hin/rigveda/rv08050.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv08050.htm"
    },
    "deities": [
      {
        "name": "O Lord",
        "hymns": [
          {
            "key": "08050",
            "title": "HYMN L. Indra."
          }
        ]
      },
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "08050",
            "title": "HYMN L. Indra."
          },
          {
            "key": "08050",
            "title": "HYMN L. Indra."
          },
          {
            "key": "08050",
            "title": "HYMN L. Indra."
          },
          {
            "key": "08050",
            "title": "HYMN L. Indra."
          }
        ]
      },
      {
        "name": "O fair",
        "hymns": [
          {
            "key": "08050",
            "title": "HYMN L. Indra."
          }
        ]
      },
      {
        "name": "O Thunderer",
        "hymns": [
          {
            "key": "08050",
            "title": "HYMN L. Indra."
          }
        ]
      },
      {
        "name": "O liberal",
        "hymns": [
          {
            "key": "08050",
            "title": "HYMN L. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638556554774,
  "updated": 1638830292742
}