{
  "key": "08059",
  "title": "RigVeda Hymn 08059",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LIX. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08059.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08058.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08060.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LIX. Indra.</h3>  \n<p>1. HE who, as Sovran Lord of men, moves with his chariots unrestrained,<br> The V&#7771;tra-slayer vanquisher, of fighting hosts, preeminent, is praised with song.<br> 2 Honour that Indra, Puruhanman! for his aid, in whose sustaining hand of old,<br> The splendid bolt of thunder was deposited, as the great Sun was set in heaven.<br> 3 No one by deed attains to him who works and strengthens evermore:<br> No, not by sacrifice, to Indra. praised o all, resistless, daring, bold in might.<br> 4 The potent Conqueror, invincible in war, him at whose birth the Mighty Ones,<br> The Kine who spread <A HREF=\"errata.htm#23\">afar</A>, sent their loud voices out, heavens, earths seat their loud voices out,<br> 5 O Indra, if a hundred heavens and if a hundred earths were thine&#151;<br> No, not a thousand Suns could match thee at thy birth, not both the worlds, O Thunderer.<br> 6 Thou, Hero, hast performed thy hero deeds with might, yea, all with strength, O Strongest One.<br> Maghavan, help us to a stable full of kine, O Thunderer, with wondrous aids.<br> 7 Let not a godless mortal gain this food, O thou whose life is long!<br> But one who yokes the bright-hued steeds, the Etasas, even Indra yoker of the Bays.<br> 8 Urge ye the Conqueror to give, your Indra greatly to be praised,<br> To be invoked in shallow waters and in depths, to be invoked in deeds of might.<br> 9 O Vasu, O thou Hero, raise us up to ample opulence.<br> Raise us to gain of mighty wealth, O Maghavan, O Indra, to sublime renown.<br> 10 Indra, thou justifiest us, and tramplest down thy slanderers.<br> Guard thyself, valiant Hero, in thy vital parts: strike down the D&#257;sa with thy blows.<br> 11 The man who brings no sacrifice, inhuman, godless, infidel,<br> Him let his friend the mountain cast to rapid death, the mountain cast the Dasyu down.<br> 12 O Mightiest Indra, loving us, gather thou up, as grains of corn,<br> Within thine hand, of these their kine, to give away, yea, gather twice as loving us.<br> 13 O my companions, wish for power. How may we perfect Sara's praise,<br> The liberal princely patron, never to be harmed?<br> 14 By many a sage whose grass is trimmed thou art continually praised,<br> That thou, O Sara, hast bestowed here one and here another calf.<br> 15 The noble, Suradeva's son, hath brought a calf, led by the car to three of us.<br> As a chief brings a goat to milk.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08060.htm\">Next: HYMN LX. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08059.html",
  "api": "json/hymns/08059.json",
  "data": {
    "key": "08059",
    "title": "HYMN LIX. Indra.",
    "describe": "HE who, as Sovran Lord of men, moves with his chariots unrestrained, vanquisher, of fighting hosts, preeminent, is praised with song.",
    "feecting": "p:HE who, as Sovran Lord of men, moves with his chariots unrestrained, vanquisher, of fighting hosts, preeminent, is praised with song.\np:Honour that Indra, Puruhanman! for his aid, in whose sustaining hand of old, the splendid bolt of thunder was deposited, as the great Sun was set in Heaven.\np:No one by deed attains to him who works and strengthens evermore: No, not by offering, to Indra. praised o all, resistless, daring, bold in might.\np:The potent Conqueror, invincible in war, him at whose birth the Mighty Ones, the Kine who spread afar, sent their loud voices out, heavens, earths seat their loud voices out,\np:O Indra, if a hundred heavens and if a hundred earths were thine— No, not a thousand Suns could match thee at thy birth, not both the worlds, O Thunderer.\np:Thou. Hero, hast performed thy hero deeds with might, yea, all with strength, O Strongest One.\np: Indra, help us to a stable full of kine, O Thunderer, with wondrous aids.\r\np:Let not a godless mortal gain this food, O thou whose life is long! But one who yokes the bright-hued steeds, the Etasas, even Indra yoker of the Bays.\np:Urge ye the Conqueror to give, your Indra greatly to be praised, to be invoked in shallow waters and in depths, to be invoked in deeds of might.\np:O Vasu, O thou Hero, raise us up to ample opulence. Raise us to gain of mighty wealth, O Indra, to sublime renown.\np:Indra, thou justifiest us, and tramplest down thy slanderers. Guard thyself, valiant Hero, in thy vital parts: strike down the Dāsa with thy blows.\np:The man who brings no offering, inhuman, godless, infidel, him let his friend the mountain cast to rapid death, the mountain cast the Dasyu down.\np:O Mightiest Indra, loving us, gather thou up, as grains of corn, within thine hand, of these their kine, to give away, yea, gather twice as loving us.\np:O my companions, wish for power. Ho. May we perfect Sara's praise, the liberal princely patron, never to be harmed?\np:By many a sage whose grass is trimmed thou art continually praised, that thou, O Sara, hast bestowed here one and here another calf.\np:The noble, Suradeva's son, hath brought a calf, led by the car to three of us. As a chief brings a goat to milk.",
    "meta": {
      "next": "08060",
      "previous": "08058",
      "book": "08",
      "original": "https://sacred-texts.com/hin/rigveda/rv08059.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv08059.htm"
    },
    "deities": [
      {
        "name": "o all",
        "hymns": [
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          }
        ]
      },
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          },
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          }
        ]
      },
      {
        "name": "O Thunderer",
        "hymns": [
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          },
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          }
        ]
      },
      {
        "name": "O Strongest",
        "hymns": [
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          }
        ]
      },
      {
        "name": "O thou",
        "hymns": [
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          },
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          }
        ]
      },
      {
        "name": "O Vasu",
        "hymns": [
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          }
        ]
      },
      {
        "name": "O Mightiest",
        "hymns": [
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          }
        ]
      },
      {
        "name": "O my ",
        "hymns": [
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          }
        ]
      },
      {
        "name": "O Sara",
        "hymns": [
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          },
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          },
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          },
          {
            "key": "08059",
            "title": "HYMN LIX. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638556602433,
  "updated": 1667440427848
}