{
  "key": "08058",
  "title": "RigVeda Hymn 08058",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LVIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08058.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08057.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08059.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LVIII. Indra.</h3>  \n<p>1. I SEND you forth the song of praise for Indu, hero-gladdener.<br> With hymn and plenty he invites you to complete the sacrifice.<br> 2 Thou wishest for thy kine a bull, for those who long for his approach,<br> For those who turn away from him, lord of thy cows whom none may kill.<br> 3 The dappled kine who stream with milk prepare his draught of Soma juice:<br> Clans in the birth-place of the Gods, in the three luminous realms of heaven.<br> 4 Praise, even as he is known, with song Indra the guardian of the kine,<br> The Son of Truth, Lord of the brave.<br> 5 Hither his Bay Steeds have been sent, red Steeds are on the sacred grass,,<br> Where we in concert sing our songs.<br> 6 For Indra Thunder-armed the kine have yielded mingled milk and meath,<br> What time he found them in the vault.<br> 7 When I and Indra mount on high up to the Bright One's place and home,<br> We, having drunk of meath, will reach his seat whose Friends are three times seven.<br> 8 Sing, sing ye forth your songs of praise, ye Briyamedhas, sing your songs:<br> Yea, let young children sing their lauds as a strong castle praise ye him.<br> 9 Now loudly let the viol sound, the lute send out its voice with might,<br> Shrill be, the music of the string. To Indra. is the hymn up-raised.<br> 10 When hither speed the dappled cows, unflinching, easy to be milked,<br> Seize quickly, as it bursts away, the Soma juice for Indra's drink.<br> 11 Indra hath drunk, Agni hath drunk. all Deities have drunk their fill.<br> Here Varu&#7751;a shall have his home, to whom the floods have sung aloud as mother-kine unto their calves.<br> 12 Thou, Varu&#7751;a, to whom belong Seven Rivers, art a glorious God.<br> The waters flow into thy throat as &#146;twere a pipe with ample mouth.<br> 13 He who hath made the fleet steeds spring, well-harnessed, to the worshipper,<br> He, the swift Guide, is that fair form that loosed the horses near at hand.<br> 14 Indra, the very Mighty, holds his enemies in utter scorn.<br> He, far away, and yet a child, cleft the cloud smitten by his voice.<br> 15 He, yet a boy exceeding small, mounted his newly-fashioned car.<br> He for his Mother and his Sire cooked the wild mighty buffalo.<br> 16 Lord of the home, fair-helmeted, ascend thy chariot wrought of gold.<br> We will attend the Heavenly One, the thousand-footed, red of hue, matchless, who blesses where he goes.<br> 17 With reverence they come hitherward to him as to. a Sovran lord,<br> That they may bring him near for this man's good success, to prosper and bestow his gifts.<br> 18 The Priyamedhas have observed the offering of the men of old,<br> Of ancient custom, while they strewed the sacred grass, and spread their sacrificial food.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08059.htm\">Next: HYMN LIX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08058.html",
  "api": "json/hymns/08058.json",
  "data": {
    "title": "HYMN LVIII. Indra.",
    "describe": "I SEND you forth the song of praise for Indu, hero-gladdener.",
    "feecting": "p:I SEND you forth the song of praise for Indu, hero-gladdener.\np: With hymn and plenty he invites you to complete the offering.\r\np:Thou wishest for thy kine a bull, for those who long for his approach, for those who turn away from him, lord of thy cows whom non. May kill.\np:The dappled kine who stream with milk prepare his draught of Soma juice: Clans in the birth-place of the Devas, in the three luminous realms of Heaven.\np:Praise, even as he is known, with song Indra the guardian of the kine, the Son of Truth, Lord of the brave.\np:Hither his Bay Steeds have been sent, red Steeds are on the sacred grass, Where we in concert sing our songs.\np:For Indra Thunder-armed the kine have yielded mingled milk and meath, What time he found them in the vault.\np:When I and Indra mount on high up to the Bright One's place and home, We, having drunk of meath, will reach his seat whose Friends are three times seven.\np:Sing, sing ye forth your songs of praise, ye Briyamedhas, sing your songs: Yea, let young children sing their lauds as a strong castle praise ye him.\np:Now loudly let the viol sound, the lute send out its voice with might, Shrill be, the music of the string. To Indra. is the hymn up-raised.\np:When hither speed the dappled cows, unflinching, easy to be milked, Seize quickly, as it bursts away, the Soma juice for Indra's drink.\np:Indra hath drunk, Agni hath drunk. all Deities have drunk their fill. Here Varu&#7751;a shall have his home, to whom the floods have sung aloud as mother-kine unto their calves.\np:Thou, Varu&#7751;a, to whom belong Seven Rivers, art a glorious God. The waters flow into thy throat as &#146;twere a pipe with ample mouth.\np:He who hath made the fleet steeds spring, well-harnessed, to the worshipper. He, the swift Guide, is that fair form that loosed the horses near at hand.\np:Indra, the very Mighty, holds his enemies in utter scorn. He, far away, and yet a child, cleft the cloud smitten by his voice.\np:He, yet a boy exceeding small, mounted his newly-fashioned car. He for his Mother and his Sire cooked the wild mighty buffalo.\np:Lord of the home, fair-helmeted, ascend thy chariot wrought of gold. We will attend the Heavenly One, the thousand-footed, red of hue, matchless, who blesses where he goes.\np:With reverence they come hitherward to him as to. a Sovran lord, that the, may bring him near for this man's good success, to prosper and bestow his gifts.\np:The Priyamedhas have observed the offering of the men of old, Of ancient custom, while they strewed the sacred grass, and spread their sacred food.",
    "next": "08059",
    "previous": "08057",
    "book": "08"
  },
  "created": 1638556597159,
  "updated": 1638647072853
}