{
  "key": "08054",
  "title": "RigVeda Hymn 08054",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LIV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08054.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08053.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08055.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LIV. Indra.</h3>  \n<p>1. THOUGH, Indra, thou art called by men from east and west, from north and south,<br> Come hither quickly with fleet steeds<br> 2 If in the effluence of heaven, rich in its light, thou takest joy,<br> Or in the sea in Soma juice.<br> 3 With songs I call thee, Great and Wide, even as a cow to profit us,<br> Indra, to drink the Soma-draught.<br> 4 Hither, O Indra, let thy Bays bear up and, bring upon thy car<br> Thy glory, God! and majesty.<br> 5 Thou, Indra, wouldst be sung and praised as great, strong, lordly in thy deeds<br> Come hither, drink our Soma juice.<br> 6 We who have shed the Soma and prepared the feast are calling thee.<br> To sit on this our sacred grass.<br> 7 As, Indra, thou art evermore the common Lord of all alike,<br> As such we invocate thee now.<br> 8 The men with stones have milked for thee this nectar of the Soma juice:<br> Indra, be pleased with it, and drink.<br> 9 Neglect all pious men with skill in sacred song: come hitherward,<br> With speed, and give us high renown.<br> 10 Gods, may the mighty rest unharmed, the King who gives me spotted kine,<br> Kine decked with golden ornaments.<br> 11 Beside a thousand spotted kine I have received a gift of gold,<br> Pure, brilliant, and exceeding great.<br> 12 Durgaha's grandsons, giving me a thousand kine, munificent,<br> Have won renown among the Gods.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08055.htm\">Next: HYMN LV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08054.html",
  "api": "json/hymns/08054.json",
  "data": {
    "title": "HYMN LIV. Indra.",
    "describe": false,
    "feecting": "p:THOUGH, Indra, thou art called by men from east and west, from north and south, Come hither quickly with fleet steeds\np:If in the effluence of Heaven, rich in its light, thou takest joy, or in the sea in Soma juice.\np:With songs I call thee, Great and Wide, even as a cow to profit us, Indra, -draught.\np:Hither, O Indra, let thy Bays bear up and, bring upon thy car Thy glory, God! and majesty.\np:Thou, Indra, wouldst be sung and praised as great, strong, lordly in thy deeds Come hither, drink our Soma juice.\np:We who have shed the Soma and prepared the feast are calling thee.\np: To sit on this our sacred grass.\r\np:As, Indra, thou art evermore the common Lord of all alike, as such we invocate thee now.\np:The men with stones have milked for thee this nectar of the Soma juice: Indra, be pleased with it, and drink.\np:Neglect all pious men with skill in sacred song: come hitherward, with speed, and give us high renown.\np:Devas. May the mighty rest unharmed, the King who gives me spotted kine, Kine decked with golden ornaments.\np:Beside a thousand spotted kine I have received a gift of gold, Pure, brilliant, and exceeding great.\np:Durgaha's grandsons, giving me a thousand kine, munificent, have won renown among the Devas.",
    "next": "08055",
    "previous": "08053",
    "book": "08"
  },
  "created": 1638556575850,
  "updated": 1638791591918
}