{
  "key": "08066",
  "title": "RigVeda Hymn 08066",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LXVI. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08066.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08065.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08067.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXVI. Indra.</h3>  \n<p>1. SCARCELY was &#346;atakratu, born when of his Mother he inquired,<br> Who are the mighty? Who are famed?<br> 2. Then &#346;avas&#299; declared to him Aur&#7751;av&#257;bha, Ah&#299;&#347;uva:<br> Son, these be they thou must o&#146;erthrow<br> 3 The V&#7771;tra-slayer smote them all as spokes are hammered into naves:<br> The Dasyu-killer waxed in might.<br> 4 Then Indra at a single draught drank the contents of thirty pails,<br> Pails that were filled with Soma juice.<br> 5 Indra in groundless realms of space pierced the Gandharva through, that he<br> Might make Brahmans' strength increase.<br> 6 Down from the mountains Indra shot hither his well-directed shaft:<br> He gained the ready brew of rice.<br> 7 One only is that shaft of thine, with thousand feathers, hundred barbs,<br> Which, Indra, thou hast made thy friend.<br> 8 Strong as the &#7770;bhus at thy birth, therewith to those who praise thee, men,<br> And women, bring thou food to eat.<br> 9 By thee these exploits were achieved, the mightiest deeds, abundantly:<br> Firm in thy heart thou settest them.<br> 10 All these things Vi&#7779;&#7751;u brought, the Lord of ample stride whom thou hadst sent-<br> A hundred buffaloes, a brew of rice and milk: and Indra, slew the ravening boar<br> 11 Most deadly is thy bow, successful, fashioned well: good is thine arrow, decked with gold.<br> Warlike and well equipped thine arms are, which increase sweetness for him who drinks the sweet.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08067.htm\">Next: HYMN LXVII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08066.html",
  "api": "json/hymns/08066.json",
  "data": {
    "key": "08066",
    "title": "HYMN LXVI. Indra.",
    "describe": "SCARCELY was Śatakratu, born when of his Mother he inquired, who are the mighty?",
    "feecting": "p:SCARCELY was Śatakratu, born when of his Mother he inquired, who are the mighty? Who are famed?\np:Then Śavasī declared to him Aurṇavābha, Ahīśuva: Son, these be they thou must o’erthrow\np:The Vṛtra-slayer smote them all as spokes are hammered into naves: The Dasyu-killer waxed in might.\np:Then Indra at a single draught drank the contents of thirty pails, Pails that were filled with Soma juice.\np:Indra in groundless realms of space pierced the Gandharva through, that he Might make Brahmans' strength increase.\np:Down from the mountains Indra shot hither his well-directed shaft: He gained the ready brew of rice.\np:One only is that shaft of thine, with thousand feathers, hundred barbs, Which, Indra, thou hast made thy friend.\np:Strong as the Ṛbhus at thy birth, therewith to those who praise thee, men, and women, bring thou food to eat.\np:By thee these exploits were achieved, the mightiest deeds, abundantly: Firm in thy heart thou settest them.\np:All these things Indra brought, the Lord of ample stride whom thou hadst sent- A hundred buffaloes, a brew of rice and milk: and Indra, slew the ravening boar\np:Most deadly is thy bow, successful, fashioned well: good is thine arrow, decked with gold.\np: Warlike and well equipped thine arms are, which increase sweetness for him who drinks the sweet.",
    "meta": {
      "next": "08067",
      "previous": "08065",
      "book": "08",
      "source": "https://sacred-texts.com/hin/rigveda/rv08066.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv08066.htm"
    },
    "deities": []
  },
  "created": 1638556639804,
  "updated": 1638830292768
}