{
  "key": "08069",
  "title": "RigVeda Hymn 08069",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LXIX. Indra</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08069.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08068.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08070.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXIX. Indra</h3>  \n<p>1. O Sarakratu! truely I have made none else my Comforter.<br> Indra; be gracious unto us.<br> 2 Thou who hast ever aided us kindly of old to win the spoil,<br> As such, O Indra, favour us.<br> 3 What now? As prompter of the poor thou helpest him who sheds the juice.<br> Wilt thou not, Indra, strengthen us?<br> 4 O Indra, help our chariot on, yea, Thunderer, though it lag behind:<br> Give this my car the foremost place.<br> 5 Ho there! why sittest thou at case? Make thou my chariot to be first<br> And bring the fame of victory near.<br> 6 Assist our car that seeks the prize. What can be easier for thee?<br> So make thou us victorious.<br> 7 Indra, be firm: a fort art thou. To thine appointed place proceeds<br> The auspicious hymn in season due.<br> 8 Let not our portion be disgrace. Broad is the course, the prize is set,<br> The barriers are opened wide.<br> 9 This thing we wish. that thou mayst take thy fourth, thy sacrificial name.<br> So art thou held to be our Lord.<br> 10 Ekadyu hath exalted you, Immortals: both Goddesses and Gods hath he delighted.<br> Bestow upon him bounty meet for praises. May he, enriched with prayer, come soon and early.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08070.htm\">Next: HYMN LXX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08069.html",
  "api": "json/hymns/08069.json",
  "data": {
    "title": "HYMN LXIX. Indra",
    "describe": "O Sarakratu!",
    "feecting": "p:O Sarakratu! truely I have made non else my Comforter.\np: Indra; be gracious unto us.\r\np:Thou who hast ever aided us kindly of old to win the spoil, as such, O Indra, favour us.\np:What now? As prompter of the poor thou helpest him who sheds the juice. Wilt thou not, Indra, strengthen us?\np:O Indra, help our chariot on, yea, Thunderer, though it lag behind: Give this my car the foremost place.\np:Ho there! why sittest thou at case? Make thou my chariot to be first And bring the fame of victory near.\np:Assist our car that seeks the prize. What can be easier for thee? So make thou us victorious.\np:Indra, be firm: a fort art thou. To thine appointed place proceeds The auspicious hymn in season due.\np:Let not our portion be disgrace. Broad is the course, the prize is set, the barriers are opened wide.\np:This thing we wish. that tho. Mayst take thy fourth, thy sacrificial name. So art thou held to be our Lord.\np:Ekadyu hath exalted you, Immortals: both Goddesses and Devas hath he delighted. Bestow upon him bounty meet for praises. May he, enriched with meditation, come soon and early.",
    "next": "08070",
    "previous": "08068",
    "book": "08"
  },
  "created": 1638556655647,
  "updated": 1638646519609
}