{
  "key": "08061",
  "title": "RigVeda Hymn 08061",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LXI. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08061.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08060.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08062.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXI. Agni.</h3>  \n<p>1. PREPARE oblation: let him come; and let the minister serve again<br> Who knows the ordering thereof,<br> 2 Rejoicing in his friendship, let the priest be seated over man,<br> Beside the shoot of active power.<br> 3 Him, glowing bright beyond all thought, they seek among the race of man;<br> With him for <A HREF=\"errata.htm#24\">tongue</A> they seize the food.<br> 4 He hath inflamed the twofold plain: life-giving, he hath climbed the wood,<br> And with his tongue hath struck the rock.<br> 5 Wandering here the radiant Calf finds none to fetter him, and seeks<br> The Mother to declare his praise.<br> 6 And now that great and mighty team, the team of horses that are his,<br> And traces of his car, are seen.<br> 7 The seven milk a single cow; the two set other five to work,<br> On the stream's loud-resounding bank.<br> 8 Entreated by Vivasv&#257;n's ten, Indra cast down the water-jar<br> With threefold hammer from the sky.<br> 9 Three times the newly-kindled flame proceeds around the sacrifice:<br> The priests anoint it with the meath.<br> 10 With reverence they drain the fount that circles with its wheel above,<br> Exhaustless, with the mouth below.<br> 11 The pressing-stones are set at work: the meath is poured into the tank,<br> At the out-shedding of the fount.<br> 12 Ye cows, protect the fount: the two Mighty Ones bless the sacrifice.<br> The handles twain are wrought of gold.<br> 13 Pour on the juice the ornament which reaches both the heaven and earth<br> Supply the liquid to the Bull.<br> 14 These know their own abiding-place: like calves beside the mother cows<br> They meet together with their kin.<br> 15 Devouring in their greedy jaws, they make sustaining food in heaven,<br> To Indra, Agni light and prayer.<br> 16 The Pious One milked out rich food, sustenance dealt in portions seven,<br> Together with the Sun's seven rays.<br> 17 I took some Soma when the Sun rose up, O Mitra, Varu&#7751;a.<br> That is the sick man's medicine.<br> 18 From where oblations must be laid, which is the Well-beloved's home,<br> He with his tongue hath compassed heaven.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08062.htm\">Next: HYMN LXII. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08061.html",
  "api": "json/hymns/08061.json",
  "data": {
    "title": "HYMN LXI. Agni.",
    "describe": "PREPARE oblation: let him come;",
    "feecting": "p:PREPARE oblation: let him come; and let the minister serve again Who knows the ordering thereof,\np:Rejoicing in his friendship, let the Monk be seated over man, beside the shoot of active power.\np:Him, glowing bright beyond all thought, they seek among the race of man; With him for tongue they seize the food.\np:He hath inflamed the twofold plain: life-giving, he hath climbed the wood, and with his tongue hath struck the rock.\np:Wandering here the radiant Calf finds none to fetter him, and seeks The Mother to declare his praise.\np:And now that great and mighty team, the team of horses that are his, and traces of his car, are seen.\np:The seven milk a single cow; the two set other five to work, On the stream's loud-resounding bank.\np:Entreated by Vivasv&#257;n's ten, Indra cast down the water-jar With threefold hammer from the sky.\np:Three times the newly-kindled flame proceeds around the offering: The Monks anoint it with the meath.\np:With reverence they drain the fount that circles with its wheel above, Exhaustless, with the mouth below.\np:The pressing-stones are set at work: the meath is poured into the tank, At the out-shedding of the fount.\np:Ye cows, protect the fount: the two Mighty Ones bless the offering.\np: The handles twain are wrought of gold.\r\np:Pour on the juice the ornament which reaches both the Heaven and Earth Supply the liquid to the Bull.\np:These know their own abiding-place: like calves beside the mother cows They meet together with their kin.\np:Devouring in their greedy jaws, they make sustaining food in Heaven, to Indra, Agni light and prayer.\np:The Pious One milked out rich food, sustenance dealt in portions seven, together with the Sun's seven rays.\np:I took some Soma when the Sun rose up, O Mitra, Varu&#7751;a. That is the sick man's medicine.\np:From where oblations must be laid, which is the Well-beloved's home. He with his tongue hath compassed Heaven.",
    "next": "08062",
    "previous": "08060",
    "book": "08"
  },
  "created": 1638556612975,
  "updated": 1638790698315
}