{
  "key": "08060",
  "title": "RigVeda Hymn 08060",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LX. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08060.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08059.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08061.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LX. Agni.</h3>  \n<p>1. O AGNI, with thy mighty wealth guard us from all malignity,<br> Yea, from all hate of mortal man.<br> 2 For over thee, O Friend from birth, the wrath of man hath no control:<br> Nay, Guardian of the earth art thou.<br> 3 As such, with all the Gods, O Son of Strength, auspicious in thy flame.<br> Give us wealth bringing all things good.<br> 4 Malignities stay not from wealth the mortal man whom, Agni, thou<br> Protectest while he offers gifts.<br> 5 Sage Agni, be whom thou dost urge, in worship of the Gods, to wealth,<br> With thine assistance winneth kine.<br> 6 Riches with many heroes thou hast for the man who offers gifts:<br> Lead thou us on to higher bliss.<br> 7 Save us, O J&#257;tavedas, nor abandon us to him who sins,<br> Unto the evil-hearted man.<br> 8 O Agni, let no godless man avert thy bounty as a God:<br> Over all treasures thou art Lord.<br> 9 So, Son of Strength, thou aidest us to what is great and excellent.<br> Those, Vasu! Friend! who sing thy praise.<br> 10 Let our songs come anear to him beauteous and bright with piercing flame<br> Our offerings, with our homage, to the<br> Lord of wealth, to him whom many praise, for help:<br> 11 To Agni J&#257;tavedas, to the Son of Strength, that he may give us precious gifts,<br> Immortal, from of old Priest among mortal men, the most delightful in the house.<br> 12 Agni, made yours by sacrifice, Agni, while holy rites advance;<br> Agni, the first in songs, first with the warrior steed; Agni to win the land for us.<br> 13 May Agni who is Lord of wealth vouchsafe us food for friendship sake.<br> Agni we ever seek for seed and progeny, the Vasu who protects our lives.<br> 14 Solicit with your chants, for help, Agni the God with piercing flame,<br> For riches famous Agni, Purum&#299;lha and ye men! Agni to light our dwelling well.<br> 15 Agni we laud that he may keep our foes afar, Agni to give us health and strength.<br> Let him as Guardian be invoked in all the tribes, the lighter-up of glowing brands.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08061.htm\">Next: HYMN LXI. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08060.html",
  "api": "json/hymns/08060.json",
  "data": {
    "title": "HYMN LX. Agni.",
    "describe": "O AGNI, with thy mighty wealth guard us from all malignity, Yea, from all hate of mortal man.",
    "feecting": "p:O AGNI, with thy mighty wealth guard us from all malignity, Yea, from all hate of mortal man.\np:For over thee, O Friend from birth, the wrath of man hath no control: Nay, Guardian of the Earth art thou.\np:As such, with all the Devas, O Son of Strength, auspicious in thy flame.\np: Give us wealth bringing all things good.\r\np:Malignities stay not from wealth the mortal man whom, Agni, thou Protectest while he offers gifts.\np:Sage Agni, be whom thou dost urge, in worship of the Devas, to wealth, with thine assistance winneth kine.\np:Riches with many heroes thou hast for the man who offers gifts: Lead thou us on to higher bliss.\np:Save us, O J&#257;tavedas, nor abandon us to him who sins, Unto the evil-hearted man.\np:O Agni, let no godless man avert thy bounty as a God: Over all treasures thou art Lord.\np:So, Son of Strength, thou aidest us to what is great and excellent. Those, Vasu! Friend! who sing thy praise.\np:Let our songs come anear to him beauteous and bright with piercing flame Our offerings, with our homage, to the Lord of wealth, to him whom many praise, for help:\np:To Agni J&#257;tavedas, to the Son of Strength, that h. May give us precious gifts, Immortal, from of old Monk among mortal men, the most delightful in the house.\np:Agni, made yours by offering, Agni, while holy rites advance; Agni, the first in songs, first with the warrior steed; Agni to win the land for us.\np:May Agni who is Lord of wealth vouchsafe us food for friendship sake. Agni we ever seek for seed and progeny, the Vasu who protects our lives.\np:Solicit with your chants, for help, Agni the Deva with piercing flame, for riches famous Agni, Purum&#299;lha and ye men! Agni to light our dwelling well.\np:Agni we laud that h. May keep our foes afar, Agni to give us health and strength. Let him as Guardian be invoked in all the tribes, the lighter-up of glowing brands.",
    "next": "08061",
    "previous": "08059",
    "book": "08"
  },
  "created": 1638556607711,
  "updated": 1638646519600
}