{
  "key": "08079",
  "title": "RigVeda Hymn 08079",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LXXIX. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08079.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08078.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08080.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXIX. Indra.</h3>  \n<p>1. MAY Indra, who in every fight must be invoked, be near to us.<br> May the most mighty V&#7771;tra-slayer, meet for praise, come to libations and to hymns.<br> 2 Thou art the best of all in sending bounteous gifts, true art thou, lordly in thine act.<br> We claim alliance with the very Glorious One, yea, with the Mighty Son of Strength.<br> 3 Prayers unsurpassed are offered up to thee the Lover of the Song.<br> Indra, Lord of Bay Steeds, accept these fitting hymns, hymns which we have thought out for thee.<br> 4 For thou, O Maghavan, art truthful, ne&#146;er subdued and bringest many a V&#7771;tra low.<br> As such, O Mightiest Lord, Wielder of Thunder, send wealth hither to the worshipper.<br> 5 O Indra, thou art far-renowned, impetuous, O Lord of Strength.<br> Alone thou slayest with the guardian of mankind resistless never-conquered foes.<br> 6 As such we seek thee now, O Asura, thee most wise, craving thy bounty as our share.<br> Thy sheltering defence is like a mighty cloak. So may thy glories reach to us.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08080.htm\">Next: HYMN LXXX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08079.html",
  "api": "hymns/08079json",
  "data": {
    "title": "HYMN LXXIX. Indra.",
    "describe": "MAY Indra, who in every fight must be invoked, be near to us.",
    "feecting": "p:MAY Indra, who in every fight must be invoked, be near to us.\np: May the most mighty Vṛtra-slayer, meet for praise, come to libations and to hymns.\r\np:Thou art the best of all in sending bounteous gifts, true art thou, lordly in thine act. We claim alliance with the very Glorious One, yea, with the Mighty Son of Strength.\np:Prayers unsurpassed are offered up to thee the Lover of the Song. Indra, Lord of Bay Steeds, accept these fitting hymns, hymns which we have thought out for thee.\np:For thou, O Indra, art truthful, ne’er subdued and bringest many a Vṛtra low. As such, O Mightiest Lord, Wielder of Thunder, send wealth hither to the worshipper.\np:O Indra, thou art far-renowned, impetuous, O Lord of Strength. Alone thou slayest with the guardian of mankind resistless never-conquered foes.\np:As such we seek thee now, O Devas, thee most wise, craving thy bounty as our share. Thy sheltering defence is like a mighty cloak. May thy glories reach to us.",
    "next": "08080",
    "previous": "08078",
    "book": "08"
  },
  "created": 1638556708253
}