{
  "key": "08087",
  "title": "RigVeda Hymn 08087",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LXXXVII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08087.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08086.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08088.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXVII. Indra.</h3>  \n<p>1. To Indra sing a S&#257;ma hymn, a lofty song to Lofty Sage,<br> To him who guards the Law, inspired, and fain for praise.<br> 2 Thou, Indra, art the Conqueror: thou gavest splendour to the Sun.<br> Maker of all things, thou art Mighty and All-God.<br> 3 Radiant with light thou wentest to the sky, the luminous realm of heaven.<br> ne Deities, Indra strove to win thee for their Friend.<br> 4 Come unto us, O Indra, dear, still conquering, unconcealable,<br> Vast as a mountain spread on all sides, Lord of Heaven.<br> 5 O truthful Soma-drinker, thou art mightier than both the worlds.<br> Thou strengthenest him who pours libation, Lord of Heaven.<br> 6 For thou art he, O Indra, wiio stormeth all castles of the foe,<br> Slayer of Dasyus, man's Supporter, Lord of Heaven.<br> 7 Now have we, Indra, Friend of Song, sent our great wishes forth to thee,<br> Coming like floods that follow floods.<br> 8 As rivers swell the ocean, so, Hero, our prayers increase thy might,<br> Though of thyself, O Thunderer, waxing day by day.<br> 9 With holy song mey bind to the broad wide-yoked car the Bay Steeds of the rapid God,<br> Bearers of Indra, yoked by word.<br> 10 O Indra, bring great strength to us, bring valour, &#346;atakratu, thou most active, bring<br> A hero conquering in war.<br> 11 For, gracious &#346;atakratu, thou hast ever been a Mother and a Sire to us,<br> So now for bliss we pray to thee.<br> 12 To thee, Strong, Much-invoked, who showest forth thy strength, O &#346;atakratu, do I speak:<br> So grant thou us heroic strength.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08088.htm\">Next: HYMN LXXXVIII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08087.html",
  "api": "json/hymns/08087.json",
  "data": {
    "key": "08087",
    "title": "HYMN LXXXVII. Indra.",
    "describe": "To Indra sing a Sāma hymn, a lofty song to Lofty Sage, to him who guards the Law, inspired, and fain for praise.",
    "feecting": "p:To Indra sing a Sāma hymn, a lofty song to Lofty Sage, to him who guards the Law, inspired, and fain for praise.\np:Thou, Indra, art the Conqueror: thou gavest splendour to the Sun.\np: Maker of all things, thou art Mighty and All-God.\r\np:Radiant with light thou wentest to the sky, the luminous realm of Heaven. ne Deities, Indra strove to win thee for their Friend.\np:Come unto us, O Indra, dear, still conquering, unconcealable, Vast as a mountain spread on all sides, Lord of Heaven.\np:O truthful Soma-drinker, thou art mightier than both the worlds. Thou strengthenest him who pours libation, Lord of Heaven.\np:For thou art he, O Indra, wiio stormeth all castles of the foe, Slayer of Dasyus, man's Supporter, Lord of Heaven.\np:Now have we, Indra, Friend of Song, sent our great wishes forth to thee, Coming like floods that follow floods.\np:As rivers swell the ocean, so. Hero, our meditations increase thy might, Though of thyself, O Thunderer, waxing day by day.\np:With holy song mey bind to the broad wide-yoked car the Bay Steeds of the rapid Deva, bearers of Indra, yoked by word.\np:O Indra, bring great strength to us, bring valour, Śatakratu, thou most active, bring A hero conquering in war.\np:For, gracious Śatakratu, thou hast ever been a Mother and a Sire to us, So now for bliss we pray to thee.\np:To thee, Strong, Much-invoked, who showest forth thy strength, do I speak: So grant thou us heroic strength.",
    "meta": {
      "next": "08088",
      "previous": "08086",
      "book": "08",
      "source": "https://sacred-texts.com/hin/rigveda/rv08087.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv08087.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "08087",
            "title": "HYMN LXXXVII. Indra."
          },
          {
            "key": "08087",
            "title": "HYMN LXXXVII. Indra."
          },
          {
            "key": "08087",
            "title": "HYMN LXXXVII. Indra."
          }
        ]
      },
      {
        "name": "O truthful",
        "hymns": [
          {
            "key": "08087",
            "title": "HYMN LXXXVII. Indra."
          }
        ]
      },
      {
        "name": "O Thunderer",
        "hymns": [
          {
            "key": "08087",
            "title": "HYMN LXXXVII. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638556750424,
  "updated": 1638830292795
}