{
  "key": "08082",
  "title": "RigVeda Hymn 08082",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LXXXII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08082.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08081.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08083.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXII. Indra.</h3>  \n<p>1. SURYA, thou mountest up to meet the Hero famous for his wealth,<br> Who hurls the bolt and works for man<br> 2 Him who with might of both his arms brake nine-and-ninety castles down,<br> Slew V&#7771;tra and smote Ahi dead.<br> 3 This Indra is our gracious Friend. He sends us in a full broad stream<br> Riches in horses, kine, and corn.<br> 4 Whatever, V&#7771;tra-slayer! thou, S&#363;rya, hast risen upon to-day,<br> Tbat, Indra, all is in thy power.<br> 5 When, Mighty One, Lord of the brave, thou thinkest thus, I shall not die,<br> That thought of thine is true indeed.<br> 6 Thou, Indra, goest unto all Soma libations shed for thee,<br> Both far away and near at hand.<br> 7 We make this Indra very strong to strike the mighty V&#7771;tra dead:<br> A vigorous Hero shall he be.<br> 8 Indra was made for giving, set, most mighty, o&#146;er the joyous draught.<br> Bright, meet for Soma, famed in song.<br> 9 By song as &#146;twere, the powerful bolt which none may parry was prepared<br> Lofty, invincible he grew.<br> 10 Indra, Song-lover, lauded, make even in the wilds fair ways for us,<br> Whenever, Maghavan, thou wilt.<br> 11 Thou whose commandment and behest of sovran sway none disregards,<br> Neither audacious man nor God.<br> 12 And both these Goddesses, Earth, Heaven, Lord of the beauteous helm! revere<br> Thy might which no one may resist.<br> 13 Thou in the black cows and the red and in the cows with spotted skin<br> This white milk hast deposited.<br> 14 When in their terror all the Gods shrank from the Dragon's furious might,<br> Fear of the monster fell on them.<br> 15 Then he was my Defender, then, Invincible, whose foe is not,<br> The V&#7771;tra-slayer showed his might.<br> 16 Him your best V&#7771;tra-slayer, him the famous Champion of mankind<br> I urge to great munificence,<br> 17 To come, Much-lauded! Many-named with this same thought that longs for milk,<br> Whene&#146;er the Soma juice is shed.<br> 18 Much-honoured by libations, may the V&#7771;tra-slayer wake for us:<br> May &#346;akra listen to our prayers.<br> 19 O Hero, with that aid dost thou delight us, with what succour bring<br> Riches to those who worship thee?<br> 20 With whose libation joys the Strong, the Hero with his team who quells<br> The foe, to drink the Soma juice?<br> 21 Rejoicing in thy spirit bring thousandfold opulence to us:<br> Enrich thy votary with gifts.<br> 22 These juices with their wedded wives flow to enjoyment lovingly:<br> To waters speeds the restless one.<br> 23 Presented strengthening gifts have sent Indra away at sacrifice,<br> With might, onto the cleansing bath.<br> 24 These two who share his feast, Bay Steeds with golden manes, shall bring him to<br> The banquet that is laid for him.<br> 25 For thee, O Lord of Light, are shed these Soma-drops, and grass is strewn<br> Bring Indra to his worshippers.<br> 26 May Indra give thee skill, and lights of heaven, wealth to his votary<br> And priests who praise him: laud ye him.<br> 27 O &#346;atakratu, wondrous strength and all our lauds I bring to thee:<br> Be gracious to thy worshippers.<br> 28 Bring to us all things excellent, O &#346;atakratu, food and strength:<br> For, Indra, thou art kind to us.<br> 2&sect; O &#346;atakratu, bring to us all blessings, all felicity:<br> Fbr, Indra, thou art kind to us.<br> 30 Bearing the Soma juice we call, best V&#7771;tra-slayer, unto thee:<br> For, Indra, thou art kind to us.<br> 31 Come, Lord of rapturous, joys, to our libation with thy Bay Steeds, come<br> To our libation with thy Steeds.<br> 32 Known as best V&#7771;tra-slayer erst, as Indra &#346;atakratu, come<br> With Bay Steeds to the juice we shed.<br> 33 O V&#7771;tra-slayer, thou art he who drinks these drops of Soma: come<br> With Bay Steeds to the juice we shed.<br> 34 May Indra give, to aid us, wealth handy that rules the Skilful Ones:<br> Yea, may the Strong give potent wealth.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08083.htm\">Next: HYMN LXXXIII. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08082.html",
  "api": "json/hymns/08082.json",
  "data": {
    "title": "HYMN LXXXII. Indra.",
    "describe": false,
    "feecting": "p:SURYA, thou mountest up to meet the Hero famous for his wealth, who hurls the bolt and works for man\np:Him who with might of both his arms brake nine-and-ninety castles down, Slew V&#7771;tra and smote Ahi dead.\np:This Indra is our gracious Friend. He sends us in a full broad stream Riches in horses, kine, and corn.\np:Whatever, V&#7771;tra-slayer! thou, S&#363;rya, hast risen upon to-day, Tbat, Indra, all is in thy power.\np:When, Mighty One, Lord of the brave, thou thinkest thus, I shall not die, that thought of thine is true indeed.\np:Thou, Indra, goest unto all Soma libations shed for thee, Both far away and near at hand.\np:We make this Indra very strong to strike the mighty V&#7771;tra dead: A vigorous Hero shall he be.\np:Indra was made for giving, set, most mighty, o&#146;er the joyous draught.\np: Bright, meet for Soma, famed in song.\r\np:By song as &#146;twere, the powerful bolt which non. May parry was prepared Lofty, invincible he grew.\np:Indra, Song-lover, lauded, make even in the wilds fair ways for us, whenever, Indra, thou wilt.\np:Thou whose commandment and behest of sovran sway none disregards, Neither audacious man nor God.\np:And both these Goddesses, Earth. Heaven, Lord of the beauteous helm! revere Thy might which no on. May resist.\np:Thou in the black cows and the red and in the cows with spotted skin This white milk hast deposited.\np:When in their terror all the Devas shrank from the Dragon's furious might, Fear of the monster fell on them.\np:Then he was my Defender, then, Invincible, whose foe is not, the V&#7771;tra-slayer showed his might.\np:Him your best V&#7771;tra-slayer, him the famous Champion of mankind I urge to great munificence,\np:To come, Much-lauded! Many-named with this same thought that longs for milk, whene&#146;er the Soma juice is shed.\np:Much-honoured by libations. May the V&#7771;tra-slayer wake for us: May &#346;akra listen to our meditations.\np:O Hero, with that aid dost thou delight us, with what succour bring Riches to those who worship thee?\np:With whose libation joys the Strong, the Hero with his team who quells The foe,  juice?\np:Rejoicing in thy spirit bring thousandfold opulence to us: Enrich thy votary with gifts.\np:These juices with their wedded wives flow to enjoyment lovingly: To waters speeds the restless one.\np:Presented strengthening gifts have sent Indra away at offering, with might, onto the cleansing bath.\np:These two who share his feast, Bay Steeds with golden manes, shall bring him to The banquet that is laid for him.\np:For thee, O Lord of Light, are shed these Soma-drops, and grass is strewn Bring Indra to his worshippers.\np:May Indra give thee skill, and lights of Heaven, wealth to his votary And monks who praise him: laud ye him.\np:O &#346;atakratu, wondrous strength and all our lauds I bring to thee: Be gracious to thy worshippers.\np:Bring to us all things excellent, O &#346;atakratu, food and strength: For, Indra, thou art kind to us.\np:&sect; O &#346;atakratu, bring to us all blessings, all felicity: Fbr, Indra, thou art kind to us.\np:Bearing the Soma juice we call, best V&#7771;tra-slayer, unto thee: For, Indra, thou art kind to us.\np:Come, Lord of rapturous, joys, to our libation with thy Bay Steeds, come To our libation with thy Steeds.\np:Known as best V&#7771;tra-slayer erst, as Indra &#346;atakratu, come With Bay Steeds to the juice we shed.\np:O V&#7771;tra-slayer, thou art he who drinks these drops of Soma: come With Bay Steeds to the juice we shed.\np:May Indra give, to aid us, wealth handy that rules the Skilful Ones: Yea. May the Strong give potent wealth.",
    "next": "08083",
    "previous": "08081",
    "book": "08"
  },
  "created": 1638556724046,
  "updated": 1638647018427
}