{
  "key": "08084",
  "title": "RigVeda Hymn 08084",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LXXXIV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08084.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08083.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08085.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXIV. Indra.</h3>  \n<p>1. SONG-LOVER! like a charioteer come songs to thee when Soma flows.<br> O Indra, they have called to thee as mother-kine unto their calves.<br> 2 Bright juices bitherward have sped thee, Indra, Lover of the Song.<br> Drink, Indra, of this flowing sap: in every house &#146;tis set for thee.<br> 3 Drink Soma to inspirit thee, juice, Indra, which the Falcon brought:<br> For thou art King and Sovran Lord of all the families of men.<br> 4 O Indra, hear Tirasci's call, the call of him who serveth thee.<br> Satisfy him with wealth of kine and valiant offspring: Great art thou.<br> 5 For he, O Indra, hath produced for thee the newest gladdening song,<br> A hymn that springs from careful thought, ancient, and full of sacred truth.<br> 6 That Indra will we laud whom songs and hymns of praise have magnified.<br> Striving to win, we celebrate his many deeds of hero might.<br> 7 Come now and let us glorify pure Indra with pure S&#257;ma hymns.<br> Let the pure milky draught delight him strengthened by pure songs of praise.<br> 8 O Indra, come thou pure to us, with pure assistance, pure thyself.<br> Pure, send thou riches down to us, and, meet for Soma, pure, be glad.<br> 9 O Indra, pure, vouchsafe us wealth, and, pure, enrich the worshipper.<br> Pure, thou dost strike the V&#7771;tras dead, and strivest, pure, to win the spoil.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08085.htm\">Next: HYMN LXXXV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08084.html",
  "api": "json/hymns/08084.json",
  "data": {
    "title": "HYMN LXXXIV. Indra.",
    "describe": "SONG-LOVER!",
    "feecting": "p:SONG-LOVER! like a charioteer come songs to thee when Soma flows.\np: O Indra, they have called to thee as mother-kine unto their calves.\r\np:Bright juices bitherward have sped thee, Indra, Lover of the Song. Drink, Indra, of this flowing sap: in every house &#146;tis set for thee.\np:Drink Soma to inspirit thee, juice, Indra, which the Falcon brought: For thou art King and Sovran Lord of all the families of men.\np:O Indra, hear Tirasci's call, the call of him who serveth thee. Satisfy him with wealth of kine and valiant offspring: Great art thou.\np:For he, O Indra, hath produced for thee the newest gladdening song, a hymn that springs from careful thought, ancient, and full of sacred truth.\np:That Indra will we laud whom songs and hymns of praise have magnified. Striving to win, we celebrate his many deeds of hero might.\np:Come now and let us glorify pure Indra with pure S&#257;ma hymns. Let the pure milky draught delight him strengthened by pure songs of praise.\np:O Indra, come thou pure to us, with pure assistance, pure thyself. Pure, send thou riches down to us, and, meet for Soma, pure, be glad.\np:O Indra, pure, vouchsafe us wealth, and, pure, enrich the worshipper. Pure, thou dost strike the V&#7771;tras dead, and strivest, pure, to win the spoil.",
    "next": "08085",
    "previous": "08083",
    "book": "08"
  },
  "created": 1638556734565,
  "updated": 1638790698337
}