{
  "key": "08088",
  "title": "RigVeda Hymn 08088",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN LXXXVIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08088.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08087.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08089.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXVIII. Indra.</h3>  \n<p>1. O THUNDERER, zealous worshippers gave thee drink this time yesterday.<br> So, Indra, listen here to those who bring the laud: come near unto our dwellingplace.<br> 2 Lord of Bay Steeds, fair-helmed, rejoice thee: this we crave. Here the disposers wait on thee.<br> Thy loftiest glories claim our lauds beside the juice, O Indra, Lover of the Song.<br> 3 Turning, as &#146;twere, to meet the Sun, enjoy from Indra all good things.<br> When he who will be born is born with power we look to treasures as our heritage.<br> 4 Praise him who sends us wealth, whose bounties injure none: good are the gifts which Indra. grants.<br> He is not worth with one who satisfies his wish: he turns his mind to giving boons.<br> 5 Thou in thy battles, Indra, art subduer of all hostile bands.<br> Father art thou, aIl-conquering, cancelling the curse, thou victor of the vanquisher.<br> 6 The Earth and Heaven clung close to thy victorious might as to their calf two mother-cows.<br> When thou attackest V&#7771;tra all the hostile bands shrink and faint, Indra, at thy wrath.<br> 7 Bring to your aid the Eternal One, who shoots and none may shoot at him,<br> Inciter, swift, victorious, best of Charioteers. Tugrya's unvanquished Strengthener;<br> 8 Arranger of things unarranged, e&#146;en &#346;atakratu, source of might,<br> Indra, the Friend of all, for succour we invoke, Guardian of treasure, sendjng wealth.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08089.htm\">Next: HYMN LXXXIX Indra. V&#257;k.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08088.html",
  "api": "json/hymns/08088.json",
  "data": {
    "key": "08088",
    "title": "HYMN LXXXVIII. Indra.",
    "describe": "O THUNDERER, zealous worshippers gave thee drink this time yesterday.",
    "feecting": "p:O THUNDERER, zealous worshippers gave thee drink this time yesterday.\np: So, Indra, listen here to those who bring the laud: come near unto our dwellingplace.\r\np:Lord of Bay Steeds, fair-helmed, rejoice thee: this we crave. Here the disposers wait on thee. Thy loftiest glories claim our lauds beside the juice, O Indra, Lover of the Song.\np:Turning, as ’twere, to meet the Sun, enjoy from Indra all good things. When he who will be born is born with power we look to treasures as our heritage.\np:Praise him who sends us wealth, whose bounties injure none: good are the gifts which Indra. grants. He is not worth with one who satisfies his wish: he turns his mind to giving boons.\np:Thou in thy battles, Indra, art subduer of all hostile bands. Father art thou, aIl-conquering, cancelling the curse, thou victor of the vanquisher.\np:The Earth and Heaven clung close to thy victorious might as to their calf two mother-cows. When thou attackest Vṛtra all the hostile bands shrink and faint, Indra, at thy wrath.\np:Bring to your aid the Eternal One, who shoots and non. May shoot at him, inciter, swift, victorious, best of Charioteers. Tugrya's unvanquished Strengthener;\np:Arranger of things unarranged, e’en Śatakratu, source of might, Indra, the Friend of all, for assist we invoke, Guardian of treasure, sendjng wealth.",
    "meta": {
      "next": "08089",
      "previous": "08087",
      "book": "08",
      "original": "https://sacred-texts.com/hin/rigveda/rv08088.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv08088.htm"
    },
    "deities": [
      {
        "name": "O THUNDERER",
        "hymns": [
          {
            "key": "08088",
            "title": "HYMN LXXXVIII. Indra."
          }
        ]
      },
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "08088",
            "title": "HYMN LXXXVIII. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638556755951,
  "updated": 1667450404353
}