{
  "key": "08092",
  "title": "RigVeda Hymn 08092",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 8: HYMN XCII. Agni</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv08092.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi08.htm\">Rig-Veda, Book 8 Index</A><BR>\n&nbsp;\n<A HREF=\"rv08091.htm\">Previous</A>&nbsp;\n<A HREF=\"rv08093.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCII. Agni</h3>  \n<p>1. THAT noblest Furtherer hath appeared, to whom men bring their holy works.<br> Our songs of praise have risen aloft to Agni who was barn to give the &#256;rya strength.<br> 2 Agni of Divod&#257;sa turned, as &#146;twere in majesty, to the Gods.<br> Onward he sped along the mother earth, and took his station in the height of heaven.<br> 3 Him before whom the people shrink when he performs his glorious deeds,<br> Him who wins thousands at the worship of the Gods, himself, that Agni, serve with son s.<br> 4 The mortal man whom thou wouldst lead to opulence, O Vasu, he who brings thee gifts.<br> He, Agni, wins himself a hero singing lauds, yea, one who feeds a thousand men.<br> 5 He with the steed wins spoil even in the fenced fort, and gains imperishable fame.<br> In thee, O Lord of wealth, continually we lay all precious offerings to the Gods.<br> 6 To him who dealeth out all wealth, who is the cheerful Priest of men,<br> To him, like the first vessels filled with savoury juice, to Agni go the songs of praise.<br> 7 Votaries, richly-gifted, deck him with their songs, even as the steed who draws the car.<br> On both, Strong Lord of men! on child and grandson pour the bounties which our nobles give.<br> 8 Sing forth to him, the Holy, most munificent, sublime with his refulgent glow,<br> To Agni, ye Upastutas.<br> 9 Worshipped with gifts, enkindled, splendid, Maghavan shall win himself heroic fame.<br> And will not his most newly shown benevolence come to us with abundant strength?<br> 10 Priest, presser of the juice! praise now the dearest Guest of all our friends,<br> Agni, the driver of the cars.<br> 11 Who, finder-out of treasures open and concealed, bringeth them hither, Holy One;<br> Whose waves, as in a cataract, are hard to pass, when he, through song, would win him strength.<br> 12 Let not the noble Guest, Agni, be wroth with us: by many a man his praise is sung,<br> Good Herald, skilled in sacrifice.<br> 13 O Vasu, Agni, let not them be harmed who come in any way with lauds to thee.<br> Even the lowly, skilled in rites, with offered gifts, seeketh thee for the envoy's task.<br> 14 Friend of the Maruts, Agni, come with Rudras to the Soma-draught,<br> To Sobhar's fair song of praise, and be thou joyful in the light.<br> VALAKHILYA</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv08093.htm\">Next: HYMN I. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/08092.html",
  "api": "json/hymns/08092.json",
  "data": {
    "title": "HYMN XCII. Agni",
    "describe": "THAT noblest Furtherer hath appeared, to whom men bring their holy works.",
    "feecting": "p:THAT noblest Furtherer hath appeared, to whom men bring their holy works.\np: Our songs of praise have risen aloft to Agni who was barn to give the &#256;rya strength.\r\np:Agni of Divod&#257;sa turned, as &#146;twere in majesty, to the Devas. Onward he sped along the mother Earth, and took his station in the height of Heaven.\np:Him before whom the people shrink when he performs his glorious deeds, him who wins thousands at the worship of the Devas, himself, that Agni, serve with son s.\np:The mortal man whom thou wouldst lead to opulence, O Vasu, he who brings thee gifts. He, Agni, wins himself a hero singing lauds, yea, one who feeds a thousand men.\np:He with the steed wins spoil even in the fenced fort, and gains imperishable fame. In thee, O Lord of wealth, continually we lay all precious offerings to the Devas.\np:To him who dealeth out all wealth, who is the cheerful Monk of men, to him, like the first vessels filled with savoury juice, to Agni go the songs of praise.\np:Votaries, richly-gifted, deck him with their songs, even as the steed who draws the car. On both, Strong Lord of men! on child and grandson pour the bounties which our nobles give.\np:Sing forth to him, the Holy, most munificent, sublime with his refulgent glow, to Agni, ye Upastutas.\np:Worshipped with gifts, enkindled, splendid, Indra shall win himself heroic fame. And will not his most newly shown benevolence come to us with abundant strength?\np:Monk, presser of the juice! praise now the dearest Guest of all our friends, Agni, the driver of the cars.\np:Who, finder-out of treasures open and concealed, bringeth them hither, Holy One. Whose waves, as in a cataract, are hard to pass, when he, through song, would win him strength.\np:Let not the noble Guest, Agni, be wroth with us: by many a man his praise is sung, Good Herald, skilled in offering.\np:O Vasu, Agni, let not them be harmed who come in any way with lauds to thee. Even the lowly, skilled in rites, with offered gifts, seeketh thee for the envoy's task.\np:Friend of the Devas, Agni, come with Somas to the Soma-draught, to Sobhar's fair song of praise, and be thou joyful in the light. VALAKHILYA",
    "next": "08093",
    "previous": "08091",
    "book": "08"
  },
  "created": 1638556777005,
  "updated": 1638791780981
}