{
  "key": "09063",
  "title": "RigVeda Hymn 09063",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN LXIII. Soma Pavanana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09063.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09062.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09064.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXIII. Soma Pavanana.</h3>  \n<p>1. POUR hitherward, O Soma, wealth in thousands and heroic strength,<br> And keep renown secure for us.<br> 2 Thou makest food and vigour swell for Indra, best of gladdeners!<br> Within the cups thou seatest thee.<br> 3 For Indra and for Vi&#7779;&#7751;u poured, Soma hath flowed into the jar:<br> May V&#257;yu find it rich in sweets.<br> 4 These Somas swift and brown of hue, in stream of solemn sacrifice<br> Have flowed through twisted obstacles,<br> 5 Performing every noble work, active, augmenting Indra's strength,<br> Driving away the godless ones.<br> 6 Brown Soma-drops, effused that seek Indra, to their appropriate place<br> Flow through the region hitherward.<br> 7 Flow onward with that stream of thine wherewith thou gavest S&#363;rya light,<br> Urging on waters good to men.<br> 8 He, Pavamana, high o&#146;er man yoked the Sun's courser Eta&#347;a<br> To travel through the realm of air.<br> 9 And those ten Coursers, tawny-hued, he harnessed that the Sun might come<br> Indu, he said, is Indra's self.<br> 10 Hence, singers, pour the gladdeningjuice to V&#257;yu and to Indra, pour<br> The drops upon the fleecy cloth.<br> 11 O Soma Pavamana, find wealth for us not to be assailed,<br> Wealth which the foeman may not win.<br> 12 Send riches hither with thy stream in thousands, both of steeds and kine,<br> Send spoil of war and high renown.<br> 13 Soma the God, expressed with stones, like S&#363;rya, floweth on his way,<br> Pouring the juice within the jar.<br> 14 These brilliant drops have poured for us, in stream of solemn sacrifice,<br> Worshipful laws and strength in kine.<br> 15 Over the cleansing sieve have flowed the Somas, blent with curdled milk,<br> Effused for Indra Thunder-armed.<br> 16 Soma, do thou most rich in sweets, a gladdening drink most dear to Gods,<br> Flow to the sieve to bring us wealth.<br> 17 For Indra, living men adorn the Tawny Courser in the streams, Indu, the giver of delight.<br> 18 Pour for us, Soma, wealth in gold, in horses and heroic sons,<br> Bring hither strength in herds of kine.<br> 19 For Indra pour ye on the fleece him very sweet to taste, who longs.<br> For battle as it were in war.<br> 20 The singers, seeking help, adorn the Sage who must be decked with songs:<br> Loud bellowing the Steer comes on,<br> 21 The singers with their thoughts and hymns have, in the stream of sacrifice,<br> Caused Soma, active Steer, to roar.<br> 22 God, working with mankind, flow on; to Indra go thy gladdening juice:<br> To V&#257;yu mount as Law commands<br> 23 O Soma, Pavamana, thou pourest out wealth that brings renown:<br> Enter the lake, as one we love.<br> 24 Soma thou flowest chasing foes and bringing wisdom and delight:<br> Drive off the folk who love not Gods.<br> 25 The Pavamanas have been poured, the brilliant drops of Soma juice,<br> For holy lore of every kind.<br> 26 The Pavamanas have been shed, the beautiful swift Soma-drops,<br> Driving all enemies afar.<br> 27 From, heaven, from out the firmament, hath Pavamana been effused<br> Upon the summit of the earth.<br> 28 O Soma, Indu, very wise, drive, being purified, with thy stream<br> All foes, all R&#257;k&#7779;asas away.<br> 29 Driving the R&#257;k&#7779;asas afar, O Soma, bellowing, pour for us<br> Most excellent and splendid strength.<br> 30 Soma, do thou secure for us the treasures of the earih and heaven,<br> Indu, all boons to be desired.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09064.htm\">Next: HYMN LXIV. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09063.html",
  "api": "json/hymns/09063.json",
  "data": {
    "key": "09063",
    "title": "HYMN LXIII. Indu.",
    "describe": "POUR hitherward, O Indu, wealth in thousands and heroic strength, and keep renown secure for us.",
    "feecting": "p:POUR hitherward, O Indu, wealth in thousands and heroic strength, and keep renown secure for us.\np:Thou makest food and vigour swell for Indra, best of gladdeners! Within the cups thou seatest thee.\np:For Indra and for Indra poured, indu hath flowed.\np:, in stream of solemn offering Have flowed through twisted obstacles,\np:Performing every noble work, active, augmenting Indra's strength, Driving away the godless ones.\np:Brown Soma-drops, effused that seek Indra, to their appropriate place Flow through the region hitherward.\np:Flow onward with that stream of thine wherewith thou gavest Sūrya light, Urging on waters good to men.\np:He, indu, high o’er man yoked the Sun's courser Etaśa To travel through the realm of air.\np:And those ten Coursers, tawny-hued, he harnessed that the Sun might come Indu, he said, is Indra's self.\np:Hence, singers, pour the gladdeningjuice to Soma and to Indra, pour The drops upon the fleecy cloth.\np:O Indu, find wealth for us not to be assailed, Wealth which the foema. May not win.\np:Send riches hither with thy stream in thousands, both of steeds and kine, Send spoil of war and high renown.\np:Soma the Deva, expressed with stones, like Sūrya, floweth on his way, Pouring the juice within the jar.\np:These brilliant drops have poured for us, in stream of solemn offering, worshipful laws and strength in kine.\np:Over the cleansing sieve have flowed the Somas, blent with curdled milk, Effused for Indra Thunder-armed.\np:Soma, do thou most rich in sweets, a gladdening drink most dear to Devas, Flow to the sieve to bring us wealth.\np:For Indra, living men adorn the Tawny Courser in the streams, indu, the giver of delight.\np:Pour for us, Soma, wealth in gold, in horses and heroic sons, Bring hither strength in herds of kine.\np:For Indra pour ye on the fleece him very sweet to taste, who longs.\np: For battle as it were in war.\r\np:The singers, seeking help, adorn the Sage who must be decked with songs: Loud bellowing the Steer comes on,\np:The singers with their thoughts and hymns have, in the stream of offering, Caused Soma, active Steer, to roar.\np:Deva, working with mankind, flow on; to Indra go thy gladdening juice: To Soma mount as Law commands\np:O Indu, thou pourest out wealth that brings renown: Enter the lake, as one we love.\np:Indu flowsbringing wisdom and delightBring the folk who love the Devas.\np:The Indus have been poured for holy lore of every kind.\np:The Indus have been shed, driving all enemies afar.\np:From Heaven, from out the Firmament, hath Indu been effused upon the summit of the Earth.\np:O Indu, very wise, drive, being purified, with thy stream all foes, all Rākṣasas away.\np:O Indu, pour for us most excellent and splendid strength.\np:Soma, do thou secure for us the treasures of the earih and Heaven, indu, all boons to be desired.",
    "meta": {
      "next": "09064",
      "previous": "09062",
      "book": "09",
      "source": "https://sacred-texts.com/hin/rigveda/rv09063.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv09063.htm"
    },
    "deities": [
      {
        "name": "O Indu",
        "hymns": [
          {
            "key": "09063",
            "title": "HYMN LXIII. Indu."
          },
          {
            "key": "09063",
            "title": "HYMN LXIII. Indu."
          },
          {
            "key": "09063",
            "title": "HYMN LXIII. Indu."
          },
          {
            "key": "09063",
            "title": "HYMN LXIII. Indu."
          },
          {
            "key": "09063",
            "title": "HYMN LXIII. Indu."
          }
        ]
      }
    ]
  },
  "created": 1638557167109,
  "updated": 1638830292881
}