{
  "key": "09062",
  "title": "RigVeda Hymn 09062",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN LXII. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09062.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09061.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09063.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXII. Soma Pavamana.</h3>  \n<p>1. THESE rapid Soma-drops have been poured through the purifying sieve<br> To bring us all felicities.<br> 2 Dispelling manifold mishap, giving the courser's progeny,<br> Yea, and the warrior steed, success.<br> 3 Bringing prosperity to kine, they make perpetual I&#7735;&#257; flow<br> To us for noble eulogy.<br> 4 Strong, mountain-born, the stalk hath been<br> pressed in the streams for rapturous joy:<br> Hawk-like he settles in his home.<br> 5 Fair is the God-loved juice; the plant is washed in waters, pressed by men<br> The milch-kine sweeten it with milk.<br> 6 As drivers deck a courser, so have they adorned the meath's juice for<br> Ambrosia, for the festival.<br> 7 Thou, Indu, with thy streams that drop sweet juices, which were poured for<br> help,<br> Hast settled in the cleansing sieve.<br> 8 So flow thou onward through the fleece, for Indra flow, to be his drink,<br> Finding thine home in vats of wood.<br> 9 As giving room and freedom, as most sweet, pour butter forth and milk,<br> O Indu, for the A&#7749;girases.<br> 10 Most active and benevolent, this Pavamana, sent to us<br> For lofty friendship, meditates.<br> 11 Queller of curses, mighty, with strong sway, this Pavamana shall<br> Bring treasures to the worshipper.<br> 12 Pour thou upon us thousandfold possessions, both of kine and steeds,<br> Exceeding glorious, much-desired.<br> 13 Wandering far, with wise designs, the juice here present is effused,<br> Made beautiful by living men.<br> 14 For Indra flows the gladdening drink, the measurer of the region, Sage,<br> With countless wealth and endless help.<br> 15 Born on the inountain, lauded here, Indu for Indra is set down,<br> As in her sheltering nest a bird.<br> 16 Pressed by the men, as &#146;twere to war hath Soma Pavamana sped,<br> To test with might within the vats.<br> 17 That he may move, they yoke him to the three-backed triple-seated car<br> By the Seven &#7770;&#7779;is&#146; holy songs.<br> 18 Drive ye that Tawny Courser, O ye pressers, on his way to war,<br> Swift Steed who carries off the spoil.<br> 19 Pouring all glories hither, he, effused and entering the jar,<br> Stands like a hero mid the kine.<br> 20 Indu, the living men milk out the juice to make the rapturous draught:<br> Gods for the Gods milk out the meath.<br> 21 Pour for the Gods into the sieve our Soma very rich in sweets,<br> Him whom the Gods most gladly hear.<br> 22 Into his stream who gladdens best these Soma juices have been poured,<br> Lauded with songs for lofty fame.<br> 23 Thou flowest to enjoy the milk, and bringest valour, being cleansed:<br> Winning the spoil flow hitherward.<br> 24 And, hymned by Jamadagnis, let all nourishment that kine supply,<br> And general praises, flow to us.<br> 25 Soma, as leader of the song flow onward with thy wondrous aids,<br> For holy lore of every kind.<br> 26 Do thou as leader of the song, stirring the waters of the sea,<br> Flow onward, thou who movest all.<br> 27 O Soma, O thou Sage, these worlds stand ready to attest thy might:<br> For thy behoof the rivers flow.<br> 28 Like showers of rain that fall from heaven thy streams perpetually flow<br> To the bright fleece spread under them.<br> 29 For potent Indra purify Indu effectual and strong,<br> Enjoyment-giver, Mighty Lord.<br> 30 Soma, true, Pavamana, Sage, is seated in the cleansing sieve,<br> Giving his praiser hero strength.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09063.htm\">Next: HYMN LXIII. Soma Pavanana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09062.html",
  "api": "json/hymns/09062.json",
  "data": {
    "title": "HYMN LXII. Indu.",
    "describe": "THESE rapid Soma-drops have been poured through the purifying sieve To bring us all felicities.",
    "feecting": "p:THESE rapid Soma-drops have been poured through the purifying sieve To bring us all felicities.\np:Dispelling manifold mishap, giving the courser's progeny, Yea, and the warrior steed, success.\np:Bringing prosperity to kine, they make perpetual I&#7735;&#257; flow To us for noble eulogy.\np:Strong, mountain-born, the stalk hath been pressed in the streams for rapturous joy: Hawk-like he settles in his home.\np:Fair is the Deva-loved juice; the plant is washed in waters, pressed by men The milch-kine sweeten it with milk.\np:As drivers deck a courser, so have they adorned the meath's juice for Ambrosia, for the festival.\np:Thou, indu, with thy streams that drop sweet juices, which were poured for help, Hast settled in the cleansing sieve.\np:So flow thou onward through the fleece, for Indra flow, to be his drink, Finding thine home in vats of wood.\np:As giving room and freedom, as most sweet, pour butter forth and milk, O Indu, for the A&#7749;girases.\np:Most active and benevolent, this Indu, sent to us For lofty friendship, meditates.\np:Queller of curses, mighty, with strong sway, this Indu shall Bring treasures to the worshipper.\np:Pour thou upon us thousandfold possessions, both of kine and steeds, Exceeding glorious, much-desired.\np:Wandering far, with wise designs, the juice here present is effused, Made beautiful by living men.\np:For Indra flows the gladdening drink, the measurer of the region, Sage, with countless wealth and endless help.\np:Born on the inountain, lauded here, indu for Indra is set down, as in her sheltering nest a bird.\np:Pressed by the men, as &#146;twere to war hath Indu sped, to test with might within the vats.\np:That h. May move, they yoke him to the three-backed triple-seated car By the Seven &#7770;&#7779;is&#146; holy songs.\np:Drive ye that Tawny Courser, O ye pressers, on his way to war, Swift Steed who carries off the spoil.\np:Pouring all glories hither, he, effused and entering the jar, Stands like a hero mid the kine.\np:Indu, the living men milk out the juice to make the rapturous draught: Devas for the Devas milk out the meath.\np:Pour for the Devas into the sieve our Soma very rich in sweets, him whom the Devas most gladly hear.\np:Into his stream who gladdens best these Soma juices have been poured, Lauded with songs for lofty fame.\np:Thou flowest to enjoy the milk, and bringest valour, being cleansed: Winning the spoil flow hitherward.\np:And, hymned by Jamadagnis, let all nourishment that kine supply, and general praises, flow to us.\np:Soma, as leader of the song flow onward with thy wondrous aids, for holy lore of every kind.\np:Do thou as leader of the song, stirring the waters of the sea, Flow onward, thou who movest all.\np:O Soma, O thou Sage, these worlds stand ready to attest thy might: For thy behoof the rivers flow.\np:Like showers of rain that fall from Heaven thy streams perpetually flow To the bright fleece spread under them.\np:For potent Indra purify Indu effectual and strong, Enjoyment-giver, Mighty Lord.\np:Soma, true, indu, Sage, is seated in the cleansing sieve, giving his praiser hero strength.",
    "next": "09063",
    "previous": "09061",
    "book": "09"
  },
  "created": 1638557161856,
  "updated": 1638791592014
}