{
  "key": "09071",
  "title": "RigVeda Hymn 09071",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN LXXI. Soma Pavamana,</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09071.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09070.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09072.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXI. Soma Pavamana,</h3>  \n<p>1. THE guerdon is bestowed: the Mighty takes his Seat, and, ever-Watchful, guards from fiend and evil sprite.<br> Gold-hued, he makes the cloud his diadem, the milk his carpet in both worlds, and prayer his robe of state.<br> 2 Strong, bellowing, he goes, like one who slays the folk; he lets this hue of Asuras flow off from him,<br> Throws off his covering, seeks his father's meeting-place, and thus makes for himself the bright robe he assumes.<br> 3 Onward he flows, from both the hands, pressed out with stones: excited by the prayer, the water makes him wild.<br> He frolics and draws near, completes his work with song, and bathes in streams to satisfy the worshipper.<br> 4 They pour out meath around the Master of the house, Celestial Strengthener of the mountain that gives might;<br> In whom, through his great powers, oblation-eating cows in their uplifted udder mix their choicest milk.<br> 5 They, the ten sisters, on the lap of Aditi, have sent him forward like a car from both the arms.<br> He wanders and comes near the Cow's mysterious place, even the place which his inventions have produced.<br> 6 Like as a falcon to his home, so speeds the God to his own golden wisely-tashioned place to rest.<br> With song they urge the darling to the sacred grass: the Holy One goes like a courser to the Gods.<br> 7 From far away, from heaven, the redhued noted Sage, Steer of the triple height, hath sung unto the kine.<br> With thousand guidings he, leading this way and that, shines, as a singer, splendidly through many a morn.<br> 8 His covering assumes a radiant hue; where&#146;er he comes into the fight he drives the foe afar.<br> The Winner of the Floods, with food he seeks the host of heaven, he comes to praises glorified with milk.<br> 9 Like a bull roaming round the herds he bellows: he hath assumed the brilliancy of S&#363;rya.<br> Down to the earth hath looked the heavenly Falcon: Soma with wisdom views all living creatures.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09072.htm\">Next: HYMN LXXII. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09071.html",
  "api": "json/hymns/09071.json",
  "data": {
    "key": "09071",
    "title": "HYMN LXXI. Indu,",
    "describe": "THE guerdon is bestowed: the Mighty takes his Seat, and, ever-Watchful, guards from fiend and evil sprite.",
    "feecting": "p:THE guerdon is bestowed: the Mighty takes his Seat, and, ever-Watchful, guards from fiend and evil sprite.\np: Gold-hued, he makes the cloud his diadem, the milk his carpet in both worlds, and prayer his robe of state.\r\np:Strong, bellowing, he goes, like one who subdues the folk; he lets this hue of Devass flow off from him, Throws off his covering, seeks his father's meeting-place, and thus makes for himself the bright robe he assumes.\np:Onward he flows, from both the hands, pressed out with stones: excited by the prayer, the water makes him wild. He frolics and draws near, completes his work with song, and bathes in streams to satisfy the worshipper.\np:They pour out meath around the Master of the house, Celestial Strengthener of the mountain that gives might; In whom, through his great powers, oblation-eating cows in their uplifted udder mix their choicest milk.\np:They, the ten sisters, on the lap of Aditi, have sent him forward like a car from both the arms. He wanders and comes near the Cow's mysterious place, even the place which his inventions have produced.\np:Like as a falcon to his home, so speeds the Deva to his own golden wisely-tashioned place to rest. With song they urge the darling to the sacred grass: the Holy One goes like a courser to the Devas.\np:From far away, from Heaven, the redhued noted Sage, Steer of the triple height, hath sung unto the kine. With thousand guidings he, leading this way and that, shines, as a singer, splendidly through many a morn.\np:His covering assumes a radiant hue; where’er he comes into the fight he drives the foe afar. The Winner of the Floods, with food he seeks the host of Heaven, he comes to praises glorified with milk.\np:Like a bull roaming round the herds he bellows: he hath assumed the brilliancy of Sūrya. Down to the Earth hath looked the heavenly Falcon: Soma with wisdom views all living creatures.",
    "meta": {
      "next": "09072",
      "previous": "09070",
      "book": "09",
      "source": "https://sacred-texts.com/hin/rigveda/rv09071.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv09071.htm"
    },
    "deities": []
  },
  "created": 1638557209178,
  "updated": 1638830292899
}