{
  "key": "09074",
  "title": "RigVeda Hymn 09074",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN LXXIV. Soma Pavamana</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09074.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09073.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09075.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXIV. Soma Pavamana</h3>  \n<p>1. BORN like a youngling he hath clamoured in the wood, when he, the Red, the Strong, would win the light of heaven.<br> He comes with heavenly seed that makes the water swell: him for wide-spreading shelter we implore with prayer.<br> 2 A far-extended pillar that supports the sky the Soma-stalk, filled full, moves itself every way.<br> He shall bring both these great worlds while the rite proceeds: the Sage holds these who move! together and all food.<br> 3 Wide space hath he who follows Aditi's right path, and mighty, well-made food, meath blent with Soma juice;<br> He who from hence commands the rain, Steer of the kine, Leader of floods, who helps us hence, who claims our laud.<br> 4 Butter and milk are drawn from animated cloud; thence Am&#7771;ta is produced, centre of sacrifice.<br> Hini the Most Bounteous Ones, ever united, love; him as ouir Friend the Men who make all swell rain down.<br> 5 The Soma-stalk hath roared, following with the wave: he swells with sap for man the skin which Gods enjoy.<br> Upon the lap of Aditi he lays the germ, by means whereof we gain children and progeny.<br> 6 In the third region which distils a thousand streams, may the Exhaustless Ones descend with procreant power.<br> The kindred Four have been sent downward from the heavens: dropping with oil they bring Am&#7771;ta and sacred gifts.<br> 7 Soma assumes white colour when he strives to gain: the bounteous Asura knows full many a precious boon.<br> Down the steep slope, through song, he comes to sacrifice, and he will burst the water-holding cask of heaven,<br> 8 Yea, to the shining milk-anointed beaker, as to his goal, hath stepped the conquering Courser.<br> Pious-souled men have sent their giffi of cattle unto Kak&#7779;&#299;v&#257;n of the hundred winters.<br> 9 Soma, thy juice when thou art blended with the streams, flows, Pavamana, through the long wool of the sheep.<br> So, cleansed by sages. O best giver of delight, grow sweet for Indra, Pavamana! for his drink.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09075.htm\">Next: HYMN LXXV. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09074.html",
  "api": "json/hymns/09074.json",
  "data": {
    "title": "HYMN LXXIV. Indu",
    "describe": "BORN like a youngling he hath clamoured in the wood, when he, the Red, the Strong, would win the light of Heaven.",
    "feecting": "p:BORN like a youngling he hath clamoured in the wood, when he, the Red, the Strong, would win the light of Heaven.\np: He comes with heavenly seed that makes the water swell: him for wide-spreading shelter we implore with prayer.\r\np:A far-extended pillar that supports the sky the Soma-stalk, filled full, moves itself every way. He shall bring both these great worlds while the rite proceeds: the Sage holds these who move! together and all food.\np:Wide space hath he who follows Aditi's right path, and mighty, well-made food, meath blent with Soma juice; He who from hence commands the rain, Steer of the kine, Leader of floods, who helps us hence, who claims our laud.\np:Butter and milk are drawn from animated cloud; thence Am&#7771;ta is produced, centre of offering. Hini the Most Bounteous Ones, ever united, love; him as ouir Friend the Men who make all swell rain down.\np:The Soma-stalk hath roared, following with the wave: he swells with sap for man the skin which Devas enjoy. Upon the lap of Aditi he lays the germ, by means whereof we gain children and progeny.\np:In the third region which distils a thousand streams. May the Exhaustless Ones descend with procreant power. The kindred Four have been sent downward from the heavens: dropping with oil they bring Am&#7771;ta and sacred gifts.\np:Soma assumes white colour when he strives to gain: the bounteous Devas knows full many a precious boon. Down the steep slope, through song, he comes to offering, and he will burst the water-holding cask of Heaven,\np:Yea, to the shining milk-anointed beaker, as to his goal, hath stepped the conquering Courser. Pious-souled men have sent their giffi of cattle unto Kak&#7779;&#299;v&#257;n of the hundred winters.\np:Soma, thy juice when thou art blended with the streams, flows, indu, through the long wool of the sheep. So, cleansed by sages. O best giver of delight, grow sweet for Indra, indu! for his drink.",
    "next": "09075",
    "previous": "09073",
    "book": "09"
  },
  "created": 1638557225166,
  "updated": 1638792008268
}