{
  "key": "09070",
  "title": "RigVeda Hymn 09070",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN LXX. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09070.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09069.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09071.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXX. Soma Pavamana.</h3>  \n<p>1. THE three times seven Milch-kine in the eastern heaven have for this Soma poured the genuine milky draught.<br> Four other beauteous Creatures hath he made for his adornment, when he waxed in strength through holy rites.<br> 2 Longing for lovely Am&#7771;ta, by his wisdom he divided, each apart from other, earth and heaven.<br> He gladly wrapped himself in the most lucid floods, when through their glory they found the God's resting-place.<br> 3 May those his brilliant rays he ever free from death, inviolate, for both classes of created things,&#151;<br> Rays wherewith powers of men and Gods are purified. Yea, even for this have sageswelcomed him as King.<br> 4 He, while he is adorned by the ten skilful ones, that he too in the Midmost Mothers may create,<br> While he is watching o&#146;er the lovely Am&#7771;ta's ways, looks on both races as Beholder of mankind.<br> 5 He, while he is adorned to stream forth mighty strength, rejoices in his place between the earth and heaven.<br> The Steer dispels the evil-hearted with his might, aiming at offerings as an archer at the game.<br> 6 Beholding, as it were, Two Mother Cows, the Steer goes roaring on his way even as the Maruts roar.<br> Knowing Eternal Law, the earliest light of heaven, he, passing wise, was chosen out to tell it forth.<br> 7 The fearful Bull is bellowing with violent might, far-sighted, sharpening his yellowcoloured horns.<br> Soma assumes his seat in the well-fashioned place: the cowhide and the sheepskin are his ornament.<br> 8 Bright, making pure his body free from spot and stain, on the sheep's back the Golden-coloured hath flowed down.<br> Acceptable to Mitra, V&#257;yu, Varu&#7751;a, he is prepared as threefold meal by skilful men.<br> 9 Flow on for the God's banquet, Soma, as a Steer, and enter Indra's heart, the Soma's reservoir.<br> Bear us beyond misfortune ere we be oppres. sed. the man who knows the land directs the man who asks.<br> 10 Urged like a car-steed flow to strength, O Soma: Indu, flow onward to the throat of Indra.<br> Skilled, bear us past, as in a boat o&#146;er water: as battling Hero save us from the foeman.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09071.htm\">Next: HYMN LXXI. Soma Pavamana,</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09070.html",
  "api": "json/hymns/09070.json",
  "data": {
    "title": "HYMN LXX. Indu.",
    "describe": "THE three times seven Milch-kine in the eastern Heaven have for this Soma poured the genuine milky draught.",
    "feecting": "p:THE three times seven Milch-kine in the eastern Heaven have for this Soma poured the genuine milky draught.\np: Four other beauteous Creatures hath he made for his adornment, when he waxed in strength through holy rites.\r\np:Longing for lovely Am&#7771;ta, by his wisdom he divided, each apart from other, Earth and Heaven. He gladly wrapped himself in the most lucid floods, when through their glory they found the Deva's resting-place.\np:May those his brilliant rays he ever free from death, inviolate, for both classes of created things,&#151; Rays wherewith powers of men and Devas are purified. Yea, even for this have sageswelcomed him as King.\np:He, while he is adorned by the ten skilful ones, that he too in the Midmost Mother. May create, While he is watching o&#146;er the lovely Am&#7771;ta's ways, looks on both races as Beholder of mankind.\np:He, while he is adorned to stream forth mighty strength, rejoices in his place between the Earth and Heaven. The Steer dispels the evil-hearted with his might, aiming at offerings as an archer at the game.\np:Beholding, as it were, Two Mother Cows, the Steer goes roaring on his way even as the Devas roar. Knowing Eternal Law, the earliest light of Heaven, he, passing wise, was chosen out to tell it forth.\np:The fearful Bull is bellowing with violent might, far-sighted, sharpening his yellowcoloured horns. Soma assumes his seat in the well-fashioned place: the cowhide and the sheepskin are his ornament.\np:Bright, making pure his body free from spot and stain, on the sheep's back the Golden-coloured hath flowed down. Acceptable to Mitra, V&#257;yu, Varu&#7751;a, he is prepared as threefold meal by skilful men.\np:Flow on for the Deva's banquet, Soma, as a Steer, and enter Indra's heart, the Soma's reservoir. Bear us beyond misfortune ere we be oppres. sed. the man who knows the land directs the man who asks.\np:Urged like a car-steed flow to strength, O Soma: Indu, flow onward to the throat of Indra. Skilled, bear us past, as in a boat o&#146;er water: as battling Hero save us from the foeman.",
    "next": "09071",
    "previous": "09069",
    "book": "09"
  },
  "created": 1638557203920,
  "updated": 1638791781045
}