{
  "key": "09089",
  "title": "RigVeda Hymn 09089",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN LXXXIX. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09089.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09088.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09090.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXIX. Soma Pavamana.</h3>  \n<p>1. THIS Chariot-horse hath moved along the pathways, and Pavamana flowed like rain from heaven.<br> With us hath Soma with a thousand currents sunk in the wood, upon his Mother's bosom.<br> 2. King, he hath clothed him in the robe of rivers, mounted the straightest-going ship of Order.<br> Sped by the Hawk the drop hath waxed in waters: the father drains it, drains the Father's offspring.<br> 3 They come to him, red, tawny, Lord of Heaven, the watchful Guardian of the meath, the Lion.<br> First, Hero in the fight, he seeks the cattle, and with his eye the Steer is our protector.<br> 4 They harness to the broad-wheeled car the mighty Courser whose back bears meath, unwearied, awful.<br> The twins, the sisters brighten him, and strengthen-these children of one damethe vigorous Racer.<br> 5 Four pouring out the holy oil attend him, sitting together in the same container.<br> To him they flow, when purified, with homage, and still, from every side, are first about him.<br> 6 He is the buttress of the heavens, supporter of earth, and in his hand are all the people.<br> Be the team's Lord a well to thee the singer: cleansed is the sweet plant's stalk for deed of glory.<br> 7 Fighting, uninjured come where Gods are feasted; Soma, as Vitra-slayer flow for Indra.<br> Vouchsafe us ample riches very splendid may we be masters of heroic vigour.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09090.htm\">Next: HYMN XC. Soma Pavamana,</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09089.html",
  "api": "json/hymns/09089.json",
  "data": {
    "title": "HYMN LXXXIX. Indu.",
    "describe": "THIS Chariot-horse hath moved along the pathways, and Indu flowed like rain from Heaven.",
    "feecting": "p:THIS Chariot-horse hath moved along the pathways, and Indu flowed like rain from Heaven.\np: With us hath Soma with a thousand currents sunk in the wood, upon his Mother's bosom.\r\np:King, he hath clothed him in the robe of rivers, mounted the straightest-going ship of Order. Sped by the Hawk the drop hath waxed in waters: the father drains it, drains the Father's offspring.\np:They come to him, red, tawny, Lord of Heaven, the watchful Guardian of the meath, the Lion. First. Hero in the fight, he seeks the cattle, and with his eye the Steer is our protector.\np:They harness to the broad-wheeled car the mighty Courser whose back bears meath, unwearied, awful. The twins, the sisters brighten him, and strengthen-these children of one damethe vigorous Racer.\np:Four pouring out the holy oil attend him, sitting together in the same container. To him they flow, when purified, with homage, and still, from every side, are first about him.\np:He is the buttress of the heavens, supporter of Earth, and in his hand are all the people. Be the team's Lord a well to thee the singer: cleansed is the sweet plant's stalk for deed of glory.\np:Fighting, uninjured come where Devas are feasted; Soma, as Vitra-slayer flow for Indra. Vouchsafe us ample riches very splendi. May we be masters of heroic vigour.",
    "next": "09090",
    "previous": "09088",
    "book": "09"
  },
  "created": 1638557304111,
  "updated": 1638790698444
}