{
  "key": "09083",
  "title": "RigVeda Hymn 09083",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN LXXXIII. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09083.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09082.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09084.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXIII. Soma Pavamana.</h3>  \n<p>1. SPREAD is thy cleansing filter, Brahma&#7751;aspati: as Prince, thou enterest its limbs from every side.<br> The raw, whose mass hath not been heated gains not this: they only which are dressed, which bear, attain to it.<br> 2 High in the seat of heaven is spread the Scorcher's sieve: its threads are standing separate, glittering with light.<br> The Swift Ones favour him who purifieth this: with consciousness they stand upon the height of heaven.<br> 3 The foremost spotted Steer hath made the Mornings shine, and yearning after strength sustains all things that be.<br> By his high wisdom have the mighty Sages wrought: the Fathers who behold mankind laid down the germ,<br> 4 Gandharva verily protects his dwellingplace; Wondrous, he guards the generations of the Gods.<br> Lord of the snare, he takes the foeman with the snare: those who are most devout have gained a share of meath.<br> 5 Rich in oblations! robed in cloud, thou corapassest oblation, sacrifice, the mighty seat of Gods.<br> King, on thy chariot-sieve thou goest up to war, and with a thousand weapons winnest lofty fame.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09084.htm\">Next: HYMN LXXXIV. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09083.html",
  "api": "json/hymns/09083.json",
  "data": {
    "title": "HYMN LXXXIII. Indu.",
    "describe": "SPREAD is thy cleansing filter, Brahma&#7751;",
    "feecting": "p:SPREAD is thy cleansing filter, Brahma&#7751;aspati: as Prince, thou enterest its limbs from every side.\np: The raw, whose mass hath not been heated gains not this: they only which are dressed, which bear, attain to it.\r\np:High in the seat of Heaven is spread the Scorcher's sieve: its threads are standing separate, glittering with light. The Swift Ones favour him who purifieth this: with consciousness they stand upon the height of Heaven.\np:The foremost spotted Steer hath made the Mornings shine, and yearning after strength sustains all things that be. By his high wisdom have the mighty Sages wrought: the Fathers who behold mankind laid down the germ,\np:Gandharva verily protects his dwellingplace; Wondrous, he guards the generations of the Devas. Lord of the snare, he takes the foeman with the snare: those who are most devout have gained a share of meath.\np:Rich in oblations! robed in cloud, thou corapassest oblation, offering, the mighty seat of Devas. King, on thy chariot-sieve thou goest up to war, and with a thousand weapons winnest lofty fame.",
    "next": "09084",
    "previous": "09082",
    "book": "09"
  },
  "created": 1638557272532,
  "updated": 1638646519735
}