{
  "key": "09080",
  "title": "RigVeda Hymn 09080",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN LXXX. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09080.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09079.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09081.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXX. Soma Pavamana.</h3>  \n<p>1. ON flows the stream of Soma who beholds mankind: by everlasting Law he calls the Gods from heaven.<br> He lightens with the roaring of Br aspati: h the lakes have not contained the pourings of juice.<br> 2 Thou, powerful Soma, thou to whom the cows have -lowed, ascendest bright with sheen, thine iron-fashioned home.<br> Thou, lengthening our princes' life and high renown, flowest for Indra as his might to gladdening drink.<br> 3 Best giver of delight, he flows to Indra's throat, robing himself in might, Auspicious One, for fame.<br> He spreads himself abroad to meet all things that be: the vigorous Tawny Steed flows sporting on his way.<br> 4 The men, the ten swift fingers, milk thee out for Gods, even thee most rich in meath, with thousand flowing streams.<br> Soma who winnest thousands, driven by the men, expressed with stones, bring, as thou flowest, all the Gods.<br> 5 Deft-handed men with stones, the ten swift fingers, drain thee into waters, thee, the Steer enriched with sweets.<br> Thou, Soma, gladdening Indra, and the Heavenly Host, flowest as Pavamana like a river's wave.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09081.htm\">Next: HYMN LXXXI. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09080.html",
  "api": "json/hymns/09080.json",
  "data": {
    "key": "09080",
    "title": "HYMN LXXX. Indu.",
    "describe": "ON flows the stream of Soma who beholds mankind: by everlasting Law he calls the Devas from Heaven.",
    "feecting": "p:ON flows the stream of Soma who beholds mankind: by everlasting Law he calls the Devas from Heaven.\np: He lightens with the roaring of Br aspati: h the lakes have not contained the pourings of juice.\r\np:Thou, powerful Soma, thou to whom the cows have -lowed, ascendest bright with sheen, thine iron-fashioned home. Thou, lengthening our princes' life and high renown, flowest for Indra as his might to gladdening drink.\np:Best giver of delight, he flows to Indra's throat, robing himself in might, Auspicious One, for fame. He spreads himself abroad to meet all things that be: the vigorous Tawny Steed flows sporting on his way.\np:The men, the ten swift fingers, milk thee out for Devas, even thee most rich in meath, with thousand flowing streams. Soma who winnest thousands, driven by the men, expressed with stones, bring, as thou flowest, all the Devas.\np:Deft-handed men with stones, the ten swift fingers, drain thee into waters, thee, the Steer enriched with sweets. Thou, Soma, gladdening Indra, and the Heavenly Host, flowest as Indu like a river's wave.",
    "meta": {
      "next": "09081",
      "previous": "09079",
      "book": "09",
      "original": "https://sacred-texts.com/hin/rigveda/rv09080.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv09080.htm"
    },
    "deities": []
  },
  "created": 1638557256757,
  "updated": 1639023785310
}