{
  "key": "09085",
  "title": "RigVeda Hymn 09085",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN LXXXV. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09085.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09084.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09086.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXV. Soma Pavamana.</h3>  \n<p>1. FLOW on to Indra, Soma, carefully effused: let sickness stay afar together with the fiends.<br> Let not the double-tongued delight them with thy juice. here be thy flowing drops laden with opulence.<br> 2 O Pavamana, urge us forward in the fight thou art the vigour of the Gods, the well-loved drink.<br> Smite thou our enemies who raise the shout of joy: Indra, drink Soma juice, and drive away our foes.<br> 3 Unharmed, best Cheerer, thou, O Indu, flowest on: thou, even thou thyself, art Indra's noblest food.<br> Full many a wise man lifts to thee the song of praise, and hails thee with a kiss as Sovran of this world.<br> 4 Wondrous, with hundred streams, hymned in a thousand songs, Indu pours out for Indra his delightrul meath.<br> Winning us land and waters, flow thou hitherward: Rainer of bounties, Soma, make broad way for us.<br> 5 Roaring within the beaker thou art balmed with milk: thou passest through the fleecy filter all at once.<br> Carefully cleansed and decked like a prizewinning steed, O Soma, thou hast flowed down within Indra's throat.<br> 6 Flow onward sweet of flavour for the Heavenly Race, for Indra sweet, whose name is easily invoked:<br> Flow sweet for Mitra, Varu&#7751;a, and V&#257;yu, rich in meath, inviolable for B&#7771;haspati.<br> 7 Ten rapid fingers deck the Courser in the jar: with hymns the holy singers send their voices forth.<br> The filtering juices hasten to their eulogy, the drops that gladden find their way to Indra's heart.<br> 8 While thou art purified pour on us hero strength, great, far-extended shelter, spacious pasturage.<br> Let no oppression master this our holy work: may we, O Indu, gain all opulence through thee.<br> 9 The Steer who sees afar hath risen above the sky: the Sage hath caused the lights of heaven to give their shine.<br> The. King is passing through the filter with a roar: they drain the milk of heaven from him who looks on men.<br> 10 High in the vault of heaven, unceasing, honey-tongued, the Loving Ones drain out the mountain-haunting Steer,&#151;<br> The drop that hath grown great in waters, in the lake meath-rich, in the stream's wave and in the cleansing sieve.<br> 11 The Loving Ones besought with many voices the Eagle who had flown away to heaven.<br> Hymns kiss the Youngling worthy of laudation, resting on earth, the Bird of golden colour.<br> 12 High to heaven's vault hath the Gandharva risen, beholding all his varied forms and figures.<br> His ray hath shone abroad with gleaming splendour: pure, he hath lighted both the worlds, the Parents.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09086.htm\">Next: HYMN LXXXVI. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09085.html",
  "api": "hymns/09085json",
  "data": {
    "title": "HYMN LXXXV. Soma Pavamana.",
    "describe": "FLOW on to Indra, Soma, carefully effused: let sickness stay afar together with the fiends.",
    "feecting": "p:FLOW on to Indra, Soma, carefully effused: let sickness stay afar together with the fiends.\np: Let not the double-tongued delight them with thy juice. here be thy flowing drops laden with opulence.\r\np:O Pavamana, urge us forward in the fight thou art the vigour of the Devas, the well-loved drink. Smite thou our enemies who raise the shout of joy: Indra, drink Soma juice, and drive away our foes.\np:Unharmed, best Cheerer, thou, O Indu, flowest on: thou, even thou thyself, art Indra's noblest food. Full many a wise man lifts to thee the song of praise, and hails thee with a kiss as Sovran of this world.\np:Wondrous, with hundred streams, hymned in a thousand songs, Indu pours out for Indra his delightrul meath. Winning us land and waters, flow thou hitherward: Rainer of bounties, Soma, make broad way for us.\np:Roaring within the beaker thou art balmed with milk: thou passest through the fleecy filter all at once. Carefully cleansed and decked like a prizewinning steed, O Soma, thou hast flowed down within Indra's throat.\np:Flow onward sweet of flavour for the Heavenly Race, for Indra sweet, whose name is easily invoked: Flow sweet for Mitra, Indra, and Soma, rich in meath, inviolable for Soma.\np:Ten rapid fingers deck the Courser in the jar: with hymns the holy singers send their voices forth. The filtering juices hasten to their eulogy, the drops that gladden find their way to Indra's heart.\np:While thou art purified pour on us hero strength, great, far-extended shelter, spacious pasturage. Let no oppression master this our holy work. May we, O Indu, gain all opulence through thee.\np:The Steer who sees afar hath risen above the sky: the Sage hath caused the lights of Heaven to give their shine. The. King is passing through the filter with a roar: they drain the milk of Heaven from him who looks on men.\np:High in the vault of Heaven, unceasing, honey-tongued, the Loving Ones drain out the mountain-haunting Steer,— The drop that hath grown great in waters, in the lake meath-rich, in the stream's wave and in the cleansing sieve.\np:The Loving Ones besought with many voices the Eagle who had flown away to Heaven. Hymns kiss the Youngling worthy of laudation, resting on Earth, the Bird of golden colour.\np:High to Heaven's vault hath the Gandharva risen, beholding all his varied forms and figures. His ray hath shone abroad with gleaming splendour: pure, he hath lighted both the worlds, the Parents.",
    "next": "09086",
    "previous": "09084",
    "book": "09"
  },
  "created": 1638557283061
}