{
  "key": "09087",
  "title": "RigVeda Hymn 09087",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN LXXXVII. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09087.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09086.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09088.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXVII. Soma Pavamana.</h3>  \n<p>1. RUN onward to the reservoir and seat thee: cleansed by the men speed forward to the battle.<br> Making thee beauteous like an able courser, forth to the sacred grass with reins they lead thee.<br> 2 Indu, the well-armed God, is flowing onward, who quells the curse and guards from treacherous onslaught,<br> Father, begetter of the Gods, most skilful, the buttress of the heavens and earth's supporter.<br> 3. &#7770;&#7779;i and Sage, the Champion of the people, cleft and sagacious, U&#347;an&#257; in wisdom,<br> He hath discovered even their hidden nature, the Cows' concealed and most mysterious title.<br> 4 This thine own Soma rich in meath, O Indra, Steer for the Steer, hath flowed into the filter.<br> The strong Free-giver, winning hundreds, thousands, hath reached the holy grass that never fails him.<br> 5 These Somas are for wealth of countless cattle, renown therefor, and mighty strength immortal.<br> These have been sent forth, urified by strainers, like steeds who rusg to battle fain for glory.<br> 6 He, while he cleanses him, invoked of many, hath flowed to give the people all enjoyment.<br> Thou whom the Falcon brought, bring, dainty viands, bestir thyself and send us wealth and booty.<br> 7 This Soma, pressed into the cleansing filter, hath run as &#146;twere a host let loose, the Courser;<br> Like a strong bull who whets his horns kpen-pointed, like a brave warrior in the fray for cattle.<br> 8 He issued forth from out the loftiest mountain, and found kine hidden somewhere in a stable.<br> Soma's stream clears itself for thee, O Indra, like lightning thundering through the clouds of heaven,<br> 9 Cleansing thyselr, and borne along with Indra, Soma, thou goest round the herd of cattle.<br> May thy praise help us, Mighty One, prompt Giver, to the full ample food which thou bestowest.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09088.htm\">Next: HYMN LXXXVIII. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09087.html",
  "api": "json/hymns/09087.json",
  "data": {
    "key": "09087",
    "title": "HYMN LXXXVII. Indu.",
    "describe": "RUN onward to the reservoir and seat thee: cleansed by the men speed forward to the battle.",
    "feecting": "p:RUN onward to the reservoir and seat thee: cleansed by the men speed forward to the battle.\np: Making thee beauteous like an able courser, forth to the sacred grass with reins they lead thee.\r\np:Indu, the well-armed Deva, is flowing onward, who quells the curse and guards from treacherous onslaught, Father, begetter of the Devas, most skilful, the buttress of the heavens and Earth's supporter.\np:Ṛṣi and Sage, the Champion of the people, cleft and sagacious, Uśanā in wisdom. He hath discovered even their hidden nature, the Cows' concealed and most mysterious title.\np:This thine own Soma rich in meath, O Indra, Steer for the Steer, hath flowed into the filter. The strong Free-giver, winning hundreds, thousands, hath reached the holy grass that never fails him.\np:These Somas are for wealth of countless cattle, renown therefor, and mighty strength immortal. These have been sent forth, urified by strainers, like steeds who rusg to battle fain for glory.\np:He, while he cleanses him, invoked of many, hath flowed to give the people all enjoyment. Thou whom the Falcon brought, bring, dainty offerings, bestir thyself and send us wealth and booty.\np:This Soma, pressed into the cleansing filter, hath run as ’twere a host let loose, the Courser; Like a strong bull who whets his horns kpen-pointed, like a brave warrior in the fray for cattle.\np:He issued forth from out the loftiest mountain, and found kine hidden somewhere in a stable. Soma's stream clears itself for thee, O Indra, like lightning thundering through the clouds of Heaven,\np:Cleansing thyselr, and borne along with Indra, Soma, thou goest round the herd of cattle. May thy praise help us, Mighty One, prompt Giver, to the full ample food which thou bestowest.",
    "meta": {
      "next": "09088",
      "previous": "09086",
      "book": "09",
      "original": "https://sacred-texts.com/hin/rigveda/rv09087.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv09087.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "09087",
            "title": "HYMN LXXXVII. Indu."
          },
          {
            "key": "09087",
            "title": "HYMN LXXXVII. Indu."
          }
        ]
      }
    ]
  },
  "created": 1638557293605,
  "updated": 1639023785326
}