{
  "key": "09098",
  "title": "RigVeda Hymn 09098",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN XCVIII. Soma Pavamana</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09098.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09097.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09099.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCVIII. Soma Pavamana</h3>  \n<p>1. STREAM on us riches that are sought by many, best at winning strength<br> Riches, O Indu, thousandfold, glorious, conquering the great.<br> 2 Effused, he hath, as on a car, invested him in fleecy mail:<br> Onward hath Indu flowed in streams, impelled, surrounded by the wood.<br> 3 Effused, this Indu hath flowed on, distilling rapture, to the fleece:<br> He goes erect, as seeking kine in stream, with light, to sacrifice.<br> 4 For thou thyself, O Indu, God, to every mortal worshipper<br> Attractest riches thousandfold, made manifest in hundred forms.<br> 5 Good V&#7771;tra-slayer, may we be still nearest to this wealth of thine<br> Which many crave, nearest to food and happiness, Resistless One!<br> 6 Whom, bright with native splendour, crushed between the pair of pressingstones-<br> The wavy Friend whom Indra loves-the twice-five sisters dip and bathe,<br> 7 Him with the fleece they purify, brown, golden-hued, beloved of all,<br> Who with exhilarating juice goes forth to all the Deities.<br> 8 Through longing for this sap of yours ye drink what brings ability,<br> Even him who, dear as heaven's own light, gives to our princes high renown.<br> 9 Indu at holy rites produced you, Heaven and Earth, the Friends of men,<br> Hill-haunting God the Goddesses. They bruised him where the roar was loud.<br> 10 For V&#7771;tra-slaying Indra, thou, Soma, art poured that he may drink,<br> Poured for the guerdon-giving man, poured for the God who sitteth there.<br> 11 These ancient Somas, at the break of day, have flowed into the sieve,<br> Snorting away at early morn these foolish evil-hearted ones.<br> 12 Friends, may the princes, ye and we, obtain this Most Resplendent One.<br> Gain him who hath the smell of strength, win him whose home is very strength.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09099.htm\">Next: HYMN XCIX. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09098.html",
  "api": "json/hymns/09098.json",
  "data": {
    "key": "09098",
    "title": "HYMN XCVIII. Indu",
    "describe": "STREAM on us riches that are sought by many, best at winning strength Riches, O Indu, thousandfold, glorious, conquering the great.",
    "feecting": "p:STREAM on us riches that are sought by many, best at winning strength Riches, O Indu, thousandfold, glorious, conquering the great.\np:Effused, he hath, as on a car, invested him in fleecy mail: Onward hath Indu flowed in streams, impelled, surrounded by the wood.\np:Effused, this Indu hath flowed on, distilling rapture, to the fleece: He goes erect, as seeking kine in stream, with light, to offering.\np:For thou thyself, O Indu, Deva, to every mortal worshipper Attractest riches thousandfold, made manifest in hundred forms.\np:Good Vṛtra-slayer. May we be still nearest to this wealth of thine Which many crave, nearest to food and happiness, Resistless One!\np:Whom, bright with native splendour, crushed between the pair of pressingstones- The wavy Friend whom Indra loves-the twice-five sisters dip and bathe,\np:Him with the fleece they purify, brown, golden-hued, beloved of all, who with exhilarating juice goes forth to all the Deities.\np:Through longing for this sap of yours ye drink what brings ability, Even him who, dear as Heaven's own light, gives to our princes high renown.\np:Indu at holy rites produced you. Heaven and Earth, the Friends of men, Hill-haunting Deva the Goddesses. They bruised him where the roar was loud.\np:For Vṛtra-subduing Indra Soma, art poured that h. May drink, Poured for the guerdon-giving man, poured for the Deva who sitteth there.\np:These ancient Somas, at the break of day, have flowed into the sieve, Snorting away at early morn these foolish evil-hearted ones.\np:Friends. May the princes, ye and we, obtain this Most Resplendent One.\np: Gain him who hath the smell of strength, win him whose home is very strength.",
    "meta": {
      "next": "09099",
      "previous": "09097",
      "book": "09",
      "original": "https://sacred-texts.com/hin/rigveda/rv09098.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv09098.htm"
    },
    "deities": [
      {
        "name": "O Indu",
        "hymns": [
          {
            "key": "09098",
            "title": "HYMN XCVIII. Indu"
          },
          {
            "key": "09098",
            "title": "HYMN XCVIII. Indu"
          }
        ]
      }
    ]
  },
  "created": 1638557351943,
  "updated": 1667442753968
}