{
  "key": "09095",
  "title": "RigVeda Hymn 09095",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN XCV Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09095.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09094.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09096.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCV Soma Pavamana.</h3>  \n<p>1. Loud neighs the Tawny Steed when started, settling deep in the wooden vessel while they cleanse him.<br> Led by the men he takes the milk for raiment: then shall he, through his powers, engender praise-songs.<br> 2 As one who rows drives on his boat, he, Gold-hued, sends forth his voice, loosed on the path of Order.<br> As God, the secret names of Gods he utters, to be declared on sacred grass more widely.<br> 3 Hastening onward like the waves of waters, our holy hymns are pressing nigh to Soma.<br> To him they come with lowly adoration, and, longing, enter him who longs to meet them.<br> 4 They drain the stalk, the Steer who dwells on mountains, even as a Bull who decks him on the upland.<br> Hymns follow and attend him as he bellows: Trita bears Varu&#7751;a aloft in ocean.<br> 5 Sending thy voice out as Director, loosen the Invoker's thought, O Indu, as they cleanse thee.<br> While thou and Indra rule for our advantage, may we be masters of heroic vigour.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09096.htm\">Next: HYMN XCVI. Soma Pavamana</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09095.html",
  "api": "hymns/09095json",
  "data": {
    "title": "HYMN XCV Soma Pavamana.",
    "describe": "Loud neighs the Tawny Steed when started, settling deep in the wooden vessel while they cleanse him.",
    "feecting": "p:Loud neighs the Tawny Steed when started, settling deep in the wooden vessel while they cleanse him.\np: Led by the men he takes the milk for raiment: then shall he, through his powers, engender praise-songs.\r\np:As one who rows drives on his boat, he, Gold-hued, sends forth his voice, loosed on the path of Order. As Deva, the secret names of Devas he utters, to be declared on sacred grass more widely.\np:Hastening onward like the waves of waters, our holy hymns are pressing nigh to Soma. To him they come with lowly adoration, and, longing, enter him who longs to meet them.\np:They drain the stalk, the Steer who dwells on mountains, even as a Bull who decks him on the upland. Hymns follow and attend him as he bellows: Trita bears Indra aloft in ocean.\np:Sending thy voice out as Director, loosen the Invoker's thought, O Indu, as they cleanse thee. While thou and Indra rule for our advantage. May we be masters of heroic vigour.",
    "next": "09096",
    "previous": "09094",
    "book": "09"
  },
  "created": 1638557336162
}