{
  "key": "09091",
  "title": "RigVeda Hymn 09091",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN XCI. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09091.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09090.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09092.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCI. Soma Pavamana.</h3>  \n<p>1. As for a chariot-race, the skilful Speaker, Chief, Sage, Inventor, hath, with song, been started.<br> The sisters ten upon the fleecy summit drive on the Car-horse to the resting places.<br> 2 The drop of Soma, pressed by wise Nahusyas, becomes the banquet of the Heavenly People-<br> Indu, by hands of mortal men made beauteous, immortal, with the sheep and cows and waters.<br> 3 Steer roaring unto Steer, this Pavamana, this juice runs to the white milk of the milch-cow.<br> Through thousand fine hairs goes the tuneful Singer, like S&#363;ra by his fair and open pathways.<br> 4 Break down the, strong seats even of the demons: cleansing thee, Indu, robd thyself in vigour.<br> Rend with thy swift bolt, coming from above them, those who are near and those who yet are distant.<br> 5 Prepare the forward paths in ancient manner for the new bymn, thou Giver of all bounties.<br> Those which are high and hard for foes to conquer may we gain from thee, Active! Food-bestower!<br> 6 So purifying thee vouchsafe us waters, heaven's light, and cows, offipring and many children.<br> Give us health, ample land, and lights, O Soma, and grant us long to look upon the sunshine.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09092.htm\">Next: HYMN XCII. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09091.html",
  "api": "json/hymns/09091.json",
  "data": {
    "title": "HYMN XCI. Indu.",
    "describe": "As for a chariot-race, the skilful Speaker, Chief, Sage, Inventor, hath, with song, been started.",
    "feecting": "p:As for a chariot-race, the skilful Speaker, Chief, Sage, Inventor, hath, with song, been started.\np: The sisters ten upon the fleecy summit drive on the Car-horse to the resting places.\r\np:The drop of Soma, pressed by wise Nahusyas, becomes the banquet of the Heavenly People- Indu, by hands of mortal men made beauteous, immortal, with the sheep and cows and waters.\np:Steer roaring unto Steer, this Pavamana, this juice runs to the white milk of the milch-cow. Through thousand fine hairs goes the tuneful Singer, like S&#363;ra by his fair and open pathways.\np:Break down the, strong seats even of the demons: cleansing thee, Indu, robd thyself in vigour. Rend with thy swift bolt, coming from above them, those who are near and those who yet are distant.\np:Prepare the forward paths in ancient manner for the new bymn, thou Giver of all bounties. Those which are high and hard for foes to conque. May we gain from thee, Active! Food-bestower!\np:So purifying thee vouchsafe us waters. Heaven's light, and cows, offipring and many children. Give us health, ample land, and lights, O Soma, and grant us long to look upon the sunshine.",
    "next": "09092",
    "previous": "09090",
    "book": "09"
  },
  "created": 1638557314940,
  "updated": 1638647790861
}