{
  "key": "09099",
  "title": "RigVeda Hymn 09099",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN XCIX. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09099.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09098.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09100.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCIX. Soma Pavamana.</h3>  \n<p>1. THEY for the Bold and Lovely One ply manly vigour like a bow:<br> joyous, in front of songs they weave bright raiment for the Lord Divine.<br> 2 And he, made beautiful by night, dips forward into strengthening food',<br> What time the sacrificer's thoughts speed on his way the Golden-hued.<br> 3 We cleanse this gladdening drink of his the juice which Indra chiefly drinks&#151;-<br> That which kine took into their mouths, of old, and princes take it now.<br> 4 To him, while purifying, they have raised the ancient psalm of praise:<br> And sacred songs which bear the names of Gods have supplicated him.<br> 5 They purify him as he drops, courageous, in the fleecy sieve.<br> Him they instruct as messenger to bear the sage's morning prayer.<br> 6 Soma, best Cheerer, takes his seat, the while they cleanse him in the bowls.<br> He as it were impregns the cow, and babbles on, the Lord of Song.<br> 7 He is effused and beautified, a God for Gods, by skilful men.<br> He penetrates the mighty floods collecting all he knows therein.<br> 8 Pressed, Indu, guided by the men, thou art led to the cleaning sieve.<br> Thou, yielding Indra highest joy, takest thy seat within the bowls.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09100.htm\">Next: HYMN C. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09099.html",
  "api": "json/hymns/09099.json",
  "data": {
    "title": "HYMN XCIX. Indu.",
    "describe": "THEY for the Bold and Lovely One ply manly vigour like a bow: joyous, in front of songs they weave bright raiment for the Lord Divine.",
    "feecting": "p:THEY for the Bold and Lovely One ply manly vigour like a bow: joyous, in front of songs they weave bright raiment for the Lord Divine.\np:And he, made beautiful by night, dips forward into strengthening food', What time the thoughts speed on his way the Golden-hued.\np:We cleanse this gladdening drink of his the juice which Indra chiefly drinks&#151;- That which kine took into their mouths, of old, and princes take it now.\np:To him, while purifying, they have raised the ancient psalm of praise: And sacred songs which bear the names of Devas have supplicated him.\np:They purify him as he drops, courageous, in the fleecy sieve.\np: Him they instruct as messenger to bear the sage's morning prayer.\r\np:Soma, best Cheerer, takes his seat, the while they cleanse him in the bowls. He as it were impregns the cow, and babbles on, the Lord of Song.\np:He is effused and beautified, a God for Devas, by skilful men. He penetrates the mighty floods collecting all he knows therein.\np:Pressed, Indu, guided by the men, thou art led to the cleaning sieve. Thou, yielding Indra highest joy, takest thy seat within the bowls.",
    "next": "09100",
    "previous": "09098",
    "book": "09"
  },
  "created": 1638557357199,
  "updated": 1638647018568
}