{
  "key": "09093",
  "title": "RigVeda Hymn 09093",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN XCIII. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09093.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09092.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09094.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCIII. Soma Pavamana.</h3>  \n<p>1. TEN sisters, pouring out the rain together, swift-moving thinkers of the sage, adorn him.<br> Hither hath run the gold-hued Child of S&#363;rya and reached the vat like a fleet vigorous courser.<br> 2 Even as a youngling crying to his mothers, the bounteous Steer hath flowed along to waters.<br> As youth to damsel, so with milk he hastens on to the. chose meeting-place, the beaker.<br> 3 Yea, swollen is the udder of the milch-cow: thither in streams goes very sapient Indu.<br> The kine make ready, as with new-washed treasures, the Head and Chief with milk within the vessels.<br> 4 With all the Gods, O Indu Pavamana, while thou art roaring send us wealth in horses.<br> Hither upon her car come willing Plenty, inclined to us, to give us of her treasures.<br> 5 Now unto us mete riches, while they cleansethee, all-glorious, swelling wealth, with store of heroes.<br> Long be his life who worships, thee, O Indu. May he, enriched with prayer, come soon and early.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09094.htm\">Next: HYMN XCIV. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09093.html",
  "api": "json/hymns/09093.json",
  "data": {
    "title": "HYMN XCIII. Indu.",
    "describe": "TEN sisters, pouring out the rain together, swift-moving thinkers of the sage, adorn him.",
    "feecting": "p:TEN sisters, pouring out the rain together, swift-moving thinkers of the sage, adorn him.\np: Hither hath run the gold-hued Child of S&#363;rya and reached the vat like a fleet vigorous courser.\r\np:Even as a youngling crying to his mothers, the bounteous Steer hath flowed along to waters. As youth to damsel, so with milk he hastens on to the. chose meeting-place, the beaker.\np:Yea, swollen is the udder of the milch-cow: thither in streams goes very sapient Indu. The kine make ready, as with new-washed treasures, the Head and Chief with milk within the vessels.\np:With all the Devas, O Indu Pavamana, while thou art roaring send us wealth in horses. Hither upon her car come willing Plenty, inclined to us, to give us of her treasures.\np:Now unto us mete riches, while they cleansethee, all-glorious, swelling wealth, with store of heroes. Long be his life who worships, thee, O Indu. May he, enriched with meditation, come soon and early.",
    "next": "09094",
    "previous": "09092",
    "book": "09"
  },
  "created": 1638557325647,
  "updated": 1638647073002
}