{
  "key": "09092",
  "title": "RigVeda Hymn 09092",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN XCII. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09092.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09091.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09093.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCII. Soma Pavamana.</h3>  \n<p>1. THE gold-hued juice, poured out upon the filter, is started like a car sent forth to conquer.<br> He hath gained song and vigour while they cleansed him, and hath rejoiced the Gods with entertainments.<br> 2 He who beholdeth man hath reached the filter: bearing his name, the Sage hath sought his dwelling.<br> The &#7770;&#7779;is came to him, seven holy singers, when in the bowls he settled as Invoker.<br> 3 Shared by all Gods, mobt wise, propitious, Soma goes, while they cleanse him, to his constant station.<br> Let him rejoice in all his lofty wisdom to the Five Tribes the Sage attains with labour.<br> 4 In thy mysterious place, O Pavamana Soma, are all the Gods, the Thrice-Eleven.<br> Ten on the fleecy height, themselves, self-prompted, and seven fresh rivers, brighten and adorn thee.<br> 5 Now let this be the truth of Pavamana, there where all singers gather them together,<br> That he hath given us room and made the daylight, hath holpen Manu and repelled the Dasyu.<br> 6 As the priest seeks the station rich in cattle, like a true King who goes to great assemblies,<br> Soma hath sought the beakers while they cleansed him, and like a wild bull, in the wood hath settled.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09093.htm\">Next: HYMN XCIII. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09092.html",
  "api": "json/hymns/09092.json",
  "data": {
    "title": "HYMN XCII. Indu.",
    "describe": "THE gold-hued juice, poured out upon the filter, is started like a car sent forth to conquer.",
    "feecting": "p:THE gold-hued juice, poured out upon the filter, is started like a car sent forth to conquer.\np: He hath gained song and vigour while they cleansed him, and hath rejoiced the Devas with entertainments.\r\np:He who beholdeth man hath reached the filter: bearing his name, the Sage hath sought his dwelling. The &#7770;&#7779;is came to him, seven holy singers, when in the bowls he settled as Invoker.\np:Shared by all Devas, mobt wise, propitious, Soma goes, while they cleanse him, to his constant station. Let him rejoice in all his lofty wisdom to the Five Tribes the Sage attains with labour.\np:In thy mysterious place, O Indu Soma, are all the Devas, the Thrice-Eleven. Ten on the fleecy height, themselves, self-prompted, and seven fresh rivers, brighten and adorn thee.\np:Now let this be the truth of Indu, there where all singers gather them together, that he hath given us room and made the daylight, hath holpen Manu and repelled the Dasyu.\np:As the Monk seeks the station rich in cattle, like a true King who goes to great assemblies, Soma hath sought the beakers while they cleansed him, and like a wild bull, in the wood hath settled.",
    "next": "09093",
    "previous": "09091",
    "book": "09"
  },
  "created": 1638557320192,
  "updated": 1638790698447
}