{
  "key": "09100",
  "title": "RigVeda Hymn 09100",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN C. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09100.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09099.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09101.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN C. Soma Pavamana.</h3>  \n<p>1. THE Guileless Ones are singing praise to Indra's well beloved Friend,<br> As, in the morning of its life, the mothers lick the new-born calf.<br> 2 O Indu, while they cleanse thee bring, O Soma, doubly-waxing wealth<br> Thou in the worshipper's abode causest all treasures to increase.<br> 3 Set free the. song which mind hath yoked, even as thunder frees the rain:<br> All treasures of the earth and heaven, O Soma, thou dost multiply.<br> 4 Thy stream when thou art pressed runs on like some victorious warrior's steed<br> Hastening onward through the fleece like a fierce horse who wins the prize.<br> 5 Flow on, Sage Soma, with thy stream to give us mental power and strength,<br> Effused for Indra, for his drink, for Mitra and for Varu&#7751;a.<br> 6 Flow to the filter with thy stream, effused, best winner, thou, of spoil,<br> O Soma, as most rich in sweets for Indra, Vi&#7779;&#7751;u, and the Gods.<br> 7 The mothers, void of guiles, caress thee Golden-coloured, in the sieve,<br> As cows, O Pavamana, lick the new-born calf, as Law commands.<br> 8 Thou, Pavamana, movest on with wondrous rays to great renown.<br> Striving within the votary's house thou drivest all the glooms away.<br> 9 Lord of great sway, thou liftest thee above the heavens, above the earth.<br> Thou, Pavamana hast assumed thy coat of mail in majesty.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09101.htm\">Next: HYMN CI. Soma Pavamana</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09100.html",
  "api": "json/hymns/09100.json",
  "data": {
    "key": "09100",
    "title": "HYMN C. Indu.",
    "describe": "THE Guileless Ones are singing praise to Indra's well beloved Friend, As, in the morning of its life, the mothers lick the new-born calf.",
    "feecting": "p:THE Guileless Ones are singing praise to Indra's well beloved Friend, As, in the morning of its life, the mothers lick the new-born calf.\np:O Indu, while they cleanse thee bring, O Soma, doubly-waxing wealth Thou in the worshipper's abode causest all treasures to increase.\np:Set free the. song which mind hath yoked, even as thunder frees the rain: All treasures of the Earth and Heaven, O Soma, thou dost multiply.\np:Thy stream when thou art pressed runs on like some victorious warrior's steed Hastening onward through the fleece like a fierce horse who wins the prize.\np:Flow on, Sage Soma, with thy stream to give us mental power and strength, Effused for Indra, for his drink, for Mitra and for Indra.\np:Flow to the filter with thy stream, effused, best winner of spoil, O Soma, as most rich in sweets for Indra, Indra, and the Devas.\np:The mothers, void of guiles, caress thee Golden-coloured, in the sieve, as cows, O Indu, lick the new-born calf, as Law commands.\np:Thou, indu, movest on with wondrous rays to great renown.\np: Striving within the votary's house thou drivest all the glooms away.\r\np:Lord of great sway, thou liftest thee above the heavens, above the Earth. Thou, indu hast assumed thy coat of mail in majesty.",
    "meta": {
      "next": "09101",
      "previous": "09099",
      "book": "09",
      "original": "https://sacred-texts.com/hin/rigveda/rv09100.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv09100.htm"
    },
    "deities": [
      {
        "name": "O Indu",
        "hymns": [
          {
            "key": "09100",
            "title": "HYMN C. Indu."
          },
          {
            "key": "09100",
            "title": "HYMN C. Indu."
          }
        ]
      },
      {
        "name": "O Soma",
        "hymns": [
          {
            "key": "09100",
            "title": "HYMN C. Indu."
          },
          {
            "key": "09100",
            "title": "HYMN C. Indu."
          },
          {
            "key": "09100",
            "title": "HYMN C. Indu."
          }
        ]
      }
    ]
  },
  "created": 1638557362466,
  "updated": 1667442753974
}