{
  "key": "09107",
  "title": "RigVeda Hymn 09107",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 9: HYMN CVII. Soma Pavamana.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv09107.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi09.htm\">Rig-Veda, Book 9 Index</A><BR>\n&nbsp;\n<A HREF=\"rv09106.htm\">Previous</A>&nbsp;\n<A HREF=\"rv09108.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CVII. Soma Pavamana.</h3>  \n<p>I., HENCE sprinkle forth the juice effused,. Soma, the best of sacred gifts,<br> Who, friend of man, hath run amid the water-streams. He hath pressed Soma out with stones.<br> 2 Now, being purified, flow hither through the fleece inviolate and most odorous.<br> We ladden thee in waters when thou art effused, blending thee still with juice and milk.<br> 3 Pressed out for all to see, delighting Gods, Indu, Far-sighted One, is mental power.<br> 4 Cleansing thee, Soma, in thy stream, thou flowest in a watery robe:<br> Giver of wealth, thou sittest in the place of Law, O God, a fountain made of gold.<br> 5 Milking the heavenly udder for dear meath, he hath sat in the ancient gatheringplace.<br> Washed by the men, the Strong Farseeing One streams forth nutriti us food that all desire.<br> 6 O Soma, while they cleanse thee, dear and watchful in the sheep's long wool,<br> Thou hast become a Singer most like A&#7749;giras: thou madest S&#363;rya mount to heaven.<br> 7 Bountiful, best of furtherers, Soma floweth on, &#7770;&#7779;i and Singer, keen of sight.<br> Thou hast become a Sage most welcome to the Gods: thou madest S&#363;rya mount to heaven.<br> 8 Pressed out by pressers, Soma goes over the fleecy backs of sheep,<br> Goes, even as with a mare, in tawnycoloured stream, goes in exhilarating stream.<br> 9 Down to the water-Soma, rich in kine hath flowed with cows, with cows that have been milked.<br> They have approached the mixing-vessel as a sea: the cheerer streams for the carouse.<br> 10 Effused by stones, O Soma, and urged through the long wool of the sheep,<br> Thou, entering the saucers as a man the fort, gold-hued hast settled in the wood.<br> 11 He beautifies himself through the sheep's long fine wool, like an impetuous steed in war,<br> Even Soma Pavamana who shall be the joy of sages and of holy bards.<br> 12 O Soma,&#151;for the feast of Gods, river-like he hath swelled with surge,<br> With the stalk's juice, exhilarating, resting not, into the vat that drops with meath.<br> 13 Like a dear son who must be decked, the Lovely One hath clad him in a shining robe.<br> Men skilful at their work drive him forth, like a car, into the rivers from their bands.<br> 14 The living drops of Soma juice pour, as they flow, the gladdening drink,<br> Intelligent drops above the basin of the sea, exhilarating, finding light.<br> 15 May Pavamana, King and God, speed with his wave over the sea the lofty rite:<br> May he by Mitra's and by Varu&#7751;a's decree flow furthering the lofty rite.<br> 16 Far-seeing, lovely, guided by the men, the God whose home is in the sea-<br> 17 Soma, the gladdening juice, flows pressed for Indra with his Marut host:<br> He hastens o&#146;er the fleece with all his thousand streams: men make him bright and beautiful.<br> 18 Purified in the bowl and gendering the hymn, wise Soma joys among the Gods.<br> Robed in the flood, the Mighty One hath clad himself with milk and settled in the vats.<br> 19 O Soma, Indu, every day thy friendship hath been my delight.<br> Many fiends follow me; help me, thou Tawny-hued; pass on beyond these barriers.<br> 20 Close to thy bosom am I, Soma, day and night. O Tawny-hued, for friendship sake.<br> S&#363;rya himself refulgent with his glow have we o&#146;ertaken in his course like birds.<br> 21 Deft-handcd! thou when purified liftest thy voice amid the sea.<br> Thou, Pavamana, makest riches flow to us, yellow, abundant, much-desifed.<br> 22 Making thee pure and bright in the sheep's long wool, thou hast bellowed, steerlike, in the wood.<br> Thou flowest, Soma Pavamana, balmed with milk unto the special place of Gods.<br> 23 Flow on to win us strength, flow on to lofty lore of every kind.<br> Thou, Soma, as Exhilarator wast the first to spread the sea abroad for Gods.<br> 24 Flow to the realm of earth, flow to the realm of heaven, O Soma, in thy righteous ways.<br> Fair art thou whom the sages, O Far-seeing One, urge onward with their songs and hymns.<br> 25 Over the cleansing sieve have flowed the Pavamanas in a stream,<br> Girt by the Maruts, gladdening, Steeds with Indra's stiength, for wisdom and for dainty food.<br> 26 Urged onward by the pressers, clad in watery robes, Indu is speeding to the vat.<br> He gendering light, hath made the glad Cows low, while he takes them as his garb of state.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv09108.htm\">Next: HYMN CVIII. Soma Pavamana.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/09107.html",
  "api": "hymns/09107json",
  "data": {
    "title": "HYMN CVII. Soma Pavamana.",
    "describe": false,
    "feecting": "I., HENCE sprinkle forth the juice effused. Soma, the best of sacred gifts, who, friend of man, hath run amid the water-streams. He hath pressed Soma out with stones.\np:Now, being purified, flow hither through the fleece inviolate and most odorous.\np: We ladden thee in waters when thou art effused, blending thee still with juice and milk.\r\np:Pressed out for all to see, delighting Devas, Indu, Far-sighted One, is mental power.\np:Cleansing thee, Soma, in thy stream, thou flowest in a watery robe: Giver of wealth, thou sittest in the place of Law, a fountain made of gold.\np:Milking the heavenly udder for dear meath, he hath sat in the ancient gatheringplace. Washed by the men, the Strong Farseeing One streams forth nutriti us food that all desire.\np:O Soma, while they cleanse thee, dear and watchful in the sheep's long wool, Thou hast become a Singer most like Aṅgiras: thou madest Sūrya mount to Heaven.\np:Bountiful, best of furtherers, Soma floweth on, Ṛṣi and Singer, keen of sight. Thou hast become a Sage most welcome to the Devas: thou madest Sūrya mount to Heaven.\np:Pressed out by pressers, Soma goes over the fleecy backs of sheep, Goes, even as with a mare, in tawnycoloured stream, goes in exhilarating stream.\np:Down to the water-Soma, rich in kine hath flowed with cows, with cows that have been milked. They have approached the mixing-vessel as a sea: the cheerer streams for the carouse.\np:Effused by stones, O Soma, and urged through the long wool of the sheep, Thou, entering the saucers as a man the fort, gold-hued hast settled in the wood.\np:He beautifies himself through the sheep's long fine wool, like an impetuous steed in war, Even Soma Pavamana who shall be the joy of sages and of holy bards.\np:O Soma,—for the feast of Devas, river-like he hath swelled with surge, with the stalk's juice, exhilarating, resting not, into the vat that drops with meath.\np:Like a dear son who must be decked, the Lovely One hath clad him in a shining robe. Men skilful at their work drive him forth, like a car, into the rivers from their bands.\np:The living drops of Soma juice pour, as they flow, the gladdening drink, Intelligent drops above the basin of the sea, exhilarating, finding light.\np:May Pavamana, King and Deva, speed with his wave over the sea the lofty rite: May he by Mitra's and by Indra's decree flow furthering the lofty rite.\np:Far-seeing, lovely, guided by the men whose home is in the sea-\np:Soma, the gladdening juice, flows pressed for Indra with his Marut host: He hastens o’er the fleece with all his thousand streams: men make him bright and beautiful.\np:Purified in the bowl and gendering the hymn, wise Soma joys among the Devas. Robed in the flood, the Mighty One hath clad himself with milk and settled in the vats.\np:O Soma, Indu, every day thy friendship hath been my delight. Many fiends follow me; help me, thou Tawny-hued; pass on beyond these barriers.\np:Close to thy bosom am I, Soma, day and night. O Tawny-hued, for friendship sake. Sūrya himself refulgent with his glow have we o’ertaken in his course like birds.\np:Deft-handcd! thou when purified liftest thy voice amid the sea. Thou, Pavamana, makest riches flow to us, yellow, abundant, much-desifed.\np:Making thee pure and bright in the sheep's long wool, thou hast bellowed, steerlike, in the wood. Thou flowest, Soma Pavamana, balmed with milk unto the special place of Devas.\np:Flow on to win us strength, flow on to lofty lore of every kind. Thou, Soma, as Exhilarator wast the first to spread the sea abroad for Devas.\np:Flow to the realm of Earth, flow to the realm of Heaven, O Soma, in thy righteous ways. Fair art thou whom the sages, O Far-seeing One, urge onward with their songs and hymns.\np:Over the cleansing sieve have flowed the Pavamanas in a stream, Girt by the Devas, gladdening, Steeds with Indra's stiength, for wisdom and for dainty food.\np:Urged onward by the pressers, clad in watery robes, Indu is speeding to the vat. He gendering light, hath made the glad Cows low, while he takes them as his garb of state.",
    "next": "09108",
    "previous": "09106",
    "book": "09"
  },
  "created": 1638557399252
}