{
  "key": "10008",
  "title": "RigVeda Hymn 10008",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN VIII. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10008.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10007.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10009.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN VIII. Agni.</h3>  \n<p>1. AGNI advances with his lofty banner: the Bull is bellowing to the earth and heavens.<br> He hath attained the sky's supremest limits. the Steer hath waxen in the lap of waters.<br> 2 The Bull, the youngling with the hump, hath frolicked, the strong and never-ceasing Calf hath bellowed.<br> Bringing our offerings to the God's assembly, he moves as Chief in his own dwelling-places.<br> 3 Him who hath grasped his Parents' head, they stablished at sacrifice a wave of heavenly lustre.<br> In his swift flight the red Dawns borne by horses refresh their bodies in the home of Order.<br> 4 For, Vasu thou precedest every Morning, and still hast been the Twins' illuminator.<br> For sacrifice, seven places thou retainest while for thine own self thou engenderest Mitra.<br> 5 Thou art the Eye and Guard of mighty Order, and Varu&#7751;a when to sacrifice thou comest.<br> Thou art the Waters&#146; Child O J&#257;tavedas, envoy of him whose offering thou acceptest.<br> 6 Thou art the Leader of the rite and region, to which with thine auspicious teams thou teadest,<br> Thy light-bestowing head to heaven thou liftest, making thy tongue the oblationbearer, Agni.<br> 7 Through his wise insight Trita in the cavern, seeking as ever the Chief Sire's intention,<br> Carefully tended in his Parents' bosom, calling the weapons kin, goes forth to combat.<br> 8 Well-skilled to use the weapons of his Father, &#256;ptya, urged on by Indra, fought the battle.<br> Then Trita slew the foe seven-rayed, three-headed, and freed the cattle of the Son of Tva&#7779;&#7789;ar.<br> 9 Lord of the brave, Indra cleft him in pieces who sought to gain much strength and deemed him mighty.<br> He smote his three heads from his body, seizing the cattle of the oniniform Son of Tva&#7779;&#7789;ar.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10009.htm\">Next: HYMN IX. Waters.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10008.html",
  "api": "json/hymns/10008.json",
  "data": {
    "title": "HYMN VIII. Agni.",
    "describe": "AGNI advances with his lofty banner: the Bull is bellowing to the Earth and heavens.",
    "feecting": "p:AGNI advances with his lofty banner: the Bull is bellowing to the Earth and heavens.\np: He hath attained the sky's supremest limits. the Steer hath waxen in the lap of waters.\r\np:The Bull, the youngling with the hump, hath frolicked, the strong and never-ceasing Calf hath bellowed. Bringing our offerings to the Deva's assembly, he moves as Chief in his own dwelling-places.\np:Him who hath grasped his Parents' head, they stablished at offering a wave of heavenly lustre. In his swift flight the red Dawns borne by horses refresh their bodies in the home of Order.\np:For, Vasu thou precedest every Morning, and still hast been the Twins' illuminator. For offering, seven places thou retainest while for thine own self thou engenderest Mitra.\np:Thou art the Eye and Guard of mighty Order, and Varu&#7751;a when to offering thou comest. Thou art the Waters&#146; Child O J&#257;tavedas, envoy of him whose offering thou acceptest.\np:Thou art the Leader of the rite and region, to which with thine auspicious teams thou teadest, Thy light-bestowing head to Heaven thou liftest, making thy tongue the oblationbearer, Agni.\np:Through his wise insight Trita in the cavern, seeking as ever the Chief Sire's intention, Carefully tended in his Parents' bosom, calling the weapons kin, goes forth to combat.\np:Well-skilled to use the weapons of his Father, &#256;ptya, urged on by Indra, fought the battle. Then Trita slew the foe seven-rayed, three-headed, and freed the cattle of the Son of Tva&#7779;&#7789;ar.\np:Lord of the brave, Indra cleft him in pieces who sought to gain much strength and deemed him mighty. He smote his three heads from his body, seizing the cattle of the oniniform Son of Tva&#7779;&#7789;ar.",
    "next": "10009",
    "previous": "10007",
    "book": "10"
  },
  "created": 1638557478129,
  "updated": 1638647790900
}