{
  "key": "10003",
  "title": "RigVeda Hymn 10003",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN III. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10003.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10002.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10004.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN III. Agni.</h3>  \n<p>1. O KING, the potent and terrific envoy, kindled for strength, is manifest in beauty.<br> He shines, all-knowing, with his lotty splendour: chasing black Night he comes with white-rayed Morning.<br> 2 Having o&#146;ercome the glimmering Black with beauty, and bringing forth the dame the Great Sire's Daughter,<br> Holding aloft the radiant light of S&#363;rya, as messenger of heaven he shines with treasures.<br> 3 Attendant on the Blessed Dame the Blessed hath come: the Lover followeth his Sister.<br> Agni, far-spreading with conspicuous lustre, hath compassed Night with whitelyshining garments.<br> 4 His goings-forth kindle as &#146;twere high voices the goings of the auspicious Friend of Agni.<br> The rays, the bright beams of the strong-jawed, mighty, adorable Steer are visible as he cometh.<br> 5 Whose radiant splendours flow, like sounds, about us, his who is lofty, brilliant, and effulgent,<br> Who reaches heaven with best and brightest lustres, sportive and piercing even to the summit.<br> 6 His powers, whose chariot fellies gleam and glitter have loudly roared while, as with teams, he hasted.<br> He, the most Godlike, far-extending envoy, shines with flames ancient, resonant, whitely-shining.<br> 7 So bring us ample wealth: seat thee as envoy of the two youthful Matrons, Earth and Heaven.<br> Let Agni rapid with his rapid, horses, impetuous with impetuous Steeds, come hither.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10004.htm\">Next: HYMN IV. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10003.html",
  "api": "json/hymns/10003.json",
  "data": {
    "title": "HYMN III. Agni.",
    "describe": "O KING, the potent and terrific envoy, kindled for strength, is manifest in beauty.",
    "feecting": "p:O KING, the potent and terrific envoy, kindled for strength, is manifest in beauty.\np: He shines, all-knowing, with his lotty splendour: chasing black Night he comes with white-rayed Morning.\r\np:Having o&#146;ercome the glimmering Black with beauty, and bringing forth the dame the Great Sire's Daughter, Holding aloft the radiant light of S&#363;rya, as messenger of Heaven he shines with treasures.\np:Attendant on the Blessed Dame the Blessed hath come: the Lover followeth his Sister. Agni, far-spreading with conspicuous lustre, hath compassed Night with whitelyshining garments.\np:His goings-forth kindle as &#146;twere high voices the goings of the auspicious Friend of Agni. The rays, the bright beams of the strong-jawed, mighty, adorable Steer are visible as he cometh.\np:Whose radiant splendours flow, like sounds, about us, his who is lofty, brilliant, and effulgent, who reaches Heaven with best and brightest lustres, sportive and piercing even to the summit.\np:His powers, whose chariot fellies gleam and glitter have loudly roared while, as with teams, he hasted. He, the most Godlike, far-extending envoy, shines with flames ancient, resonant, whitely-shining.\np:So bring us ample wealth: seat thee as envoy of the two youthful Matrons, Earth and Heaven. Let Agni rapid with his rapid, horses, impetuous with impetuous Steeds, come hither.",
    "next": "10004",
    "previous": "10002",
    "book": "10"
  },
  "created": 1638557451846,
  "updated": 1638647018589
}