{
  "key": "10010",
  "title": "RigVeda Hymn 10010",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN X.Yama Yami.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10010.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10009.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10011.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN X.Yama Yami.</h3>  \n<p>1. FAIN would I win my friend to kindly friendship. So may the Sage, come through the air's wide ocean,<br> Remembering the earth and days to follow, obtain a son, the issue of his father.<br> 2 Thy friend loves not the friendship which considers her who is near in kindred as stranger.<br> Sons of the mighty Asura, the Heroes, supporters of the heavens, see far around them.<br> 3 Yea, this the Immortals seek of thee with longing, progeny of the sole existing mortal.<br> Then let thy soul and mine be knit together, and as a loving husband take thy consort.<br> 4 Shall we do now what we ne&#146;er did aforetime? we who spake righteously now talk impurely?<br> Gandharva in the floods, the Dame of Waters-such is our bond, such our most lofty kinship.<br> 5 Even in the womb God Tva&#7779;&#7789;ar, Vivifier, shaping all forms, Creator, made us consorts.<br> None violates his holy ordinances: that we are his the heavens and earth acknowledge.<br> 6 Who knows that earliest day whereof thou speakest? Who hatb beheld it? Who can here declare it?<br> Great is the Law of Varu&#7751;a and Mitra. What, wanton! wilt thou say to men to tempt them?<br> 7 I, Yami, am possessed by love of Yama, that I may rest on the same couch beside him.<br> I as a wife would yield me to my husband. Like car-wheels let us speed to meet each other.<br> 8 They stand not still, they never close their eyelids, those sentinels of Gods who wander round us.<br> Not me-go quickly, wanton, with another, and hasten like a chariot wheel to meet him.<br> 9 May S&#363;rya's eye with days and nights endow him, and ever may his light spread out before him.<br> In heaven and earth the kindred Pair commingle. On Yam! be the unbrotherly act of Yama.<br> 10 Sure there will come succeeding times when brothers and sisters will do acts unmeet for kinsfolk.<br> Not me, O fair one,&#151;seek another husband, and make thine arm a pillow for thy consort.<br> 11 Is he a brother when no lord is left her? Is she a sister when Destruction cometh?<br> Forced by my love these many words I utter. Come near, and hold me in thy close embraces.<br> 12 I will not fold mine arms about thy body: they call it sin when one comes near his sister.<br> Not me,&#151;prepare thy pleasures with another: thy brother seeks not this from thee, O fair one.<br> 13 Alas! thou art indeed a weakling, Yama we find in thee no trace of heart or spirit.<br> As round the tree the woodbine clings, another will cling albout thee girt as with a girdle.<br> 14 Embrace another, Yami; let another, even as the woodbine rings the tree, enfold thee.<br> Win thou his heart and let him win thy fancy, and he shall form with thee a blest alliance.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10011.htm\">Next: HYMN XI. Agni</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10010.html",
  "api": "json/hymns/10010.json",
  "data": {
    "title": "HYMN X.Yama Yami.",
    "describe": "FAIN would I win my friend to kindly friendship.",
    "feecting": "p:FAIN would I win my friend to kindly friendship. May the Sage, come through the air's wide ocean, Remembering the Earth and days to follow, obtain a son, the issue of his father.\np:Thy friend loves not the friendship which considers her who is near in kindred as stranger.\np: Sons of the mighty Devas, the Heroes, supporters of the heavens, see far around them.\r\np:Yea, this the Immortals seek of thee with longing, progeny of the sole existing mortal. Then let thy soul and mine be knit together, and as a loving husband take thy consort.\np:Shall we do now what we ne&#146;er did aforetime? we who spake righteously now talk impurely? Gandharva in the floods, the Dame of Waters-such is our bond, such our most lofty kinship.\np:Even in the womb God Tva&#7779;&#7789;ar, Vivifier, shaping all forms, Creator, made us consorts. None violates his holy ordinances: that we are his the heavens and Earth acknowledge.\np:Who knows that earliest day whereof thou speakest? Who hatb beheld it? Who can here declare it? Great is the Law of Varu&#7751;a and Mitra. What, wanton! wilt thou say to men to tempt them?\np:I, Yami, am possessed by love of Yama, that . May rest on the same couch beside him. I as a wife would yield me to my husband. Like car-wheels let us speed to meet each other.\np:They stand not still, they never close their eyelids, those sentinels of Devas who wander round us. Not me-go quickly, wanton, with another, and hasten like a chariot wheel to meet him.\np:May S&#363;rya's eye with days and nights endow him, and eve. May his light spread out before him. In Heaven and Earth the kindred Pair commingle. On Yam! be the unbrotherly act of Yama.\np:Sure there will come succeeding times when brothers and sisters will do acts unmeet for kinsfolk. Not me, O fair one,&#151;seek another husband, and make thine arm a pillow for thy consort.\np:Is he a brother when no lord is left her? Is she a sister when Destruction cometh? Forced by my love these many words I utter. Come near, and hold me in thy close embraces.\np:I will not fold mine arms about thy body: they call it sin when one comes near his sister. Not me,&#151;prepare thy pleasures with another: thy brother seeks not this from thee, O fair one.\np:Alas! thou art indeed a weakling, Yama we find in thee no trace of heart or spirit. As round the tree the woodbine clings, another will cling albout thee girt as with a girdle.\np:Embrace another, Yami; let another, even as the woodbine rings the tree, enfold thee. Win thou his heart and let him win thy fancy, and he shall form with thee a blest alliance.",
    "next": "10011",
    "previous": "10009",
    "book": "10"
  },
  "created": 1638557488680,
  "updated": 1638647018595
}