{
  "key": "10019",
  "title": "RigVeda Hymn 10019",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN XIX. Waters or Cows.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10019.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10018.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10020.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XIX. Waters or Cows.</h3>  \n<p>1. TURN, go not farther on your way: visit us, O ye Wealthy Ones.<br> Agni and Soma, ye who bring riches again, secure us wealth.<br> 2 Make these return to us again, bring them beside us once again.<br> May. Indra give them back to us, and Agni drive them hither-ward.<br> 3 Let them return to us again: under this herdsman let them feed.<br> Do thou, O Agni, keep them here, and let the wealth we have remain.<br> 4 1 call upon their herdsman, him who knoweth well their coming nigh,<br> Their parting and their home-return, and watcheth their approach and rest.<br> 5 Yea, let the herdsman, too, return, who marketh well their driving-forth;<br> Marketh their wandering away, their turning back and coming home.<br> 6 Home-leader, lead them home to us; Indra, restore to us our kine:<br> We will rejoice in them alive.<br> 7 1 offer you on every side butter and milk and strengthening food.<br> May all the Holy Deities pour down on us a flood of wealth.<br> 8 O thou Home-leader, lead them home, restore them thou who bringest home.<br> Four are the quarters of the earth; from these bring back to us our kine,</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10020.htm\">Next: HYMN XX. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10019.html",
  "api": "json/hymns/10019.json",
  "data": {
    "title": "HYMN XIX. Waters or Cows.",
    "describe": "TURN, go not farther on your way: visit us, O ye Wealthy Ones.",
    "feecting": "p:TURN, go not farther on your way: visit us, O ye Wealthy Ones.\np: Agni and Soma, ye who bring riches again, secure us wealth.\r\np:Make these return to us again, bring them beside us once again. May. Indra give them back to us, and Agni drive them hither-ward.\np:Let them return to us again: under this herdsman let them feed. Do thou, O Agni, keep them here, and let the wealth we have remain.\np:1 call upon their herdsman, him who knoweth well their coming nigh, their parting and their home-return, and watcheth their approach and rest.\np:Yea, let the herdsman, too, return, who marketh well their driving-forth; Marketh their wandering away, their turning back and coming home.\np:Home-leader, lead them home to us; Indra, restore to us our kine: We will rejoice in them alive.\np:1 offer you on every side butter and milk and strengthening food. May all the Holy Deities pour down on us a flood of wealth.\np:O thou Home-leader, lead them home, restore them thou who bringest home. Four are the quarters of the Earth; from these bring back to us our kine,",
    "next": "10020",
    "previous": "10018",
    "book": "10"
  },
  "created": 1638557536376,
  "updated": 1638642699008
}