{
  "key": "10023",
  "title": "RigVeda Hymn 10023",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN XXIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10023.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10022.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10024.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXIII. Indra.</h3>  \n<p>1. INDRA, whose right hand wields the bolt, we worship, driver of Bay Steeds seeking sundered courses.<br> Shaking his beard with might he hath arisen, casting his weapons forth and dealing bounties.<br> 2 The treasure which his Bay Steeds found at sacrifice,&#151;this wealth made opulent Indra slayer of the foe.<br> &#7770;bhu, &#7770;bhuk&#7779;an, V&#257;ja-he is Lord of Might. The D&#257;sa's very name I utterly destroy.<br> 3 When, with the Princes, Maghavari, famed of old, comes nigh the thunderbolt of gold, and the Controller's car<br> Which his two Tawny Coursers draw, then Indra is the Sovran Lord of power whose glory spreads afar.<br> 4 With him too is this rain of his that comes like herds: Indra throws drops of moisture on his yellow beard.<br> When the sweet juice is shed he seeks the pleasant place, and stirs the worshipper as wind disturbs the wood.<br> 5 We laud and praise his several deeds of valour who, fatherlike, with power hath made us stronger;<br> Who with his voice slew many thousand wicked ones who spake in varied manners with contemptuous cries.<br> 6 Indra, the Vimadas have formed for thee a laud, copious, unparalleled, for thee Most Bountiful.<br> We know the good we gain from him the Mighty One when we attract him as a herdsman calls the kine.<br> 7 Ne&#146;er may this bond of friendship be dissevered, the &#7770;&#7779;i Vimada's and thine, O Indra.<br> We know thou carest for us as a brother with us, O God, be thine auspicious friendship.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10024.htm\">Next: HYMN XXIV. Indra. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10023.html",
  "api": "json/hymns/10023.json",
  "data": {
    "key": "10023",
    "title": "HYMN XXIII. Indra.",
    "describe": "INDRA, whose right hand wields the bolt, we worship, driver of Bay Steeds seeking sundered courses.",
    "feecting": "p:INDRA, whose right hand wields the bolt, we worship, driver of Bay Steeds seeking sundered courses.\np: Shaking his beard with might he hath arisen, casting his weapons forth and dealing bounties.\r\np:The treasure which his Bay Steeds found at offering.this wealth made opulent Indra slayer of the foe. Ṛbhu, Ṛbhukṣan, Vāja-he is Lord of Might. The Dāsa's very name I utterly destroy.\np:When, with the Princes, Maghavari, famed of old, comes nigh the thunderbolt of gold, and the Controller's car Which his two Tawny Coursers draw, then Indra is the Sovran Lord of power whose glory spreads afar.\np:With him too is this rain of his that comes like herds: Indra throws drops of moisture on his yellow beard. When the sweet juice is shed he seeks the pleasant place, and stirs the worshipper as wind disturbs the wood.\np:We laud and praise his several deeds of valour who, fatherlike, with power hath made us stronger. Who with his voice slew many thousand wicked ones who spake in varied manners with contemptuous cries.\np:Indra, the Vimadas have formed for thee a laud, copious, unparalleled, for thee Most Bountiful. We know the good we gain from him the Mighty One when we attract him as a herdsman calls the kine.\np:Ne’e. May this bond of friendship be dissevered, the Ṛṣi Vimada's and thine, O Indra. We know thou carest for us as a brother with us, be thine auspicious friendship.",
    "meta": {
      "next": "10024",
      "previous": "10022",
      "book": "10",
      "original": "https://sacred-texts.com/hin/rigveda/rv10023.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv10023.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "10023",
            "title": "HYMN XXIII. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638557557757,
  "updated": 1667442754066
}