{
  "key": "10020",
  "title": "RigVeda Hymn 10020",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN XX. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10020.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10019.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10021.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XX. Agni.</h3>  \n<p>1. SEND unto us a good and happy mind.<br> 2 1 worship Agni, Youthfullest of Gods, resistless, Friend of laws;<br> Under whose guard and heavenly light the Spotted seek the Mother's breast:<br> 3 Whom with their mouth they magnify, bannered with flame and homed in light.<br> He glitters with his row of teeth.<br> 4 Kind, Furtherer of men, he comes, when he hath reached the ends of heaven,<br> Sage, giving splendour to the clouds.<br> 5 To taste man's offerings, he, the Strong, hath risen erect at sacrifice:<br> Fixing his dwelling he proceeds.<br> 6 Here are oblation, worship, rest: rapidly comes his furtherance.<br> To sword-armed Agni come the Gods.<br> 7 With service for chief bliss I seek the Lord of Sacrifice, Agni, whom<br> They call the Living, Son of Cloud.<br> 8 Blest evermore be all the men who come from us, who magnify<br> Agni with sacrificial gifts.<br> 9 The path he treads is black and white and red, and striped, and brown, crimson, and glorious.<br> His sire begat him bright with hues of gold.<br> 10 Thus with his thoughts, O Son of Strength, O Agni, hath Vimada, accordant with the Immortals,<br> Offered thee hymns, soliciting thy favour. Thou hast brought all food, strength, a prosperous dwelling.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10021.htm\">Next: HYMN XXI. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10020.html",
  "api": "json/hymns/10020.json",
  "data": {
    "title": "HYMN XX. Agni.",
    "describe": "SEND unto us a good and happy mind.",
    "feecting": "p:SEND unto us a good and happy mind.\np:1 worship Agni, Youthfullest of Devas, resistless, Friend of laws; Under whose guard and heavenly light the Spotted seek the Mother's breast:\np:Whom with their mouth they magnify, bannered with flame and homed in light.\np: He glitters with his row of teeth.\r\np:Kind, Furtherer of men, he comes, when he hath reached the ends of Heaven, Sage, giving splendour to the clouds.\np:To taste man's offerings, he, the Strong, hath risen erect at offerings: Fixing his dwelling he proceeds.\np:Here are oblation, worship, rest: rapidly comes his furtherance. To sword-armed Agni come the Devas.\np:With service for chief bliss I seek the Lord of Offering, Agni, whom They call the Living, Son of Cloud.\np:Blest evermore be all the men who come from us, who magnify Agni with sacrificial gifts.\np:The path he treads is black and white and red, and striped, and brown, crimson, and glorious. His sire begat him bright with hues of gold.\np:Thus with his thoughts, O Son of Strength, O Agni, hath Vimada, accordant with the Immortals, Offered thee hymns, soliciting thy favour. Thou hast brought all food, strength, a prosperous dwelling.",
    "next": "10021",
    "previous": "10019",
    "book": "10"
  },
  "created": 1638557541685,
  "updated": 1638647073054
}