{
  "key": "10027",
  "title": "RigVeda Hymn 10027",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN XXVII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10027.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10026.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10028.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXVII. Indra.</h3>  \n<p>1. THIS, singer, is my firm determination, to aid the worshipper who pours the Soma.<br> I slay the man who brings no milkoblation, unrighteous, powerful, the truth's perverter.<br> 2 Then Will I, when I lead my friends to battle against the radiant persons of the godless,<br> Prepare for thee at home a vigorous bullock, and pour for thee the fifteen-fold strong juices.<br> 3 I know not him who sayeth and declareth that he hath slain the godless in the battle.<br> Soon as they see the furious combat raging, men speak forth praises of my vigorous horses.<br> 4 While yet my deeds of might were unrecorded, all passed for Maghavans though I existed.<br> The potent one who dwelt in peace I conquered, grasped by the foot and slew him on the mountain.<br> 5 None hinder me in mine heroic exploits, no, not the mountains when I will and purpose.<br> Even the deaf will tremble at my roaring, and every day will dust be agitated.<br> 6 To see the Indraless oblation-drinkers, mean offerers, o&#146;ertaken by destruction!<br> Then shall the fellies of my car pass over those who have blamed my joyous Friend and scorned him.<br> 7 Thou wast, thou grewest to full vital vigour: an earlier saw, a later one shall see thee.<br> Two canopies, as &#146;twere, are round about him who reacheth to the limit of this region.<br> 8 The freed kine eat the barley of the pious. 1 saw them as they wandered with the herdsman.<br> The calling of the pious rang around them. What portion will these kine afford their owner?<br> 9 When we who cat the grass of men are gathered I am with barley-eaters in the corn-land.<br> There shall the captor yoke the yokeless bullock, and he who hath been yoked seek one to loose him.<br> 10 There wilt thou hold as true my spoken purpose, to bring together quadrupeds. and bipeds.<br> I will divide, without a fight, his riches who warreth here, against the Bull, with women.<br> 11 When a man's daughter hath been ever eyeless, who, knowing, will be wroth with her for blindness?<br> Which of the two will loose on him his anger-the man who leads her home or he who woos her?<br> 12 How many a maid is pleasing to the suitor who fain would marry for her splendid riches?<br> If the girl be both good and fair of feature, she finds, herself, a friend among the people.<br> 13 His feet have grasped: he eats the man who meets him. Around his head he sets the head for shelter.<br> Sitting anear and right above he smites us, and follows earth that lies spread out beneath him.<br> 14 High, leafless, shadowless, and swift is Heaven: the Mother stands, the Youngling, loosed, is feeding.<br> Loud hath she lowed, licking Another's offspring. In what world hath the Cow laid down her udder?<br> 15 Seven heroes from the nether part ascended, and from the upper part came eight together.<br> Nine from behind came armed with winnowing-baskets: ten from the front pressed o&#146;er the rock's high ridges.<br> 16 One of the ten, the tawny, shared in common, they send to execute their final purpose.<br> The Mother carries on her breast the Infant of noble form and soothes it while it knows not.<br> 17 The Heroes dressed with fire the fatted wether: the dice were thrown by way of sport and gaming.<br> Two reach the plain amid the heavenly waters, hallowing and with means of purifying.<br> 18 Crying aloud they ran in all directions: One half of them will cook, and not the other.<br> To me hath Savitar, this God, declared it: He will perform, whose food is wood and butter.<br> 19 I saw a troop advancing from the distance moved, not by wheels but their own God-like nature.<br> The Friendly One seeks human generations, destroying, still new bands of evil beings.<br> 20 These my two Bulls, even Pramara's, are harnessed: drive them not far; here let them often linger.<br> The waters even shall aid him to his object, and the all-cleansing Sun who is above us.<br> 21 This is the thunderbolt which often whirleth down from the lofty misty realm of S&#363;rya.<br> Beyond this realm there is another glory so through old age they pass and feel no sorrow.<br> 22 Bound fast to,every tree the cow is lowing, and thence the man-consuming birds are flying,<br> Then all this world, though pressing juice for Indra and strengthening the &#7770;&#7779;i, is affrighted.<br> 23 In the Gods&#146; mansion stood the first-created, and from their separation came the later.<br> Three warm the Earth while holding stores of water, and Two of these convey the murmuring moisture.<br> 24 This is thy life: and do thou mark and know it. As such, hide not thyself in time of battle.<br> He manifests the light and hides the vapour: his foot is never free from robes that veil it.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10028.htm\">Next: HYMN XXVIII. Indra. Vasukra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10027.html",
  "api": "json/hymns/10027.json",
  "data": {
    "title": "HYMN XXVII. Indra.",
    "describe": "THIS, singer, is my firm determination, to aid the worshipper who pours the Soma.",
    "feecting": "p:THIS, singer, is my firm determination, to aid the worshipper who pours the Soma.\np: I subdue the man who brings no milkoblation, unrighteous, powerful, the truth's perverter.\r\np:Then Will I, when I lead my friends to battle against the radiant persons of the godless, Prepare for thee at home a vigorous bullock, and pour for thee the fifteen-fold strong juices.\np:I know not him who sayeth and declareth that he hath slain the godless in the battle. Soon as they see the furious combat raging, men speak forth praises of my vigorous horses.\np:While yet my deeds of might were unrecorded, all passed for Indras though I existed. The potent one who dwelt in peace I conquered, grasped by the foot and slew him on the mountain.\np:None hinder me in mine heroic exploits, no, not the mountains when I will and purpose. Even the deaf will tremble at my roaring, and every day will dust be agitated.\np:To see the Indraless oblation-drinkers, mean offerers, o&#146;ertaken by destruction! Then shall the fellies of my car pass over those who have blamed my joyous Friend and scorned him.\np:Thou wast, thou grewest to full vital vigour: an earlier saw, a later one shall see thee. Two canopies, as &#146;twere, are round about him who reacheth to the limit of this region.\np:The freed kine eat the barley of the pious. 1 saw them as they wandered with the herdsman. The calling of the pious rang around them. What portion will these kine afford their owner?\np:When we who cat the grass of men are gathered I am with barley-eaters in the corn-land. There shall the captor yoke the yokeless bullock, and he who hath been yoked seek one to loose him.\np:There wilt thou hold as true my spoken purpose, to bring together quadrupeds. and bipeds. I will divide, without a fight, his riches who warreth here, against the Bull, with women.\np:When a man's daughter hath been ever eyeless, who, knowing, will be wroth with her for blindness? Which of the two will loose on him his anger-the man who leads her home or he who woos her?\np:How many a maid is pleasing to the suitor who fain would marry for her splendid riches? If the girl be both good and fair of feature, she finds, herself, a friend among the people.\np:His feet have grasped: he eats the man who meets him. Around his head he sets the head for shelter. Sitting anear and right above he smites us, and follows Earth that lies spread out beneath him.\np:High, leafless, shadowless, and swift is Heaven: the Mother stands, the Youngling, loosed, is feeding. Loud hath she lowed, licking Another's offspring. In what world hath the Cow laid down her udder?\np:Seven heroes from the nether part ascended, and from the upper part came eight together. Nine from behind came armed with winnowing-baskets: ten from the front pressed o&#146;er the rock's high ridges.\np:One of the ten, the tawny, shared in common, they send to execute their final purpose. The Mother carries on her breast the Infant of noble form and soothes it while it knows not.\np:The Heroes dressed with fire the fatted wether: the dice were thrown by way of sport and gaming. Two reach the plain amid the heavenly waters, hallowing and with means of purifying.\np:Crying aloud they ran in all directions: One half of them will cook, and not the other. To me hath Indra, this Deva, declared it: He will perform, whose food is wood and butter.\np:I saw a troop advancing from the distance moved, not by wheels but their own God-like nature. The Friendly One seeks human generations, destroying, still new bands of evil beings.\np:These my two Bulls, even Pramara's, are harnessed: drive them not far; here let them often linger. The waters even shall aid him to his object, and the all-cleansing Sun who is above us.\np:This is the thunderbolt which often whirleth down from the lofty misty realm of S&#363;rya. Beyond this realm there is another glory so through old age they pass and feel no sorrow.\np:Bound fast to,every tree the cow is lowing, and thence the man-consuming birds are flying, then all this world, though pressing juice for Indra and strengthening the &#7770;&#7779;i, is affrighted.\np:In the Devas&#146; mansion stood the first-created, and from their separation came the later. Three warm the Earth while holding stores of water, and Two of these convey the murmuring moisture.\np:This is thy life: and do thou mark and know it. As such, hide not thyself in time of battle. He manifests the light and hides the vapour: his foot is never free from robes that veil it.",
    "next": "10028",
    "previous": "10026",
    "book": "10"
  },
  "created": 1638557579593,
  "updated": 1638642699015
}