{
  "key": "10028",
  "title": "RigVeda Hymn 10028",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN XXVIII. Indra. Vasukra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10028.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10027.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10029.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXVIII. Indra. Vasukra.</h3>  \n<p>1. Now all my other friends are here assembled: my Sire-in-law alone hath not come hither.<br> So might he eat the grain and drink the Soma, and, satisfied, return unto; his dwelling.<br> 2 Loud belloweth the Bull whose horns are sharpened: upon the height above earth's breadth he standeth.<br> That man I guard and save in all his troubles who fills my flanks when he hath shed the Soma.<br> 3 Men with the stone press out for thee, O Indra, strong, gladdening Soma, and thereof thou drinkest.<br> Bulls they dress for thee, and of these thou eatest when, Maghavan, with food thou art invited.<br> 4 Resolve for me, O singer, this my riddle: The rivers send their swelling water backward:<br> The fox steals up to the approaching lion: the jackal drives the wild-boar from the brushwood.<br> 5 How shall I solve this riddle, I, the simple, declare the thought of thee the Wise and Mighty?<br> Tell us, well knowing, as befits the season: Whitherward is thy prosperous car advancing?<br> 6 Thus do they magnify me, me the mighty higher than even high heaven is my car-pole.<br> I all at once demolish many thousands: my Sire begot me with no foe to match me.<br> 7 Yea, and the Gods have known me also, Indra, as mighty, fierce and strong in every exploit.<br> Exulting with the bolt I slaughtered V&#7771;tra, and for the offerer oped with might the cow-stall.<br> 8 The Deities approached, they carried axes; splitting the wood they came with their attendants.<br> They laid good timber in the fire-receivers, and burnt the grass up where they found it growing.<br> 9 The hare hath swallowed up the opposing razor: I sundered with a clod the distant mountain.<br> The great will I make subject to the little: the calf shall wax in strength and cat the bullock.<br> 10 There hath the strong-winged eagle left his talon, as a snared lion leaves the trap that caught him.<br> Even the wild steer in his thirst is captured: the leather strap still holds his foot entangled.<br> 11 So may the leather strap their foot entangle who fatten on the viands of the Brahman.<br> They all devour the bulls set free to wander, while they themselves destroy their bodies' vigour.<br> 12 They were well occupied with holy duties who sped in person with their lauds to Soma.<br> Speaking like man, mete to us wealth and booty: in heaven thou hast the name and fame of Hero.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10029.htm\">Next: HYMN XXIX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10028.html",
  "api": "json/hymns/10028.json",
  "data": {
    "title": "HYMN XXVIII. Indra. Vasukra.",
    "describe": "Now all my other friends are here assembled: my Sire-in-law alone hath not come hither.",
    "feecting": "p:Now all my other friends are here assembled: my Sire-in-law alone hath not come hither.\np: So might he eat the grain and drink the Soma, and, satisfied, return unto; his dwelling.\r\np:Loud belloweth the Bull whose horns are sharpened: upon the height above Earth's breadth he standeth. That man I guard and save in all his troubles who fills my flanks when he hath shed the Soma.\np:Men with the stone press out for thee, O Indra, strong, gladdening Soma, and thereof thou drinkest. Bulls they dress for thee, and of these thou eatest when, Indra, with food thou art invited.\np:Resolve for me, O singer, this my riddle: The rivers send their swelling water backward: The fox steals up to the approaching lion: the jackal drives the wild-boar from the brushwood.\np:How shall I solve this riddle, I, the simple, declare the thought of thee the Wise and Mighty? Tell us, well knowing, as befits the season: Whitherward is thy prosperous car advancing?\np:Thus do they magnify me, me the mighty higher than even high Heaven is my car-pole. I all at once demolish many thousands: my Sire begot me with no foe to match me.\np:Yea, and the Devas have known me also, Indra, as mighty, fierce and strong in every exploit. Exulting with the bolt I slaughtered V&#7771;tra, and for the offerer oped with might the cow-stall.\np:The Deities approached, they carried axes; splitting the wood they came with their attendants. They laid good timber in the fire-receivers, and burnt the grass up where they found it growing.\np:The hare hath swallowed up the opposing razor: I sundered with a clod the distant mountain. The great will I make subject to the little: the calf shall wax in strength and cat the bullock.\np:There hath the strong-winged eagle left his talon, as a snared lion leaves the trap that caught him. Even the wild steer in his thirst is captured: the leather strap still holds his foot entangled.\np:May the leather strap their foot entangle who fatten on the offerings of the Brahman. They all devour the bulls set free to wander, while they themselves destroy their bodies' vigour.\np:They were well occupied with holy duties who sped in person with their lauds to Soma. Speaking like man, mete to us wealth and booty: in Heaven thou hast the name and fame of Hero.",
    "next": "10029",
    "previous": "10027",
    "book": "10"
  },
  "created": 1638557584846,
  "updated": 1638791592108
}