{
  "key": "10035",
  "title": "RigVeda Hymn 10035",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN XXXV. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10035.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10034.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10036.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXV. Vi&#347;vedevas.</h3>  \n<p>1. THESE fires associate with Indra are awake, bringing their light when first the Dawn begins to shine.<br> May Heaven and Earth, great Pair, observe our holy work. We claim for us this day the favour of the Gods.<br> 2 Yea, for ourselves we claim the grace of Heaven and Earth, of &#346;arya&#7751;&#257;v&#257;n, of the Hills and Mother Streams.<br> For innocence we pray to S&#363;rya and to Dawn. So may the flowing Soma bring us bliss to-day.<br> 3 May the great Twain, the Mothers, Heaven and Earth, this day preserve us free from sin for peace and happiness.<br> May Morning sending forth her light drive sin afar. We pray to kindled Agni for felicity.<br> 4 May this first Dawn bring us the host of gracious Gods: rich, may it richly shine for us who strive for wealth.<br> The wrath of the malignant may we keep afar. We pray to kindled Agni for feilicity.<br> 5 Dawns, who come forward with the bright beams of the Sun, and at your earliest flushing bring to us the light,<br> Shine ye on us to-day auspicious, for renown. We pray to kindled Agni for felicity.<br> 6 Free from all sickness may the Mornings come to us, and let our fires mount upward with a lofty blaze.<br> The A&#347;vin Pair have harnessed their swift-moving car. We pray to kindled Agni for felicity.<br> 7 Send us to-day a portion choice and excellent, O Savitar, for thou art he who dealeth wealth.<br> I cry to Dhi&#7779;a&#7751;&#257;, Mother of opulence. We pray to kindled Agni for felicity.<br> 8 Further me this declaring of Eternal Law, the Law of Gods, as we mortals acknowledge it!<br> The Sun goes up beholding all the rays of morn. We pray to kindled Agni for felicity.<br> 9 This day we pray with innocence in strewing grass, adjusting pressing-stones, and perfecting the hymn.<br> Thou in the &#256;dityas&#146; keeping movest restlessly. We pray to kindled Agni for felicity.<br> 10 To our great holy grass I bid the Gods at morn to banquet, and will seat them as the seven priests,&#151;<br> Varu&#7751;a, Indra, Mitra, Bhaga for our gain. We pray to kindled Agni for felicity.<br> 11 Come hither, O &#256;dityas, for our perfect weal: accordant help our sacrifice that we may thrive.<br> P&#363;&#7779;an, B&#7771;haspati, Bhaga, both A&#347;vins, and enkindled Agni we implore for happiness.<br> 12 &#256;dityas, Gods, vouchsafe that this our home may be praise-worthy, prosperous, our heroes' sure defence,<br> For cattle, for our sons, for progeny, for life. We pray to kindled Agni for felicity.<br> 13 This day may all the Maruts, all he near us with aid: may all our fires be well enkindled.<br> May all Gods come to us with gracious favour. May spoil and wealth he ours, and all possessions.<br> 14 He whom ye aid, O Deities, in battle, whom ye protect and rescue from affliction,<br> Who fears no danger at your milk-libation, -such may we be to feast the Gods, ye Mighty.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10036.htm\">Next: HYMN XXXVI. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10035.html",
  "api": "json/hymns/10035.json",
  "data": {
    "key": "10035",
    "title": "HYMN XXXV. Devas.",
    "describe": "THESE fires associate with Indra are awake, bringing their light when first the Dawn begins to shine.",
    "feecting": "p:THESE fires associate with Indra are awake, bringing their light when first the Dawn begins to shine.\np: May Heaven and Earth, great Pair, observe our holy work. We claim for us this day the favour of the Devas.\r\np:Yea, for ourselves we claim the grace of Heaven and Earth, of Śaryaṇāvān, of the Hills and Mother Streams. For innocence we pray to Sūrya and to Dawn. May the flowing Soma bring us bliss to-day.\np:May the great Twain, the Mothers. Heaven and Earth, this day preserve us free from sin for peace and happiness. May Morning sending forth her light drive sin afar. We meditate to kindled Agni for felicity.\np:May this first Dawn bring us the host of gracious Devas: rich. May it richly shine for us who strive for wealth. The wrath of the malignan. May we keep afar. We meditate to kindled Agni for feilicity.\np:Dawns, who come forward with the bright beams of the Sun, and at your earliest flushing bring to us the light, Shine ye on us to-day auspicious, for renown. We meditate to kindled Agni for felicity.\np:Free from all sicknes. May the Mornings come to us, and let our fires mount upward with a lofty blaze. The Aśvin Pair have harnessed their swift-moving car. We meditate to kindled Agni for felicity.\np:Send us to-day a portion choice and excellent, O Indra, for thou art he who dealeth wealth. I cry to Dhiṣaṇā, Mother of opulence. We meditate to kindled Agni for felicity.\np:Further me this declaring of Eternal Law, the Law of Devas, as we mortals acknowledge it! The Sun goes up beholding all the rays of morn. We meditate to kindled Agni for felicity.\np:This day we pray with innocence in strewing grass, adjusting pressing-stones, and perfecting the hymn. Thou in the Ādityas’ keeping movest restlessly. We meditate to kindled Agni for felicity.\np:To our great holy grass I bid the Devas at morn to banquet, and will seat them as the seven monks. Indra, Indra, Mitra, Bhaga for our gain. We meditate to kindled Agni for felicity.\np:Come hither, O Ādityas, for our perfect weal: accordant help our offering that we may thrive. Pūṣan, Soma, Bhaga, both Aśvins, and enkindled Agni we implore for happiness.\np:Ādityas, Devas, vouchsafe that this our hom. May be praise-worthy, prosperous, our heroes' sure defence, for cattle, for our sons, for progeny, for life. We meditate to kindled Agni for felicity.\np:This da. May all the Devas, all he near us with aid. May all our fires be well enkindled. May all Devas come to us with gracious favour. May spoil and wealth he ours, and all possessions.\np:He whom ye aid, O Deities, in battle, whom ye protect and rescue from affliction, who fears no danger at your milk-libation, -suc. May we be to feast the Devas, ye Mighty.",
    "meta": {
      "next": "10036",
      "previous": "10034",
      "book": "10",
      "source": "https://sacred-texts.com/hin/rigveda/rv10035.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv10035.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "10035",
            "title": "HYMN XXXV. Devas."
          }
        ]
      },
      {
        "name": "O Ādityas",
        "hymns": [
          {
            "key": "10035",
            "title": "HYMN XXXV. Devas."
          }
        ]
      },
      {
        "name": "O Deities",
        "hymns": [
          {
            "key": "10035",
            "title": "HYMN XXXV. Devas."
          }
        ]
      }
    ]
  },
  "created": 1638557621932,
  "updated": 1638830293016
}