{
  "key": "10036",
  "title": "RigVeda Hymn 10036",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN XXXVI. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10036.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10035.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10037.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XXXVI. Vi&#347;vedevas.</h3>  \n<p>1. THERE are the Dawn and Night, the grand and beauteous Pair, Earth, Heaven, and Varu&#7751;a, Mitra, and Aryaman.<br> Indra I call, the Maruts, Mountains, and the Floods, &#256;dityas, Heaven and Earth, the Waters, and the Sky.<br> 2 May Dyaus and Prthivi, wise, true to Holy Law, keep us in safety from distress and injury.<br> Let not malignant Nirrti rule over us. We crave to-day this gracious favour of the Gods.<br> 3 Mother of Mitra and of opulent Varu&#7751;a, may Aditi preserve us safe from all distress.<br> May we obtain the light of heaven without a foe. We crave this gracious favour of the Gods to-day.<br> 4 May ringing press-stones keep the R&#257;k&#7779;asas afar, ill dream, and Nirrti, and each voracious fiend.<br> May the &#256;dityas and the Maruts shelter us. We crave this gracious favour of the Gods to-day.<br> 5 Full flow libations; on our grass let Indra sit; B&#7771;haspati the singer laud with S&#257;ma hymns!<br> Wise be our hearts' imaginings that we may live. We crave this gracious favour of the Gods to-day.<br> 6 Ye A&#347;vins, make our sacrifice ascend to heaven, and animate the rite that it may send us bliss,<br> Offered with holy oil, with forward-speeding rein. We crave the gracious favour of the Gods to-day.<br> 7 Hither I call the band of Maruts, swift to hear, great, purifying, bringing bliss, to he our Friends.<br> May we increase our wealth to glorify our name. We crave this graciousfavour of the Gods to-day.<br> 8 We bring the Stay of Life, who makes the waters swell, swift-hearing, Friend of Gods, who waits on sacrifice.<br> May we control that Power, Soma whose rays are bright. We crave this gracious favour of the Gods to-day.<br> 9 Alive ourselves, with living sons, devoid of guilt, may we win this with winners by fair means to win.<br> Let the prayer-haters bear our sin to every side. We crave this gracious favour of the Gods to-day.<br> 10 Hear us, O ye who claim the worship of mankind, and give us, O ye Gods, the gift for which we pray,<br> Victorious wisdom, fame with heroes and with wealth. We crave to-day this gracious favour of the Gods.<br> 11 We crave the gracious favour of the Gods to-day, great favour of great Gods, sublime and free from foes,<br> That we may gain rich treasure sprung from hero sons. We crave this gracious favour of the Gods to-day.<br> 12 In great enkindled Agni's keeping, and, for bliss, free from all sin before Mitra and Varu&#7751;a.<br> May we share Savitar's best animating help. We crave this gracious favour of the Gods to-day.<br> 13 All ye, the Gods whom Savitar the Father of truth, and Varu&#7751;a and Mitra govern,<br> Give us prosperity with hero children, and opulence in kine and various treasure.<br> 14 Savitar, Savitar from cast and westward, Savitar, Savitar from north and southward,<br> Savitar send us perfect health and comfort, Savitar let our days of life be lengthened!</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10037.htm\">Next: HYMN XXXVII. S&#363;rya.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10036.html",
  "api": "json/hymns/10036.json",
  "data": {
    "title": "HYMN XXXVI. Vi&#347;vedevas.",
    "describe": "THERE are the Dawn and Night, the grand and beauteous Pair, Earth.",
    "feecting": "p:THERE are the Dawn and Night, the grand and beauteous Pair, Earth. Heaven, and Varu&#7751;a, Mitra, and Aryaman.\np: Indra I call, the Devas, Mountains, and the Floods, &#256;dityas. Heaven and Earth, the Waters, and the Sky.\r\np:May Devas and Prthivi, wise, true to Holy Law, keep us in safety from distress and injury. Let not malignant Nirrti rule over us. We crave to-day this gracious favour of the Devas.\np:Mother of Mitra and of opulent Varu&#7751;a. May Aditi preserve us safe from all distress. May we obtain the light of Heaven without a foe. We crave this gracious favour of the Devas to-day.\np:May ringing press-stones keep the R&#257;k&#7779;asas afar, ill dream, and Nirrti, and each voracious fiend. May the &#256;dityas and the Devas shelter us. We crave this gracious favour of the Devas to-day.\np:Full flow libations; on our grass let Indra sit; B&#7771;haspati the singer laud with S&#257;ma hymns! Wise be our hearts' imaginings that we may live. We crave this gracious favour of the Devas to-day.\np:Ye A&#347;vins, make our offering ascend to Heaven, and animate the rite that i. May send us bliss, Offered with holy oil, with forward-speeding rein. We crave the gracious favour of the Devas to-day.\np:Hither I call the band of Devas, swift to hear, great, purifying, bringing bliss, to he our Friends. May we increase our wealth to glorify our name. We crave this graciousfavour of the Devas to-day.\np:We bring the Stay of Life, who makes the waters swell, swift-hearing, Friend of Devas, who waits on offering. May we control that Power, Soma whose rays are bright. We crave this gracious favour of the Devas to-day.\np:Alive ourselves, with living sons, devoid of guilt. May we win this with winners by fair means to win. Let the prayer-haters bear our sin to every side. We crave this gracious favour of the Devas to-day.\np:Hear us, O ye who claim the worship of mankind, and give us, O ye Devas, the gift for which we meditate, Victorious wisdom, fame with heroes and with wealth. We crave to-day this gracious favour of the Devas.\np:We crave the gracious favour of the Devas to-day, great favour of great Devas, sublime and free from foes, that we may gain rich treasure sprung from hero sons. We crave this gracious favour of the Devas to-day.\np:In great enkindled Agni's keeping, and, for bliss, free from all sin before Mitra and Varu&#7751;a. May we share Indra's best animating help. We crave this gracious favour of the Devas to-day.\np:All yes whom Indra the Father of truth, and Varu&#7751;a and Mitra govern, Give us prosperity with hero children, and opulence in kine and various treasure.\np:Indra, Indra from cast and westward, Indra, Indra from north and southward, Indra send us perfect health and comfort, Indra let our days of life be lengthened!",
    "next": "10037",
    "previous": "10035",
    "book": "10"
  },
  "created": 1638557627694,
  "updated": 1638791781136
}