{
  "key": "10045",
  "title": "RigVeda Hymn 10045",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN XLV. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10045.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10044.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10046.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XLV. Agni.</h3>  \n<p>1. FIRST Agni sprang to life from out of Heaven: the second time from us came J&#257;tavedas.<br> Thirdly the Manly-souled was in the waters. The pious lauds and kindles him the Eternal.<br> 2 Agni, we know thy three powers in three stations, we know thy forms in many a place divided.<br> We know what name supreme thou hast in secret: we know the source from which thou hast proceeded.<br> 3 The Manly-souled lit thee in sea and waters, man's Viewer lit thee in the breast of heaven,<br> There as thou stoodest in the third high region the Steers increased thee in the water's bosom.<br> 4 Agni roared out, like Dyaus what time he thunders: he licked the ground about the plants he flickered.<br> At once, when born, he looked around enkindled, and lightened heaven and earth within with splendour.<br> 5 The spring of glories and support of riches, rouser of thoughts and guardian of the Soma,<br> Good Son of Strength, a King amid the waters, in forefront of the Dawns he shines enkindled.<br> 6 Germ of the world, ensign of all creation, be sprang to life and filled the earth and heavens.<br> Even the firm rock he cleft when passing over, when the Five Tribes brought sacrifice to Agni.<br> 7 So among mortals was Immortal Agni stablished as holy wise and willing envoy.<br> He waves the red smoke that he lifts above him, striving to reach the heavens with radiant lustre.<br> 8 Like gold to look on, far he shone refulgent, beaming imperishable life for glory,<br> Agni by vital powers became immortal when his prolific Father Dyaus begat him.<br> 9 Whoso this day, O God whose flames are lovely, prepares a cake, O Agni, mixt with butter,<br> Lead thou and further him to higher fortune, to bliss bestowed by Gods, O thou Most Youthful.<br> 10 Endow him, Agni, with a share of glory, at every song of praise sung forth enrich him.<br> Dear let him be to S&#363;rya, dear to Agni, preeminent with son and children's children.<br> 11 While, Agni, day by day men pay thee worship they win themselves all treasures worth the wishing.<br> Allied with thee, eager and craving riches, they have disclosed the stable filled with cattle.<br> 12 Agni, the Friend of men, the Soma's keeper, Vai&#347;v&#257;nara, hath been lauded by the &#7770;&#7779;is.<br> We will invoke benignant Earth and Heaven: ye Deities, give us wealth with hero children.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10046.htm\">Next: HYMN XLVI. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10045.html",
  "api": "json/hymns/10045.json",
  "data": {
    "title": "HYMN XLV. Agni.",
    "describe": "FIRST Agni sprang to life from out of Heaven: the second time from us came J&#257;",
    "feecting": "p:FIRST Agni sprang to life from out of Heaven: the second time from us came J&#257;tavedas.\np: Thirdly the Manly-souled was in the waters. The pious lauds and kindles him the Eternal.\r\np:Agni, we know thy three powers in three stations, we know thy forms in many a place divided. We know what name supreme thou hast in secret: we know the source from which thou hast proceeded.\np:The Manly-souled lit thee in sea and waters, man's Viewer lit thee in the breast of Heaven, there as thou stoodest in the third high region the Steers increased thee in the water's bosom.\np:Agni roared out, like Devas what time he thunders: he licked the ground about the plants he flickered. At once, when born, he looked around enkindled, and lightened Heaven and Earth within with splendour.\np:The spring of glories and support of riches, rouser of thoughts and guardian of the Soma, Good Son of Strength, a King amid the waters, in forefront of the Dawns he shines enkindled.\np:Germ of the world, ensign of all creation, be sprang to life and filled the Earth and heavens. Even the firm rock he cleft when passing over, when the Five Tribes brought offering to Agni.\np:So among mortals was Immortal Agni stablished as holy wise and willing envoy. He waves the red smoke that he lifts above him, striving to reach the heavens with radiant lustre.\np:Like gold to look on, far he shone refulgent, beaming imperishable life for glory, Agni by vital powers became immortal when his prolific Father Devas begat him.\np:Whoso this day, O Deva whose flames are lovely, prepares a cake, O Agni, mixt with butter, Lead thou and further him to higher fortune, to bliss bestowed by Devas, O thou Most Youthful.\np:Endow him, Agni, with a share of glory, at every song of praise sung forth enrich him. Dear let him be to S&#363;rya, dear to Agni, preeminent with son and children's children.\np:While, Agni, day by day men pay thee worship they win themselves all treasures worth the wishing. Allied with thee, eager and craving riches, they have disclosed the stable filled with cattle.\np:Agni, the Friend of men, the Soma's keeper, Vai&#347;v&#257;nara, hath been lauded by the &#7770;&#7779;is. We will invoke benignant Earth and Heaven: ye Deities, give us wealth with hero children.",
    "next": "10046",
    "previous": "10044",
    "book": "10"
  },
  "created": 1638557676141,
  "updated": 1638647073084
}