{
  "key": "10053",
  "title": "RigVeda Hymn 10053",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LIII. Agni Saucika Gods.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10053.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10052.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10054.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LIII. Agni Saucika Gods.</h3>  \n<p>1. HE hath arrived, he whom we sought with longing, who skilled in sacrifice well knows its courses.<br> Let him discharge his sacrificial duties: let him sit down as Friend who was before<br> Us.<br> 2 Best Priest, he hath been won by being seated, for he hath looked on the well-ordered viands.<br> Come, let usworship Gods who must be worshipped, and pouring oil, laud those who should be lauded.<br> 3 Now hath he made the feast of Gods effective: now have we found the secret tongue of worship.<br> Now hath he come, sweet, robed in vital vigour, and made our calling on the Gods effective.<br> 4 This prelude of my speech I now will utter, whereby we Gods may quell our Asura foemen.<br> Eaters of strengthening food who merit worship, O ye Five Tribes, be pleased with mine oblation.<br> 5 May the Five Tribes be pleased with mine oblation, and the Cow's Sons and all who merit worship.<br> From earthly trouble may the earth protect us, and air's mid realm from woe that comes from heaven.<br> 6 Spinning the thread, follow the region's splendid light: guard thou the path ways well which wisdom hath prepared.<br> Weave ye the knotless labour of the bards who sing: be Manu thou, and bring the Heavenly People forth.<br> 7 Lovers of Soma, bind the chariot traces fast: set ye the reins in order and embellish them.<br> Bring hitherward the car with seats where eight may sit, whereon the Gods have brought the treasure that we love.<br> 8 Here flows Asmanvati: hold fast each other, keep yourselves up, and pass, my friends, the river.<br> There let us leave the Powers that brought no profit, and cross the flood to Powers that are auspicious.<br> 9 Tva&#7779;&#7789;ar, most deft of workmen, knew each magic art, bringing most blessed bowls that hold the drink of Gods.<br> His axe, wrought of good metal, he is sharpening now, wherewith the radiant Brahma&#7751;aspati will cut.<br> 10 Now, O ye Sapient Ones, make ye the axes sharp wherewith ye fashion bowls to hold the Am&#7771;ta.<br> Knowing the secret places make ye ready that whereby the Gods have gotten immortality.<br> 11 Ye with a secret tongue and dark intention laid the maiden deep within, the calf within the mouth.<br> They evermore are near us with their gracious help: successful is the song that strives for victory.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10054.htm\">Next: HYMN LIV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10053.html",
  "api": "json/hymns/10053.json",
  "data": {
    "title": "HYMN LIII. Agni Saucika Gods.",
    "describe": "HE hath arrived, he whom we sought with longing, who skilled in offering well knows its courses.",
    "feecting": "p:HE hath arrived, he whom we sought with longing, who skilled in offering well knows its courses.\np: Let him discharge his sacrificial duties: let him sit down as Friend who was before Us.\r\np:Best Monk, he hath been won by being seated, for he hath looked on the well-ordered offerings. Come, let usworship Devas who must be worshipped, and pouring oil, laud those who should be lauded.\np:Now hath he made the feast of Devas effective: now have we found the secret tongue of worship. Now hath he come, sweet, robed in vital vigour, and made our calling on the Devas effective.\np:This prelude of my speech I now will utter, whereby we Deva. May quell our Devas foemen. Eaters of strengthening food who merit worship, O ye Five Tribes, be pleased with mine oblation.\np:May the Five Tribes be pleased with mine oblation, and the Cow's Sons and all who merit worship. From earthly troubl. May the Earth protect us, and air's mid realm from woe that comes from Heaven.\np:Spinning the thread, follow the region's splendid light: guard thou the path ways well which wisdom hath prepared. Weave ye the knotless labour of the bards who sing: be Manu thou, and bring the Heavenly People forth.\np:Lovers of Soma, bind the chariot traces fast: set ye the reins in order and embellish them. Bring hitherward the car with seats where eigh. May sit, whereon the Devas have brought the treasure that we love.\np:Here flows Asmanvati: hold fast each other, keep yourselves up, and pass, my friends, the river. There let us leave the Powers that brought no profit, and cross the flood to Powers that are auspicious.\np:Tva&#7779;&#7789;ar, most deft of workmen, knew each magic art, bringing most blessed bowls that hold the drink of Devas. His axe, wrought of good metal, he is sharpening now, wherewith the radiant Brahma&#7751;aspati will cut.\np:Now, O ye Sapient Ones, make ye the axes sharp wherewith ye fashion bowls to hold the Am&#7771;ta. Knowing the secret places make ye ready that whereby the Devas have gotten immortality.\np:Ye with a secret tongue and dark intention laid the maiden deep within, the calf within the mouth. They evermore are near us with their gracious help: successful is the song that strives for victory.",
    "next": "10054",
    "previous": "10052",
    "book": "10"
  },
  "created": 1638557718994,
  "updated": 1638791253584
}