{
  "key": "10058",
  "title": "RigVeda Hymn 10058",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LVIII. M&#257;nas or Spirit.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10058.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10057.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10059.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LVIII. M&#257;nas or Spirit.</h3>  \n<p>1. THY spirit, that went far away to Yama to Vivasv&#257;n's Son,<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 2 Thy spirit, that went far away, that passed away to earth and heaven,<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 3 Thy spirit, that went far away, away to the four-cornered earth,<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 4 Thy spirit, that went far away to the four quarters of the world,<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 5 Thy spirit, that went far away, away unto the billowy sea,<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 6 Thy spirit, that went far away to beams of light that flash and flow,<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 7 Thy spirit, that went far away, went to the waters and the plants,<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 8 Thy spirit, that went far away, that visited the Sun and Dawn.<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 9 Thy spirit, that went far away, away to lofty mountain heights,<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 10 Thy spirit, that went far away into this All, that lives and moves,<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 11 Thy spirit, that went far away to distant realms beyond our ken,<br> We cause to come to thee again that thou mayst live and sojourn here.<br> 12 Thy spirit, that went far away to all that is and is to be,<br> We cause to come to thee again that thou mayst live and sojourn heie.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10059.htm\">Next: HYMN LIX. Nirrti and Others.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10058.html",
  "api": "json/hymns/10058.json",
  "data": {
    "key": "10058",
    "title": "HYMN LVIII. Mānas or Spirit.",
    "describe": "THY spirit, that went far away to Yama to Vivasvān's Son, We cause to come to thee again that tho.",
    "feecting": "p:THY spirit, that went far away to Yama to Vivasvān's Son, We cause to come to thee again that tho. Mayst live and sojourn here.\np:Thy spirit, that went far away, that passed away to Earth and Heaven, We cause to come to thee again that tho. Mayst live and sojourn here.\np:Thy spirit, that went far away, away to the four-cornered Earth, We cause to come to thee again that tho. Mayst live and sojourn here.\np:Thy spirit, that went far away to the four quarters of the world, We cause to come to thee again that tho. Mayst live and sojourn here.\np:Thy spirit, that went far away, away unto the billowy sea, We cause to come to thee again that tho. Mayst live and sojourn here.\np:Thy spirit, that went far away to beams of light that flash and flow, We cause to come to thee again that tho. Mayst live and sojourn here.\np:Thy spirit, that went far away, went to the waters and the plants, We cause to come to thee again that tho. Mayst live and sojourn here.\np:Thy spirit, that went far away, that visited the Sun and Dawn.\np: We cause to come to thee again that tho. Mayst live and sojourn here.\r\np:Thy spirit, that went far away, away to lofty mountain heights, We cause to come to thee again that tho. Mayst live and sojourn here.\np:Thy spirit, that went far away into this All, that lives and moves, We cause to come to thee again that tho. Mayst live and sojourn here.\np:Thy spirit, that went far away to distant realms beyond our ken, We cause to come to thee again that tho. Mayst live and sojourn here.\np:Thy spirit, that went far away to all that is and is to be, We cause to come to thee again that tho. Mayst live and sojourn heie.",
    "meta": {
      "next": "10059",
      "previous": "10057",
      "book": "10",
      "source": "https://sacred-texts.com/hin/rigveda/rv10058.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv10058.htm"
    },
    "deities": []
  },
  "created": 1638557745266,
  "updated": 1638830293092
}