{
  "key": "10055",
  "title": "RigVeda Hymn 10055",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10055.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10054.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10056.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LV. Indra.</h3>  \n<p>1. FAR is that secret name by which, in terror, the worlds invoked thee and thou gavest vigour<br> The earth and heaven thou settest near each other, and Maghavan, madest bright thy Brother's Children.<br> 2 Great is that secret name and far-extending, whereby thou madest all that is and shall be.<br> The Five Tribes whom he loveth well have entered the light he loveth that was made aforetime.<br> 3 He filled the heaven and earth and all between them, Gods five times sevenfold in their proper seasons.<br> With four-and-thirty lights he looks around him, lights of one colour though their ways are divers.<br> 4 As first among the lights, O Dawn, thou shonest, whereby thou broughtest forth the Stay of Increase,<br> Great art thou, matchless is thine Asura nature, who, high above, art kin to those beneath thee.<br> 5 The old hath waked the young Moon from his slumber who runs his circling course with many round him.<br> Behold the Gods&#146; high wisdom in its greatness: he who died yesterday to-day is living.<br> 6 Strong is the Red Bird in his strength, great Hero, who from of old hath had no nest to dwell in.<br> That which he knows is truth and never idle: he wins and gives the wealth desired of many.<br> 7 Through these the Thunderer gained strong manly vigour, through whom he waxed in power to smite down V&#7771;tra,&#151;<br> Who through the might of Indra's operation came forth as Gods in course of Law and Order.<br> 8 All-strong, performing works with his companion, All-marking, rapid Victor, Curse-averter,<br> The Hero, waxing, after draughts of Soma, blew far from heaven the Dasyus with his weapon.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10056.htm\">Next: HYMN LVI. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10055.html",
  "api": "json/hymns/10055.json",
  "data": {
    "key": "10055",
    "title": "HYMN LV. Indra.",
    "describe": "FAR is that secret name by which, in terror, the worlds invoked thee and thou gavest vigour The Earth and Heaven thou settest near each other, and Indra, madest bright thy Brother's Children.",
    "feecting": "p:FAR is that secret name by which, in terror, the worlds invoked thee and thou gavest vigour The Earth and Heaven thou settest near each other, and Indra, madest bright thy Brother's Children.\np:Great is that secret name and far-extending, whereby thou madest all that is and shall be.\np: The Five Tribes whom he loveth well have entered the light he loveth that was made aforetime.\r\np:He filled the Heaven and Earth and all between them, Devas five times sevenfold in their proper seasons. With four-and-thirty lights he looks around him, lights of one colour though their ways are divers.\np:As first among the lights, O Dawn, thou shonest, whereby thou broughtest forth the Stay of Increase, Great art thou, matchless is thine Devas nature, who, high above, art kin to those beneath thee.\np:The old hath waked the young Moon from his slumber who runs his circling course with many round him. Behold the Devas’ high wisdom in its greatness: he who died yesterday to-day is living.\np:Strong is the Red Bird in his strength, great Hero, who from of old hath had no nest to dwell in. That which he knows is truth and never idle: he wins and gives the wealth desired of many.\np:Through these the Thunderer gained strong manly vigour, through whom he waxed in power to smite down Vṛtra. Who through the might of Indra's operation came forth as Devas in course of Law and Order.\np:All-strong, performing works with his companion, All-marking, rapid Victor, Curse-averter, the Hero, waxing, after draughts of Soma, blew far from Heaven the Dasyus with his weapon.",
    "meta": {
      "next": "10056",
      "previous": "10054",
      "book": "10",
      "source": "https://sacred-texts.com/hin/rigveda/rv10055.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv10055.htm"
    },
    "deities": [
      {
        "name": "O Dawn",
        "hymns": [
          {
            "key": "10055",
            "title": "HYMN LV. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638557729488,
  "updated": 1638830293089
}