{
  "key": "10056",
  "title": "RigVeda Hymn 10056",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LVI. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10056.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10055.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10057.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LVI. Vi&#347;vedevas.</h3>  \n<p>1. HERE is one light for thee, another yonder: enter the third and he therewith united.<br> Uniting with a body be thou welcome, dear to the Gods in their sublimest birthplace.<br> 2 Bearing thy body, Vajin, may thy body afford us blessing and thyself protection.<br> Unswerving, stablish as it were in heaven thine own light as the mighty God's supporter.<br> 3 Strong Steed art thou: go to the yearning Maidens with vigour, happily go to heaven and praises:<br> Fly happily to the Gods with easy passage, according to the first and faithful statutes.<br> 4 Part of their grandeur have the Fathers also gained: the Gods have seated mental power in them as Gods.<br> They have embraced within themselves all energies, which, issuing forth, again into their bodies pass.<br> 5 They strode through all the region with victorious might, establishing the old immeasurable laws.<br> They compassed in their bodies all existing things, and streamed forth offipring in many successive forms.<br> 6 In two ways have the sons established in his place the Asura who finds the light, by the third act,<br> As fathers, they have set their heritage on earth, their offspring, as a thread continuously spun out.<br> 7 As in a ship through billows, so through regions of air, with blessings, through toils and troubles<br> Hath B&#7771;haduktha brought his seed with glory, and placed it here and in the realms beyond us.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10057.htm\">Next: HYMN LVIL Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10056.html",
  "api": "json/hymns/10056.json",
  "data": {
    "title": "HYMN LVI. Vi&#347;vedevas.",
    "describe": "HERE is one light for thee, another yonder: enter the third and he therewith united.",
    "feecting": "p:HERE is one light for thee, another yonder: enter the third and he therewith united.\np: Uniting with a body be thou welcome, dear to the Devas in their sublimest birthplace.\r\np:Bearing thy body, Vajin. May thy body afford us blessing and thyself protection. Unswerving, stablish as it were in Heaven thine own light as the mighty Deva's supporter.\np:Strong Steed art thou: go to the yearning Maidens with vigour, happily go to Heaven and praises: Fly happily to the Devas with easy passage, according to the first and faithful statutes.\np:Part of their grandeur have the Fathers also gained: the Devas have seated mental power in them as Devas. They have embraced within themselves all energies, which, issuing forth, again into their bodies pass.\np:They strode through all the region with victorious might, establishing the old immeasurable laws. They compassed in their bodies all existing things, and streamed forth offipring in many successive forms.\np:In two ways have the son established in his place the Devas who finds the light, by the third act, as fathers, they have set their heritage on Earth, their offspring, as a thread continuously spun out.\np:As in a ship through billows, so through regions of air, with blessings, through toils and troubles Hath B&#7771;haduktha brought his seed with glory, and placed it here and in the realms beyond us.",
    "next": "10057",
    "previous": "10055",
    "book": "10"
  },
  "created": 1638557734751,
  "updated": 1638647073096
}