{
  "key": "10073",
  "title": "RigVeda Hymn 10073",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LXXIII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10073.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10072.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10074.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXIII. Indra.</h3>  \n<p>1. THOU wast born mighty for victorious valour, exulting, strongest, full of pride and courage.<br> There, even there, the Maruts strengthened Indra when. his most rapid Mother stirred the Hero.<br> 2 There with fiend's ways e&#146;en P&#7771;&#347;ni was seated: with much laudation they exalted Indra.<br> As if encompassed by the Mighty-footed, from darkness, near at hand, forth came the Children.<br> 3 High are thy feet when on thy way thou goest: the strength thou foundest here hath lent thee vigour.<br> Thousand hyenas in thy mouth thou holdest. O Indra, mayst thou turn the A&#347;vins hither.<br> 4 Speeding at once to sacrifice thou comest for friendship thou art bringing both N&#257;satyas.<br> Thou hadst a thousand treasures in possession. The A&#347;vins, O thou Hero, gave thee riches.<br> 5 Glad, for the race that rests on holy Order, with friends who hasten to their goal, hath Indra<br> With these his magic powers assailed the Dasyu: he cast away the gloomy mists, the darkness.<br> 6 Two of like name for him didst thou demolish, as Indra striking down the car of U&#7779;as.<br> With thy beloved lofty Friends thou camest, and with the assurance of thine heart thou slewest.<br> 7 War-loving Namuci thou smotest, robbing the D&#257;sa of his magic for the &#7770;&#7779;i.<br> For man thou madest ready pleasant pathways, paths leading as it were directly God-ward.<br> 8 These names of thine thou hast fulfilled completely: as Lord, thou boldest in thine arm, O Indra.<br> In thee, through thy great might, the Gods are joyful: the roots of trees hast thou directed upward.<br> 9 May the sweet Soma juices make him happy to cast his quoit that lies in depth of waters.<br> Thou from the udder which o&#146;er earth is fastened hast poured the milk into the kine and herbage.<br> 10 When others call him offspring of the Courser, my meaning is that Mighty Power produced him.<br> He came from Manyu and remained in houses: whence he hath sprung is known to Indra only.<br> 11 Like birds of beauteous wing the Priyamedhas, &#7770;&#7779;is, imploring, have come nigh to Indra:<br> Dispel the darkness and fill full our vision deliver us as men whom snares entangle.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10074.htm\">Next: HYMN LXXIV. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10073.html",
  "api": "json/hymns/10073.json",
  "data": {
    "key": "10073",
    "title": "HYMN LXXIII. Indra.",
    "describe": "THOU wast born mighty for victorious valour, exulting, strongest, full of pride and courage.",
    "feecting": "p:THOU wast born mighty for victorious valour, exulting, strongest, full of pride and courage.\np: There, even there, the Devas strengthened Indra when. his most rapid Mother stirred the Hero.\r\np:There with fiend's ways e’en Pṛśni was seated: with much laudation they exalted Indra. As if encompassed by the Mighty-footed, from darkness, near at hand, forth came the Children.\np:High are thy feet when on thy way thou goest: the strength thou foundest here hath lent thee vigour. Thousand hyenas in thy mouth thou holdest. O Indra, mayst thou turn the Indra hither.\np:Speeding at once to offering thou comest for friendship thou art bringing both Nāsatyas. Thou hadst a thousand treasures in possession. The Indra, O thou Hero, gave thee riches.\np:Glad, for the race that rests on holy Order, with friends who hasten to their goal, hath Indra With these his magic powers assailed the Dasyu: he cast away the gloomy mists, the darkness.\np:Two of like name for him didst thou demolish, as Indra striking down the car of Uṣas. With thy beloved lofty Friends thou camest, and with the assurance of thine heart thou slewest.\np:War-loving Namuci thou smotest, robbing the Dāsa of his magic for the Ṛṣi. For man thou madest ready pleasant pathways, paths leading as it were directly Deva-ward.\np:These names of thine thou hast fulfilled completely: as Lord, thou boldest in thine arm, O Indra. In thee, through thy great mights are joyful: the roots of trees hast thou directed upward.\np:May the sweet Soma juices make him happy to cast his quoit that lies in depth of waters. Thou from the udder which o’er Earth is fastened hast poured the milk into the kine and herbage.\np:When others call him offspring of the Courser, my meaning is that Mighty Power produced him. He came from Manyu and remained in houses: whence he hath sprung is known to Indra only.\np:Like birds of beauteous wing the Priyamedhas, Ṛṣis, imploring, have come nigh to Indra: Dispel the darkness and fill full our vision deliver us as men whom snares entangle.",
    "meta": {
      "next": "10074",
      "previous": "10072",
      "book": "10",
      "original": "https://sacred-texts.com/hin/rigveda/rv10073.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv10073.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "10073",
            "title": "HYMN LXXIII. Indra."
          },
          {
            "key": "10073",
            "title": "HYMN LXXIII. Indra."
          }
        ]
      },
      {
        "name": "O thou",
        "hymns": [
          {
            "key": "10073",
            "title": "HYMN LXXIII. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638557825071,
  "updated": 1667442754287
}