{
  "key": "10075",
  "title": "RigVeda Hymn 10075",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LXXV. The Rivers.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10075.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10074.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10076.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXV. The Rivers.</h3>  \n<p>1. THE singer, O ye Waters in Vivasv&#257;n's place, shall tell your grandeur forth that is beyond compare.<br> The Rivers have come forward triply, seven and seven. Sindhu in might surpasses all the streams that flow.<br> 2 Varu&#7751;a cut the channels for thy forward course, O Sindhu, when thou rannest on to win the race.<br> Thou speedest o&#146;er precipitous ridges of the earth, when thou art Lord and Leader of these moving floods.<br> 3 His roar is lifted up to heaven above the earth: he puts forth endless vigour with a flash of light.<br> Like floods of rain that fall in thunder from the cloud, so Sindhu rushes on bellowing like a bull.<br> 4 Like mothers to their calves, like milch kine with their milk, so, Sindhu, unto thee the roaring rivers run.<br> Thou leadest as a warrior king thine army's wings what time thou comest in the van of these swift streams.<br> 5 Favour ye this my laud, O Gan!g&#257;, Yamun&#257;, O Sutudri, Paru&#7779;&#7751;&#299; and Sarasvat&#299;:<br> With Asikni, Vitasta, O Marudvrdha, O &#256;rj&#299;k&#299;ya with Susoma hear my call.<br> 6 First with Trstama thou art eager to flow forth, with Ras&#257;, and Susartu, and with Svetya here,<br> With Kubha; and with these, Sindhu and Mehatnu, thou seekest in thy course Krumu and Gomati.<br> 7 Flashing and whitely-gleaming in her mightiness, she moves along her ample volumes through the realms,<br> Most active of the active, Sindhu unrestrained, like to a dappled mare, beautiful, fair to see.<br> 8 Rich in good steeds is Sindhu, rich in cars and robes, rich in gold, nobly-fashioned, rich in ample wealth.<br> Blest Silamavati and young Urnavati invest themselves with raiment rich in store of sweets.<br> 9 Sindhu hath yoked her car, light-rolling, drawn by steeds, and with that car shall she win booty in this fight.<br> So have I praised its power, mighty and unrestrained, of independent glory, roaring as it runs.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10076.htm\">Next: HYMN LXXVI. Press-stones.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10075.html",
  "api": "json/hymns/10075.json",
  "data": {
    "key": "10075",
    "title": "HYMN LXXV. The Rivers.",
    "describe": "THE singer, O ye Waters in Vivasvān's place, shall tell your grandeur forth that is beyond compare.",
    "feecting": "p:THE singer, O ye Waters in Vivasvān's place, shall tell your grandeur forth that is beyond compare.\np: The Rivers have come forward triply, seven and seven. Sindhu in might surpasses all the streams that flow.\r\np:Indra cut the channels for thy forward course, O Sindhu, when thou rannest on to win the race. Thou speedest o’er precipitous ridges of the Earth, when thou art Lord and Leader of these moving floods.\np:His roar is lifted up to Heaven above the Earth: he puts forth endless vigour with a flash of light. Like floods of rain that fall in thunder from the cloud, so Sindhu rushes on bellowing like a bull.\np:Like mothers to their calves, like milch kine with their milk, so, Sindhu, unto thee the roaring rivers run. Thou leadest as a warrior king thine army's wings what time thou comest in the van of these swift streams.\np:Favour ye this my laud, O Gan!gā, Yamunā, O Sutudri, Paruṣṇī and Sarasvatī: With Asikni, Vitasta, O Marudvrdha, O Ārjīkīya with Susoma hear my call.\np:First with Trstama thou art eager to flow forth, with Rasā, and Susartu, and with Svetya here, with Kubha; and with these, Sindhu and Mehatnu, thou seekest in thy course Krumu and Gomati.\np:Flashing and whitely-gleaming in her mightiness, she moves along her ample volumes through the realms, most active of the active, Sindhu unrestrained, like to a dappled mare, beautiful, fair to see.\np:Rich in good steeds is Sindhu, rich in cars and robes, rich in gold, nobly-fashioned, rich in ample wealth. Blest Silamavati and young Urnavati invest themselves with raiment rich in store of sweets.\np:Sindhu hath yoked her car, light-rolling, drawn by steeds, and with that car shall she win booty in this fight. So have I praised its power, mighty and unrestrained, of independent glory, roaring as it runs.",
    "meta": {
      "next": "10076",
      "previous": "10074",
      "book": "10",
      "source": "https://sacred-texts.com/hin/rigveda/rv10075.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv10075.htm"
    },
    "deities": [
      {
        "name": "O ye ",
        "hymns": [
          {
            "key": "10075",
            "title": "HYMN LXXV. The Rivers."
          }
        ]
      },
      {
        "name": "O Sindhu",
        "hymns": [
          {
            "key": "10075",
            "title": "HYMN LXXV. The Rivers."
          }
        ]
      },
      {
        "name": "O Gan",
        "hymns": [
          {
            "key": "10075",
            "title": "HYMN LXXV. The Rivers."
          }
        ]
      },
      {
        "name": "O Sutudri",
        "hymns": [
          {
            "key": "10075",
            "title": "HYMN LXXV. The Rivers."
          }
        ]
      },
      {
        "name": "O Marudvrdha",
        "hymns": [
          {
            "key": "10075",
            "title": "HYMN LXXV. The Rivers."
          }
        ]
      },
      {
        "name": "O Ārj",
        "hymns": [
          {
            "key": "10075",
            "title": "HYMN LXXV. The Rivers."
          }
        ]
      }
    ]
  },
  "created": 1638557835589,
  "updated": 1638830293122
}