{
  "key": "10070",
  "title": "RigVeda Hymn 10070",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LXX. &#256;pr&#299;s.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10070.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10069.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10071.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXX. &#256;pr&#299;s.</h3>  \n<p>1. ENJOY, O Agni, this my Fuel, welcome the oil-filled ladle where we pour libation.<br> Rise up for worship of the Gods, wise Agni, on the earth's height, while days are bright with beauty.<br> 2 May he who goes before the Gods come hither with steeds whose shapes are varied, Narasarhsa.<br> May he, most Godlike, speed our offered viands with homage God-ward on the path of Order.<br> 3 Men with oblations laud most constant Agni, and pray him to perform an envoy's duty.<br> With lightly-rolling car and best draught-horses, bring the Gods hither and sit down as Hotar.<br> 4 May the delight of Gods spread out transversely: may it be with us long in length and fragrant.<br> O Holy Grass divine, with friendly spirit bring thou the willing Gods whose Chief is Indra.<br> 5 Touch ye the far-extending height of heaven or spring apart to suit the wide earth's measure.<br> Yearning, ye Doors, with those sublime in greatness, seize eagerly the heavenly Car that cometh.<br> 6 Here in this shrine may Dawn and Night, the Daughters of Heaven, the skilful Goddesses, be seated.<br> In your wide lap, auspicious, willing Ladies may the Gods seat them with a willing spirit.<br> 7 Up stands the stone, high burns the fire enkindled: Aditi's lap contains the Friendly Natures<br> Ye Two Chief Priests who serve at this our worship, may ye, more skilled, win for us rich possessions.<br> 8 On our wide grass, Three Goddesses be seated: for you have we prepared and made it pleasant.<br> May I&#7735;&#257;, she whose foot drops oil, the Goddess, taste, man-like, sacrifice and well-set presents.<br> 9 Since thou, God Tva&#7779;&#7789;ar, hast made beauty perfect, since hou hast been the A&#7749;girases' Companion,<br> Willing, most wealthy, Giver of possessions, grant us the Gods&#146; assembly, thou who knowest.<br> 10 Well-knowing, binding with thy cord, bring hither, Lord of the Wood, the Deities' assembly.<br> The God prepare and season our oblations may Heaven and Earth be gracious to my calling.<br> 11 Agni, bring hither Varu&#7751;a to help us, Indra from heaven, from air's mid-realm the Maruts.<br> On sacred grass all Holy ones be seated and let the Immortal Gods rejoice in Sv&#257;h&#257;.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10071.htm\">Next: HYMN LXXI. Jnanam</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10070.html",
  "api": "json/hymns/10070.json",
  "data": {
    "title": "HYMN LXX. &#256;pr&#299;s.",
    "describe": "ENJOY, O Agni, this my Fuel, welcome the oil-filled ladle where we pour libation.",
    "feecting": "p:ENJOY, O Agni, this my Fuel, welcome the oil-filled ladle where we pour libation.\np: Rise up for worship of the Devas, wise Agni, on the Earth's height, while days are bright with beauty.\r\np:May he who goes before the Devas come hither with steeds whose shapes are varied, Narasarhsa. May he, most Godlike, speed our offered offerings with homage God-ward on the path of Order.\np:Men with oblations laud most constant Agni, and pray him to perform an envoy's duty. With lightly-rolling car and best draught-horses, bring the Devas hither and sit down as Hotar.\np:May the delight of Devas spread out transversely. May it be with us long in length and fragrant. O Holy Grass divine, with friendly spirit bring thou the willing Devas whose Chief is Indra.\np:Touch ye the far-extending height of Heaven or spring apart to suit the wide Earth's measure. Yearning, ye Doors, with those sublime in greatness, seize eagerly the heavenly Car that cometh.\np:Here in this shrin. May Dawn and Night, the Daughters of Heaven, the skilful Goddesses, be seated. In your wide lap, auspicious, willing Ladie. May the Devas seat them with a willing spirit.\np:Up stands the stone, high burns the fire enkindled: Aditi's lap contains the Friendly Natures Ye Two Chief Monks who serve at this our worship. May ye, more skilled, win for us rich possessions.\np:On our wide grass, Three Goddesses be seated: for you have we prepared and made it pleasant. May I&#7735;&#257;, she whose foot drops oildess, taste, man-like, offering and well-set presents.\np:Since thou, God Tva&#7779;&#7789;ar, hast made beauty perfect, since hou hast been the A&#7749;girases' Companion, Willing, most wealthy, Giver of possessions, grant us the Devas&#146; assembly, thou who knowest.\np:Well-knowing, binding with thy cord, bring hither, Lord of the Wood, the Deities' assembly. The God prepare and season our oblation. May Heaven and Earth be gracious to my calling.\np:Agni, bring hither Varu&#7751;a to help us, Indra from Heaven, from air's mid-realm the Devas. On sacred grass all Holy ones be seated and let the Immortal Devas rejoice in Sv&#257;h&#257;.",
    "next": "10071",
    "previous": "10069",
    "book": "10"
  },
  "created": 1638557808911,
  "updated": 1638647790980
}