{
  "key": "10076",
  "title": "RigVeda Hymn 10076",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LXXVI. Press-stones.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10076.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10075.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10077.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXVI. Press-stones.</h3>  \n<p>1. I GRASP at you when power and strength begin to dawn: bedew ye, Indra and the Maruts, Heaven and Earth,<br> That Day and Night, in every hall of sacrifice, may wait on us and bless us when they first spring forth.<br> 2 Press the libation out, most excellent of all: the Pressing-stone is grasped like a hand-guided steed.<br> So let it win the valour that subdues the foe, and the fleet courser's might that speeds to ample wealth.<br> 3 Juice that this Stone pours out removes defect of ours, as in old time it brought prosperity to man.<br> At sacrifices they established holy rites on Tva&#7779;&#7789;ar's milk-blent juice bright with the hue of steeds.<br> 4 Drive ye the treacherous demons far away from us: keep Nirrti afar and banish Penury.<br> Pour riches forth for us with troops of hero sons, and bear ye up, O Stones, the song that visits Gods.<br> 5 To you who are more mighty than the heavens themselves, who, finishing your task with more than Vibhvan's speed,<br> More rapidly than V&#257;yu seize the Soma juice, better than Agni give us food, to you I sing.<br> 6 Stirred be the glorious Stones: let it press out the juice, the Stone with heavenly song that reaches up to heaven,<br> There where the men draw forth the meath for which they long, sending their voice around in rivalry of speed.<br> 7 The Stones press out the Soma, swift as car-borne men, and, eager for the spoil, drain forth the sap thereof<br> To fill the beaker, they exhaust the udder's store, as the men purify oblations with their lips.<br> 8 Ye, present men, have been most skilful in your work, even ye, O Stones who pressed Soma for Indra's drink.<br> May all ye have of fair go to the Heavenly Race, and all your treasure to the earthly worshipper.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10077.htm\">Next: HYMN LXXVII. Maruts.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10076.html",
  "api": "json/hymns/10076.json",
  "data": {
    "title": "HYMN LXXVI. Press-stones.",
    "describe": "I GRASP at you when power and strength begin to dawn: bedew ye, Indra and the Devas.",
    "feecting": "p:I GRASP at you when power and strength begin to dawn: bedew ye, Indra and the Devas. Heaven and Earth, that Day and Night, in every hall of offering. May wait on us and bless us when they first spring forth.\np:Press the libation out, most excellent of all: the Pressing-stone is grasped like a hand-guided steed.\np: So let it win the valour that subdues the foe, and the fleet courser's might that speeds to ample wealth.\r\np:Juice that this Stone pours out removes defect of ours, as in old time it brought prosperity to man. At offers they established holy rites on Tva&#7779;&#7789;ar's milk-blent juice bright with the hue of steeds.\np:Drive ye the treacherous demons far away from us: keep Nirrti afar and banish Penury. Pour riches forth for us with troops of hero sons, and bear ye up, O Stones, the song that visits Devas.\np:To you who are more mighty than the heavens themselves, who, finishing your task with more than Vibhvan's speed, More rapidly than V&#257;yu seize the Soma juice, better than Agni give us food, to you I sing.\np:Stirred be the glorious Stones: let it press out the juice, the Stone with heavenly song that reaches up to Heaven, there where the men draw forth the meath for which they long, sending their voice around in rivalry of speed.\np:The Stones press out the Soma, swift as car-borne men, and, eager for the spoil, drain forth the sap thereof To fill the beaker, they exhaust the udder's store, as the men purify oblations with their lips.\np:Ye, present men, have been most skilful in your work, even ye, O Stones who pressed Soma for Indra's drink. May all ye have of fair go to the Heavenly Race, and all your treasure to the earthly worshipper.",
    "next": "10077",
    "previous": "10075",
    "book": "10"
  },
  "created": 1638557840857,
  "updated": 1638791253615
}