{
  "key": "10082",
  "title": "RigVeda Hymn 10082",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LXXXII. Visvakarman.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10082.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10081.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10083.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXII. Visvakarman.</h3>  \n<p>1. THE Father of the eye, the Wise in spirit, created both these worlds submerged in fatness.<br> Then when the eastern ends were firmly fastened, the heavens and the earth were far extended.<br> 2 Mighty in mind and power is Visvakarman, Maker, Disposer, and most lofty Presence.<br> Their offerings joy in rich juice where they value One, only One, beyond the Seven &#7770;&#7779;is.<br> 3 Father who made us, he who, as Disposer, knoweth all races and all things existing,<br> Even he alone, the Deities' narne-giver,him other beings seek for information.<br> 4 To him in sacrifice they offered treasures,&#151;&#7770;&#7779;is of old, in numerous troops, as singers,<br> Who, in the distant, near, and lower region, made ready all these things that have existence.<br> 5 That which is earlier than this earth and heaven, before the Asuras and Gods had being,&#151;<br> What was the germ primeval which the waters received where all the Gods were seen together?<br> 6 The waters, they received that germ primeval wherein the Gods were gathefed all together.<br> It rested set upon the Unborn's navel, that One wherein abide all things existing.<br> 7 Ye will not find him who produced these creatures: another thing hath risen up among you.<br> Enwrapt in misty cloud, with lips that stammer, hymn-chanters wander and are discontented.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10083.htm\">Next: HYMN LXXXII. Manyu.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/10082.html",
  "api": "hymns/10082json",
  "data": {
    "title": "HYMN LXXXII. Visvakarman.",
    "describe": "THE Father of the eye, the Wise in spirit, created both these worlds submerged in fatness.",
    "feecting": "p:THE Father of the eye, the Wise in spirit, created both these worlds submerged in fatness.\np: Then when the eastern ends were firmly fastened, the heavens and the Earth were far extended.\r\np:Mighty in mind and power is Visvakarman, maker, Disposer, and most lofty Presence. Their offerings joy in rich juice where they value One, only One, beyond the Seven Ṛṣis.\np:Father who made us, he who, as Disposer, knoweth all races and all things existing, Even he alone, the Deities' narne-giver,him other beings seek for information.\np:To him in offerings they offered treasures,—Ṛṣis of old, in numerous troops, as singers, who, in the distant, near, and lower region, made ready all these things that have existence.\np:That which is earlier than this Earth and Heaven, before the Devass and Devas had being,— What was the germ primeval which the waters received where all the Devas were seen together?\np:The waters, they received that germ primeval wherein the Devas were gathefed all together. It rested set upon the Unborn's navel, that One wherein abide all things existing.\np:Ye will not find him who produced these creatures: another thing hath risen up among you. Enwrapt in misty cloud, with lips that stammer, hymn-chanters wander and are discontented.",
    "next": "10083",
    "previous": "10081",
    "book": "10"
  },
  "created": 1638557872670
}