{
  "key": "10089",
  "title": "RigVeda Hymn 10089",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LXXXIX. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10089.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10088.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10090.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXIX. Indra.</h3>  \n<p>1. I WILL extol the most heroic Indra who with his might forced earth and sky asunder;<br> Who hath filled all with width as man's Upholder, surpassing floods and rivers in his greatness.<br> 2 S&#363;rya is he: throughout the wide expanses shall Indra turn him, swift as car-wheels, hither,<br> Like a stream resting not but ever active he hath destroyed, with light, the black-hued darkness.<br> 3 To him I sing a holy prayer, incessant new, matchless, common to the earth and heaven,<br> Who marks, as they were backs, all living creatures: ne&#146;er doth he fail a friend, the noble Indra.<br> 4 I will send forth my songs in flow unceasing, like water from the ocean's depth, to Indra.<br> Who to his car on both its sides securely hath fixed the earth and heaven as with an axle.<br> 5 Rousing with draughts, the Shaker, rushing onward, impetuous, very strong, armed as with arrows<br> Is Soma; forest trees and all the bushes deceive not Indra with their offered likeness.<br> 6 Soma hath flowed to him whom naught can equal, the earth, the heavens, the firmament, the mountains,&#151;<br> When heightened in his ire his indignation shatters the firm and breaks the strong in pieces.<br> 7 As an axe fells the tree so be slew V&#7771;tra, brake down the strongholds and dug out the rivers.<br> He cleft the mountain like a new-made pitcher. Indra brought forth the kine with his Companions.<br> 8 Wise art thou, Punisher of guilt, O Indra. The sword lops limbs, thou smitest down the sinner,<br> The men who injure, as it were a comrade, the lofty Law of Varu&#7751;a and Mitra.<br> 9 Men who lead evil lives, who break agreements, and injure Varu&#7751;a, Aryaman and Mitra,&#151;<br> Against these foes, O Mighty Indra, sharpen, as furious death, thy Bull of fiery colour.<br> 10 Indra is Sovran Lord of Earth and Heaven, Indra is Lord of waters and of mountains.<br> Indra is Lord of prosperers and sages Indra must be invoked in rest and effort.<br> 11 Vaster than days and nights, Giver of increase, vaster than firmament and flood of ocean,<br> Vaster than bounds of earth and wind's extension, vaster than rivers and our lands is Indra.<br> 12 Forward, as herald of refulgent Morning, let thine insatiate arrow fly, O Indra.<br> And pierce, as &#146;twere a stone launched forth from heaven, with hottest blaze the men who love deception.<br> 13 Him, verily, the moons, the mountains followed, the tall trees followed and the plants and herbage.<br> Yearning with love both Worlds approached, the Waters waited on Indra when he first had being.<br> 14 Where was the vengeful dart when thou, O Indra, clavest the demon ever beat on outrage?<br> When fiends lay there upon the ground extended like cattle in the place of immolation?<br> 15 Those who are set in enmity against us, the Oga&#7751;as, O Indra, waxen mighty,&#151;<br> Let blinding darkness follow those our foemen, while these shall have bright shining nights to light them.<br> 16 May plentiful libations of the people, and singing &#7770;&#7779;is&#146; holy prayers rejoice thee.<br> Hearing with love this common invocation, come unto us, pass by all those who praise thee.<br> 17 O Indra, thus may we be made partakers of thy new favours that shall bring us profit.<br> Singing with love, may we the Vi&#347;v&#257;mitras win daylight even now through thee, O Indra.<br> 18 Call we on Maghavan, auspicious Indra, best hero in the fight where spoil is gathered,<br> The Strong who listens, who gives aid in battles, who slays the V&#7771;tras, wins and gathers riches.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10090.htm\">Next: HYMN XC. Puru&#7779;a.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10089.html",
  "api": "json/hymns/10089.json",
  "data": {
    "key": "10089",
    "title": "HYMN LXXXIX. Indra.",
    "describe": "I WILL extol the most heroic Indra who with his might forced Earth and sky asunder.",
    "feecting": "p:I WILL extol the most heroic Indra who with his might forced Earth and sky asunder. Who hath filled all with width as man's Upholder, surpassing floods and rivers in his greatness.\np:Sūrya is he: throughout the wide expanses shall Indra turn him, swift as car-wheels, hither, like a stream resting not but ever active he hath conquered, with light, the black-hued darkness.\np:To him I sing a holy prayer, incessant new, matchless, common to the Earth and Heaven, who marks, as they were backs, all living creatures: ne’er doth he fail a friend, the noble Indra.\np:I will send forth my songs in flow unceasing, like water from the ocean's depth, to Indra.\np: Who to his car on both its sides securely hath fixed the Earth and Heaven as with an axle.\r\np:Rousing with draughts, the Shaker, rushing onward, impetuous, very strong, armed as with arrows Is Soma; forest trees and all the bushes deceive not Indra with their offered likeness.\np:Soma hath flowed to him whom naught can equal, the Earth, the heavens, the Firmament, the mountains. When heightened in his ire his indignation shatters the firm and breaks the strong in pieces.\np:As an axe fells the tree so be slew Vṛtra, brake down the strongholds and dug out the rivers. He cleft the mountain like a new-made pitcher. Indra brought forth the kine with his Companions.\np:Wise art thou, Punisher of guilt, O Indra. The sword lops limbs, thou smitest down the sinner, the men who injure, as it were a comrade, the lofty Law of Indra and Mitra.\np:Men who lead evil lives, who break agreements, and injure Indra, Aryaman and Mitra. Against these . O Mighty Indra, sharpen, as furious death, thy Bull of fiery colour.\np:Indra is Sovran Lord of Earth and Heaven, Indra is Lord of waters and of mountains. Indra is Lord of prosperers and sages Indra must be invoked in rest and effort.\np:Vaster than days and nights, Giver of increase, vaster than Firmament and flood of ocean, Vaster than bounds of Earth and wind's extension, vaster than rivers and our lands is Indra.\np:Forward, as herald of refulgent Morning, let thine insatiate arrow fly, O Indra. And pierce, as ’twere a stone launched forth from Heaven, with hottest blaze the men who love deception.\np:Him, verily, the moons, the mountains followed, the tall trees followed and the plants and herbage. Yearning with love both Worlds approached, the Waters waited on Indra when he first had being.\np:Where was the vengeful dart when thou, O Indra, clavest the demon ever beat on outrage? When fiends lay there upon the ground extended like cattle in the place of immolation?\np:Those who are set in enmity against us, the Ogaṇas, O Indra, waxen mighty. Let blinding darkness follow those our foemen, while these shall have bright shining nights to light them.\np:May plentiful libations of the people, and singing Ṛṣis’ holy prayers rejoice thee. Hearing with love this common invocation, come unto us, pass by all those who praise thee.\np:O Indra, thu. May we be made partakers of thy new favours that shall bring us profit. Singing with love. May we the Viśvāmitras win daylight even now through thee, O Indra.\np:Call we on Indra, auspicious Indra, best hero in the fight where spoil is gathered, the Strong who listens, who gives aid in battles, who subdues the Vṛtras, wins and gathers riches.",
    "meta": {
      "next": "10090",
      "previous": "10088",
      "book": "10",
      "original": "https://sacred-texts.com/hin/rigveda/rv10089.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv10089.htm"
    },
    "deities": [
      {
        "name": "O Indra",
        "hymns": [
          {
            "key": "10089",
            "title": "HYMN LXXXIX. Indra."
          },
          {
            "key": "10089",
            "title": "HYMN LXXXIX. Indra."
          },
          {
            "key": "10089",
            "title": "HYMN LXXXIX. Indra."
          },
          {
            "key": "10089",
            "title": "HYMN LXXXIX. Indra."
          },
          {
            "key": "10089",
            "title": "HYMN LXXXIX. Indra."
          },
          {
            "key": "10089",
            "title": "HYMN LXXXIX. Indra."
          }
        ]
      },
      {
        "name": "O Mighty",
        "hymns": [
          {
            "key": "10089",
            "title": "HYMN LXXXIX. Indra."
          }
        ]
      }
    ]
  },
  "created": 1638557909498,
  "updated": 1639023785754
}