{
  "key": "10084",
  "title": "RigVeda Hymn 10084",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LXXXIV. Manyu.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10084.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10083.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10085.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXIV. Manyu.</h3>  \n<p>1. BORNE on with thee, O Manyu girt by Maruts, let our brave men, impetuous, bursting forward,<br> March on, like flames of fire in form, exulting, with pointed arrows, sharpening their weapons.<br> 2 Flashing like fire, be thou, O conquering Manyu, invoked, O Victor, as our army's leader.<br> Slay thou our foes, distribute their possessions: show forth thy vigour, scatter those who hate us.<br> 3 O Manyu, overcome thou our assailant on! breaking, slaying, crushing down the foemen.<br> They have not hindered thine impetuous vigour: Mighty, Sole born! thou makest them thy subjects.<br> 4 Alone or many thou art worshipped, Manyu: sharpen the spirit of each clan for battle.<br> With thee to aid, O thou of perfect splendour, we will uplift the glorious shout for conquest.<br> 5 Unyielding bringing victory like Indra, O Manyu, be thou here our Sovran Ruler.<br> To thy dear name, O Victor, we sing praises: we know the spring from which thou art come hither.<br> 6 Twin-born with power, destructive bolt of thunder, the highest conquering might is thine, Subduer!<br> Be friendly to its in thy spirit, Manyu, O Much-invoked, in shock of mighty battle.<br> 7 For spoil let Varu&#7751;a and Manyu give us the wealth of both sides gathered and collected;<br> And let our enemies with stricken spirits, o&#146;erwhelmed with terror, slink away defeated.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10085.htm\">Next: HYMN LXXXV. S&#363;rya's Bridal.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10084.html",
  "api": "json/hymns/10084.json",
  "data": {
    "title": "HYMN LXXXIV. Manyu.",
    "describe": "BORNE on with thee, O Manyu girt by Devas, let our brave men, impetuous, bursting forward, March on, like flames of fire in form, exulting, with pointed arrows, sharpening their weapons.",
    "feecting": "p:BORNE on with thee, O Manyu girt by Devas, let our brave men, impetuous, bursting forward, March on, like flames of fire in form, exulting, with pointed arrows, sharpening their weapons.\np:Flashing like fire, be thou, O conquering Manyu, invoked, O Victor, as our army's leader.\np: Slay thou our foes, distribute their possessions: show forth thy vigour, scatter those who hate us.\r\np:O Manyu, overcome thou our assailant on! breaking, subduing, crushing down the foemen. They have not hindered thine impetuous vigour: Mighty, Sole born! thou makest them thy subjects.\np:Alone or many thou art worshipped, Manyu: sharpen the spirit of each clan for battle. With thee to aid, O thou of perfect splendour, we will uplift the glorious shout for conquest.\np:Unyielding bringing victory like Indra, O Manyu, be thou here our Sovran Ruler. To thy dear name, O Victor, we sing praises: we know the spring from which thou art come hither.\np:Twin-born with power, destructive bolt of thunder, the highest conquering might is thine, Subduer! Be friendly to its in thy spirit, Manyu, O Much-invoked, in shock of mighty battle.\np:For spoil let Varu&#7751;a and Manyu give us the wealth of both sides gathered and collected; And let our enemies with stricken spirits, o&#146;erwhelmed with terror, slink away defeated.",
    "next": "10085",
    "previous": "10083",
    "book": "10"
  },
  "created": 1638557883229,
  "updated": 1638791781228
}