{
  "key": "10088",
  "title": "RigVeda Hymn 10088",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN LXXXVIII. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10088.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10087.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10089.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN LXXXVIII. Agni.</h3>  \n<p>1. DEAR, ageless sacrificial drink is offered in light-discovering, heaven-pervading Agni.<br> The Gods spread forth through his Celestial Nature, that he might bear the world up and sustain it.<br> 2 The world was swallowed and concealed in darkness: Agni was born, and light became apparent.<br> The Deities, the broad earth, and the heavens, and plants, and waters gloried in his friendship.<br> 3 Inspired by Gods who claim our adoration, I now will laud Eternal Lofty Agni,<br> Him who hath spread abroad the earth with lustre, this heaven, and both the worlds, and air's mid-region.<br> 4 Earliest Priest whom all the Gods accepted, and chose him, and anointed him with butter,<br> He swiftly made all things that fly, stand, travel, all that hath motion, Agni J&#257;tavedas.<br> 5 Because thou, Agni, J&#257;tavedas, stoodest at the world's head with thy refulgent splendour,<br> We sent thee forth with hymns and songs and praises: thou filledst heaven and earth, God meet for worship.<br> 6 Head of the world is Agni in the night-time; then, as the Sun, at morn springs up and rises.<br> Then to his task goes the prompt Priest foreknowing the wondrous power of Gods who must be honoured.<br> 7 Lovely is he who, kindled in his greatness, hath shone forth, seated in the heavens, refulgent.<br> With resonant hymns all Gods who guard our bodies have offered up oblation in this Agni.<br> 8 First the Gods brought the hymnal into being; then they engendered Agni, then oblation.<br> He was their sacrifice that guards our bodies: him the heavens know, the earth, the waters know him.<br> 9 He, Agni, whom the Gods have generated, in whom they offered up all worlds and creatures,<br> He with his bright glow heated earth and heaven, urging himself right onward in his grandeur.<br> 10 Then by the laud the Gods engendered Agni in heaven, who fills both worlds through strength and vigour.<br> They made him to appear in threefold essence: he ripens plants of every form and nature.<br> 11 What time the Gods, whose due is worship, set him as S&#363;rya, Son of Aditi, in heaven,<br> When the Pair, ever wandering, sprang to being, all creatures that existed looked upon them.<br> 12 For all the world of life the Gods made Agni Vai&#347;v&#257;nara to be the days' bright Banner,&#151;<br> Him who hath spread abroad the radiant Mornings, and, coming with his light, unveils the darkness.<br> 13 The wise and holy Deities engendered Agni Vai&#347;v&#257;nara whom age ne&#146;er touches.<br> The Ancient Star that wanders on for ever, lofty and. strong, Lord of the Living Being.<br> 14 We call upon the Sage with holy verses, Agni Vai&#347;v&#257;nara the ever-beaming,<br> Who hath surpassed both heaven and earth in greatness: he is a God below, a God above us.<br> 15 I have heard mention of two several pathways, ways of the Fathers and of Gods and mortals.<br> On these two paths each moving creature travels, each thing between the Father and the Mother.<br> 16 These two united paths bear him who journeys born from the head and pondered with the spirit<br> He stands directed to all things existing, hasting, unresting in his fiery splendour.<br> 17 Which of us twain knows where they speak together, upper and lower of the two rite-leaders?<br> Our friends have helped to gather our assembly. They came to sacrifice; who will announce it?<br> 18 How many are the Fires and Suns in number? What is the number of the Dawns and Waters?<br> Not jestingly I speak to you, O Fathers. Sages, I ask you this for information.<br> 19 As great as is the fair-winged Morning's presence to him who dwells beside us, M&#257;tari&#347;van!<br> Is what the Brahman does when he approaches to sacrifice and sits below the Hotar.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10089.htm\">Next: HYMN LXXXIX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10088.html",
  "api": "json/hymns/10088.json",
  "data": {
    "title": "HYMN LXXXVIII. Agni.",
    "describe": "DEAR, ageless sacrificial drink is offered in light-discovering.",
    "feecting": "p:DEAR, ageless sacrificial drink is offered in light-discovering. Heaven-pervading Agni.\np: The Devas spread forth through his Celestial Nature, that he might bear the world up and sustain it.\r\np:The world was swallowed and concealed in darkness: Agni was born, and light became apparent. The Deities, the broad Earth, and the heavens, and plants, and waters gloried in his friendship.\np:Inspired by Devas who claim our adoration, I now will laud Eternal Lofty Agni, him who hath spread abroad the Earth with lustre, this Heaven, and both the worlds, and air's mid-region.\np:Earliest Monk whom all the Devas accepted, and chose him, and anointed him with butter. He swiftly made all things that fly, stand, travel, all that hath motion, Agni J&#257;tavedas.\np:Because thou, Agni, J&#257;tavedas, stoodest at the world's head with thy refulgent splendour, We sent thee forth with hymns and songs and praises: thou filledst Heaven and Earth, God meet for worship.\np:Head of the world is Agni in the night-time; then, as the Sun, at morn springs up and rises. Then to his task goes the prompt Monk foreknowing the wondrous power of Devas who must be honoured.\np:Lovely is he who, kindled in his greatness, hath shone forth, seated in the heavens, refulgent. With resonant hymns all Devas who guard our bodies have offered up oblation in this Agni.\np:First the Devas brought the hymnal into being; then they engendered Agni, then oblation. He was their offering that guards our bodies: him the heavens know, the Earth, the waters know him.\np:He, Agni, whom the Devas have generated, in whom they offered up all worlds and creatures. He with his bright glow heated Earth and Heaven, urging himself right onward in his grandeur.\np:Then by the laud the Devas engendered Agni in Heaven, who fills both worlds through strength and vigour. They made him to appear in threefold essence: he ripens plants of every form and nature.\np:What time the Devas, whose due is worship, set him as S&#363;rya, Son of Aditi, in Heaven, when the Pair, ever wandering, sprang to being, all creatures that existed looked upon them.\np:For all the world of life the Devas made Agni Vai&#347;v&#257;nara to be the days' bright Banner,&#151; Him who hath spread abroad the radiant Mornings, and, coming with his light, unveils the darkness.\np:The wise and holy Deities engendered Agni Vai&#347;v&#257;nara whom age ne&#146;er touches. The Ancient Star that wanders on forever, lofty and. strong, Lord of the Living Being.\np:We call upon the Sage with holy verses, Agni Vai&#347;v&#257;nara the ever-beaming, who hath surpassed both Heaven and Earth in greatness: he is a God below, a God above us.\np:I have heard mention of two several pathways, ways of the Fathers and of Devas and mortals. On these two paths each moving creature travels, each thing between the Father and the Mother.\np:These two united paths bear him who journeys born from the head and pondered with the spirit He stands directed to all things existing, hasting, unresting in his fiery splendour.\np:Which of us twain knows where they speak together, upper and lower of the two rite-leaders? Our friends have helped to gather our assembly. They came to offering; who will announce it?\np:How many are the Fires and Suns in number? What is the number of the Dawns and Waters? Not jestingly I speak to you, O Fathers. Sages, I ask you this for information.\np:As great as is the fair-winged Morning's presence to him who dwells beside us, M&#257;tari&#347;van! Is what the Brahman does when he approaches to offering and sits below the Hotar.",
    "next": "10089",
    "previous": "10087",
    "book": "10"
  },
  "created": 1638557904243,
  "updated": 1638792008512
}