{
  "key": "10092",
  "title": "RigVeda Hymn 10092",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN XCII. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10092.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10091.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10093.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN XCII. Vi&#347;vedevas.</h3>  \n<p>1. I PRAISE your Charioteer of sacrifice, the Lord of men, Priest of the tribes, refulgent, Guest of night.<br> Blazing amid dry plants, snatching amid the green, the Strong, the Holy Herald hath attained to heaven.<br> 2 Him, Agni, Gods and men have made their chief support, who drinks the fatness and completes the sacrifice.<br> With kisses they caress the Grandson of the Red, like the swift ray of light, the Household Priest of Dawn.<br> 3 Yea, we discriminate his and the niggard's ways: his branches evermore are sent forth to consume.<br> When his terrific flames have reached the Immortal's world, then men remember and extol the Heavenly Folk.<br> 4 For then the net of Law, Dyaus, and the wide expanse, Earth, Worship, and Devotion meet for highest praise,<br> Varu&#7751;a, Indra, Mitra were of one accord, and Savitar and Bhaga, Lords of holy might.<br> 5 Onward, with ever-roaming Rudra, speed the floods: over Aramati the Mighty have they run.<br> With them Parijman, moving round his vast domain, loud bellowing, bedews all things that are within.<br> 6 Straightway the Rudras, Maruts visiting all men, Falcons of Dyaus, home-dwellers with the Asura,&#151;<br> Varu&#7751;a, Mitra, Aryaman look on with these, and the swift-moving Indra with swift-moving Gods.<br> 7 With Indra have they found enjoyment, they who toil, in the light's beauty, in the very Strong One's strength;<br> The singers who in men's assemblies forged for him, according to his due, his friend the thunderbolt.<br> 8 Even the Sun's Bay Coursers hath lie held in check: each one fears Indra as the mightiest of all.<br> Unhindered, from the air's vault thunders day by day the loud triumphant breathing of the fearful Bull.<br> 9 With humble adoration show this day your song of praise to mighty Rudra, Ruler of the brave:<br> With whom, the Eager Ones, going their ordered course, he comes from heaven Self-bright, auspicious, strong to guard.<br> 10 For these have spread abroad the fame of human kind, the Bull B&#7771;haspati and Soma's brotherhood.<br> Atharvan first by sacrifices made men sure: through skill the Bh&#7771;gus were esteemed of all as Gods.<br> 11 For these, the Earth and Heaven with their abundant seed, four-bodied Nar&#257;&#347;a&#7745;sa, Yama, Aditi,<br> God Tva&#7779;&#7789;ar Wealth-bestower, the &#7770;bhuk&#7779;a&#7751;as, Rodas&#299;, Maruts, Vi&#7779;&#7751;u, claim and merit praise.<br> 12 And may he too give car, the Sage, from far away, the Dragon of the Deep, to this our yearning call.<br> Ye Sun and Moon who dwell in heaven and move in turn, and with your thought, O Earth and Sky, observe this well.<br> 13 Dear to all Gods, may P&#363;&#7779;an guard the ways we go, the Waters&#146; child and V&#257;yu help us to success.<br> Sing lauds for your great bliss to Wind, the breath of all: ye A&#347;vins prompt to hear, hear this upon your way.<br> 14 With hymns of praise we sing him who is throned as Lord over these fearless tribes, the Self-resplendent One.<br> We praise Night's youthful Lord benevolent to men, the foeless One, the free, with all celestial Dames.<br> 15 By reason of his birth here A&#7749;giras first sang: the pressing-stones upraised beheld the sacrifice-<br> The stones through which the Sage became exceeding vast, and the sharp axe obtains in fight the beauteous place.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10093.htm\">Next: HYMN XCIII. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10092.html",
  "api": "json/hymns/10092.json",
  "data": {
    "key": "10092",
    "title": "HYMN XCII. Devas.",
    "describe": "I PRAISE your Charioteer of offering, the Lord of men, Monk of the tribes, refulgent, Guest of night.",
    "feecting": "p:I PRAISE your Charioteer of offering, the Lord of men, Monk of the tribes, refulgent, Guest of night.\np: Blazing amid dry plants, snatching amid the green, the Strong, the Holy Herald hath attained to Heaven.\r\np:Him, Agni, Devas and men have made their chief support, who drinks the fatness and completes the offering. With kisses they caress the Grandson of the Red, like the swift ray of light, the Household Monk of Dawn.\np:Yea, we discriminate his and the niggard's ways: his branches evermore are sent forth to consume. When his terrific flames have reached the Immortal's world, then men remember and extol the Heavenly Folk.\np:For then the net of Law, Devas, and the wide expanse, Earth, worship, and Devotion meet for highest praise, Indra, Indra, Mitra were of one accord, and Indra and Bhaga, Lords of holy might.\np:Onward, with ever-roaming Soma, speed the floods: over Aramati the Mighty have they run. With them Parijman, moving round his vast domain, loud bellowing, bedews all things that are within.\np:Straightway the Somas, Devas visiting all men, Falcons of Devas, home-dwellers with the Devas. Indra, Mitra, Aryaman look on with these, and the swift-moving Indra with swift-moving Devas.\np:With Indra have they found enjoyment, they who toil, in the light's beauty, in the very Strong One's strength; The singers who in men's assemblies forged for him, according to his due, his friend the thunderbolt.\np:Even the Sun's Bay Coursers hath lie held in check: each one fears Indra as the mightiest of all. Unhindered, from the air's vault thunders day by day the loud triumphant breathing of the fearful Bull.\np:With humble adoration show this day your song of praise to mighty Soma, Ruler of the brave: With whom, the Eager Ones, going their ordered course, he comes from Heaven Self-bright, auspicious, strong to guard.\np:For these have spread abroad the fame of human kind, the Bull Soma and Soma's brotherhood. Atharvan first by offers made men sure: through skill the Bhṛgus were esteemed of all as Devas.\np:For these, the Earth and Heaven with their abundant seed, four-bodied Narāśaṁsa, Yama, Aditi, Deva Tvaṣṭar Wealth-bestower, the Ṛbhukṣaṇas, Rodasī, Devas, Indra, claim and merit praise.\np:An. May he too give car, the Sage, from far away, the Dragon of the Deep, to this our yearning call. Ye Sun and Moon who dwell in Heaven and move in turn, and with your thought, O Earth and Sky, observe this well.\np:Dear to all Devas. May Pūṣan guard the ways we go, the Waters’ child and Soma help us to success. Sing lauds for your great bliss to Wind, the breath of all: ye Indra prompt to hear, hear this upon your way.\np:With hymns of praise we sing him who is throned as Lord over these fearless tribes, the Self-resplendent One. We praise Night's youthful Lord benevolent to men, the foeless One, the free, with all celestial Dames.\np:By reason of his birth here Aṅgiras first sang: the pressing-stones upraised beheld the offering- The stones through which the Sage became exceeding vast, and the sharp axe obtains in fight the beauteous place.",
    "meta": {
      "next": "10093",
      "previous": "10091",
      "book": "10",
      "original": "https://sacred-texts.com/hin/rigveda/rv10092.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv10092.htm"
    },
    "deities": [
      {
        "name": "O Earth",
        "hymns": [
          {
            "key": "10092",
            "title": "HYMN XCII. Devas."
          }
        ]
      }
    ]
  },
  "created": 1638557925288,
  "updated": 1667442754345
}