{
  "key": "10109",
  "title": "RigVeda Hymn 10109",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CIX. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10109.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10108.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10110.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CIX. Vi&#347;vedevas.</h3>  \n<p>1. THESE first, the boundless Sea, and M&#257;tari&#347;van, fierce-glowing Fire, the Strong, the Bliss-bestower.<br> And heavenly Floods, first-born by holy Order, exclaimed against the outrage on a Brahman.<br> 2 King Soma first of all, without reluctance, made restitution of the Brahman's consort.<br> Mitra and Varu&#7751;a were the inviters: Agni as Hota; took her hand and led her.<br> 3 The man, her pledge, must by her hand be taken when they have cried, She is a Brahman's consort.<br> She stayed not for a herald to conduct her: thus is the kingdom of a ruler guarded.<br> 4 Thus spake of her those Gods of old, Seven &#7770;&#7779;is who sate them down to their austere devotion:<br> Dire is a Brahman's wife led home by others: in the supremest heaven she plants confusion.<br> 5 The Brahmacari goes engaged in duty: he is a member of the Gods&#146; own body.<br> Through him B&#7771;haspati obtained his consort, as the Gods gained the ladle brought by Soma.<br> 6 So then the Gods restored her, so men gave the woman back again.<br> The Kings who kept their promises restored the Brahman's wedded wife,<br> 7 Having restored the Brahman's wife, and freed them, with Gods&#146; aid, from sin,<br> They shared the fulness of the earth, and won themselves extended sway.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10110.htm\">Next: HYMN CX. &#256;pr&#299;s.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10109.html",
  "api": "json/hymns/10109.json",
  "data": {
    "title": "HYMN CIX. Vi&#347;vedevas.",
    "describe": "THESE first, the boundless Sea, and M&#257;",
    "feecting": "p:THESE first, the boundless Sea, and M&#257;tari&#347;van, fierce-glowing Fire, the Strong, the Bliss-bestower.\np: And heavenly Floods, first-born by holy Order, exclaimed against the outrage on a Brahman.\r\np:King Soma first of all, without reluctance, made restitution of the Brahman's consort. Mitra and Varu&#7751;a were the inviters: Agni as Hota; took her hand and led her.\np:The man, her pledge, must by her hand be taken when they have cried, she is a Brahman's consort. She stayed not for a herald to conduct her: thus is the kingdom of a ruler guarded.\np:Thus spake of her those Devas of old, Seven &#7770;&#7779;is who sate them down to their austere devotion: Dire is a Brahman's wife led home by others: in the supremest Heaven she plants confusion.\np:The Brahmacari goes engaged in duty: he is a member of the Devas&#146; own body. Through him B&#7771;haspati obtained his consort, as the Devas gained the ladle brought by Soma.\np:So then the Devas restored her, so men gave the woman back again. The Kings who kept their promises restored the Brahman's wedded wife,\np:Having restored the Brahman's wife, and freed them, with Devas&#146; aid, from sin, they shared the fulness of the Earth, and won themselves extended sway.",
    "next": "10110",
    "previous": "10108",
    "book": "10"
  },
  "created": 1638558015149,
  "updated": 1638791781262
}