{
  "key": "10100",
  "title": "RigVeda Hymn 10100",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN C. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10100.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10099.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10101.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN C. Vi&#347;vedevas.</h3>  \n<p>1. Be, like thyself, O Indra, strong for our delight: here lauded, aid us, Maghavan, drinker of the juice.<br> Savitar with the Gods protect us: hear ye Twain. We ask for freedom and complete felicity.<br> 2 Bring swift, for offering, the snare that suits the time, to the pure-drinker V&#257;yu, roaring as he goes,<br> To him who hath approached the draught of shining milk. We ask for freedom and complete felicity.<br> 3 May Savitar the God send us full life, to each who sacrifices, lives aright and pours the juice<br> That we with simple hearts may wait upon the Gods. We ask for freedom and complete felicity.<br> 4 May Indra evermore be gracious unto us, and may King Soma meditate our happiness,<br> Even as men secure the comfort of a friend. We ask for freedom and complete felicity.<br> 5 Indra hath given the body with its song and strength: B&#7771;haspati, thou art the lengthener of life.<br> The sacrifice is Manu, Providence, our Sire. We ask for freedom and complete felicity.<br> 6 Indra possesseth might celestial nobly formed: the singer in the house is Agni, prudent Sage.<br> He is the sacrifice in synod, fair, most near. We ask for freedom and complete felicity,<br> 7 Not often have we sinned against you secretly, nor, Vasus, have we openly provoked the Gods.<br> Not one of its, ye Gods, hath worn an alien shape. We ask for freedom and complete felicity.<br> 8 May Savitar remove from us our malady, and may the Mountains keep it far away from where<br> The press-stone as it sheds the meath rings loudly forth. We ask for freedom and complete felicity.<br> 9 Ye Vasus, let the stone, the presser stand erect: avert all enmities and keep them far remote.<br> Our guard to be adored is Savitar this God. We ask for freedom and complete felicity.<br> 10 Eat strength and fatness in the pasture, kine, who are balmed at the reservoir and at the seat of Law.<br> So let your body be our body's medicine. We ask for freedom and complete felicity.<br> 11 The singer fills the spirit: all mens, love hath he. Indra takes kindly care of those who pour the juice.<br> For his libation is the heavenly udder full. We ask for freedom and complete felicity.<br> 12 Wondrous thy spirit-filling light, triumpliant; thy hosts save from decay and are resistless.<br> The pious votary by straightest pathway speeds to possess the best of all the cattle.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10101.htm\">Next: HYMN CI. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10100.html",
  "api": "json/hymns/10100.json",
  "data": {
    "title": "HYMN C. Vi&#347;vedevas.",
    "describe": "Be, like thyself, O Indra, strong for our delight: here lauded, aid us, Indra, drinker of the juice.",
    "feecting": "p:Be, like thyself, O Indra, strong for our delight: here lauded, aid us, Indra, drinker of the juice.\np: Indra with the Devas protect us: hear ye Twain. We ask for freedom and complete felicity.\r\np:Bring swift, for offering, the snare that suits the time, to the pure-drinker V&#257;yu, roaring as he goes, to him who hath approached the draught of shining milk. We ask for freedom and complete felicity.\np:May Indra the Deva send us full life, to each who make offerings, lives aright and pours the juice That we with simple heart. May wait upon the Devas. We ask for freedom and complete felicity.\np:May Indra evermore be gracious unto us, an. May King Soma meditate our happiness, Even as men secure the comfort of a friend. We ask for freedom and complete felicity.\np:Indra hath given the body with its song and strength: B&#7771;haspati, thou art the lengthener of life. The offering is Manu, Providence, our Sire. We ask for freedom and complete felicity.\np:Indra possesseth might celestial nobly formed: the singer in the house is Agni, prudent Sage. He is the offering in synod, fair, most near. We ask for freedom and complete felicity,\np:Not often have we sinned against you secretly, nor, Devas, have we openly provoked the Devas. Not one of its, ye Devas, hath worn an alien shape. We ask for freedom and complete felicity.\np:May Indra remove from us our malady, an. May the Mountains keep it far away from where The press-stone as it sheds the meath rings loudly forth. We ask for freedom and complete felicity.\np:Ye Devas, let the stone, the presser stand erect: avert all enmities and keep them far remote. Our guard to be adored is Indra this Deva. We ask for freedom and complete felicity.\np:Eat strength and fatness in the pasture, kine, who are balmed at the reservoir and at the seat of Law. So let your body be our body's medicine. We ask for freedom and complete felicity.\np:The singer fills the spirit: all mens, love hath he. Indra takes kindly care of those who pour the juice. For his libation is the heavenly udder full. We ask for freedom and complete felicity.\np:Wondrous thy spirit-filling light, triumpliant; thy hosts save from decay and are resistless. The pious votary by straightest pathway speeds to possess the best of all the cattle.",
    "next": "10101",
    "previous": "10099",
    "book": "10"
  },
  "created": 1638557967619,
  "updated": 1638647018719
}