{
  "key": "10106",
  "title": "RigVeda Hymn 10106",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CVI. A&#347;vins.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10106.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10105.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10107.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CVI. A&#347;vins.</h3>  \n<p>1. THIS very thing ye Twain hold as your object: ye weave your songs as skilful men weave garments.<br> That ye may come united have I waked you: ye spread out food like days of lovely weather.<br> 2 Like two plough-bulls ye move along in traces, and seek like eager guests your bidder's banquet.<br> Ye are like glorious envoys mid the people: like bulls, approach the place where ye are watered.<br> 3 Like the two pinions of a bird, connected, like two choice animals, ye have sought our worship.<br> Bright as the fire the votary hath kindled, ye sacrifice in many a spot as roamers.<br> 4 Ye are our kinsmen, like two sons, two fathers, strong in your splendour and like kings for conquest;<br> Like rays for our enjoyment, Lords to feed us, ye, like quick bearers, have obeyed our calling.<br> 5 You are like two pleasantly moving well-fed (hills) like Mitra and Varu&#7751;a, the two bestowers of felicity, veracious, possessors of infinite wealth, happy, like two horses plump with fodder, abiding in the firmament, like two rams (are you) to be nourished with sacrificial food, to be cherished (with oblations).<br> 6 You are like two mad elephants bending their forequarters and smiting the foe, like the two sons of Nitosa destroying (foes), and cherishing (friends); you are bright as two water-born (jewels), do you, who are victorious, (render) my decaying mortal body free from decay.<br> 7 Fierce (A&#347;vins), like two powerful (heroes), you enable this moving, perishable mortal (frame) to cross over to the objects (of its destination) as over water; extremely strong, like the &#7770;bhus, your chariot, attained its destination swift as the wind, it pervaded (everywhere), it dispensed riches.<br> 8 With your bellies full of the Soma, like two saucepans, preservers of wealth, destroyers of enemies. (you are) armed with hatchets, moving like two flying (birds) with forms like the moon, attaining success through the mind, like two laudable beings, (you are) approaching (the sacrifice).<br> 9 Like giants, ye will find firm ground to stand on in depths, like feet for one who fords a shallow.<br> Like cars ye will attend to him who orders: ye Two enjoy our wondrous work as sharers.<br> 10 Like toiling bees ye bring to us your honey, as bees into the hide that opens downward.<br> 11 May we increase the laud and gain us vigour: come to our song, ye whom one chariot carries.<br> Filled be our kine with ripened meath like glory: Bhutamsa hath fulfilled the A&#347;vins' longing.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10107.htm\">Next: HYMN CVII. Dak&#7779;i&#7751;&#257;.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10106.html",
  "api": "json/hymns/10106.json",
  "data": {
    "title": "HYMN CVI. A&#347;vins.",
    "describe": "THIS very thing ye Twain hold as your object: ye weave your songs as skilful men weave garments.",
    "feecting": "p:THIS very thing ye Twain hold as your object: ye weave your songs as skilful men weave garments.\np: That y. May come united have I waked you: ye spread out food like days of lovely weather.\r\np:Like two plough-bulls ye move along in traces, and seek like eager guests your bidder's banquet. Ye are like glorious envoys mid the people: like bulls, approach the place where ye are watered.\np:Like the two pinions of a bird, connected, like two choice animals, ye have sought our worship. Bright as the fire the votary hath kindled, ye offering in many a spot as roamers.\np:Ye are our kinsmen, like two sons, two fathers, strong in your splendour and like kings for conquest; Like rays for our enjoyment, Lords to feed us, ye, like quick bearers, have obeyed our calling.\np:You are like two pleasantly moving well-fed (hills) like Mitra and Varu&#7751;a, the two bestowers of felicity, veracious, possessors of infinite wealth, happy, like two horses plump with fodder, abiding in the Firmament, like two rams (are you) to be nourished with sacred food, to be cherished (with oblations).\np:You are like two mad elephants bending their forequarters and smiting the foe, like the two sons of Nitosa destroying (foes), and cherishing (friends); you are bright as two water-born (jewels), do you, who are victorious, (render) my decaying mortal body free from decay.\np:Fierce (A&#347;vins), like two powerful (heroes), you enable this moving, perishable mortal (frame) to cross over to the objects (of its destination) as over water; extremely strong, like the &#7770;bhus, your chariot, attained its destination swift as the wind, it pervaded (everywhere), it dispensed riches.\np:With your bellies full of the Soma, like two saucepans, preservers of wealth, destroyers of enemies. (you are) armed with hatchets, moving like two flying (birds) with forms like the moon, attaining success through the mind, like two laudable beings, (you are) approaching (the offering).\np:Like giants, ye will find firm ground to stand on in depths, like feet for one who fords a shallow. Like cars ye will attend to him who orders: ye Two enjoy our wondrous work as sharers.\np:Like toiling bees ye bring to us your honey, as bees into the hide that opens downward.\np:May we increase the laud and gain us vigour: come to our song, ye whom one chariot carries. Filled be our kine with ripened meath like glory: Bhutamsa hath fulfilled the A&#347;vins' longing.",
    "next": "10107",
    "previous": "10105",
    "book": "10"
  },
  "created": 1638557999136,
  "updated": 1638647073167
}