{
  "key": "10105",
  "title": "RigVeda Hymn 10105",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10105.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10104.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10106.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CV. Indra.</h3>  \n<p>1. WHEN, Vasu, wilt thou love the laud? Now let the channel bring the stream.<br> The juice is ready to ferment.<br> 2 He whose two Bay Steeds harnessed well, swerving, pursue the Bird's tail-plumes,<br> With Rowing manes, like heaven and earth, he is the Lord with power to give.<br> 3 Bereft of skill is Indra, if, like some outwearied man he fears<br> The sinner, when the Mighty hath prepared himself for victory.<br> 4 Indra with these drives round, until he meets with one to worship him:<br> Indra is Master of the pair who snort and swerve upon their way.<br> 5 Borne onward by the long-maned Steeds who stretch themselves as &#146;twere for food,<br> The God who wears the helm defends them with his jaws.<br> 6 The Mighty sang with Lofty Ones: the Hero fashioned with his strength,<br> Like skilful M&#257;tari&#347;van with his power and might,<br> 7 The bolt, which pierced at once the vitals of the Dasyu easy to be slain,<br> With jaw uninjured like the wondrous firmament.<br> 8 Grind off our sins: with song will we conquer the men who sing no hymns:<br> Not easily art thou pleased with prayerless sacrifice.<br> 9 When threefold flame burns high for thee, to rest on poles of sacrifice,<br> Thou with the living joyest in the self-bright Ship.<br> 10 Thy glory was the speckled cup, thy glory was the flawless scoop.<br> Wherewith thou pourest into thy receptacle.<br> 11 As hundreds, O Immortal God, have sung to thee, so hath Sumitra, yea, Durmitra praised thee here,<br> What time thou holpest Kutsa's son, when Dasyus fell, yea, holpest Kutsa's darling when the Dasyus died.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10106.htm\">Next: HYMN CVI. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10105.html",
  "api": "json/hymns/10105.json",
  "data": {
    "title": "HYMN CV. Indra.",
    "describe": "WHEN, Vasu, wilt thou love the laud?",
    "feecting": "p:WHEN, Vasu, wilt thou love the laud? Now let the channel bring the stream.\np: The juice is ready to ferment.\r\np:He whose two Bay Steeds harnessed well, swerving, pursue the Bird's tail-plumes, with Rowing manes, like Heaven and Earth, he is the Lord with power to give.\np:Bereft of skill is Indra, if, like some outwearied man he fears The sinner, when the Mighty hath prepared himself for victory.\np:Indra with these drives round, until he meets with one to worship him: Indra is Master of the pair who snort and swerve upon their way.\np:Borne onward by the long-maned Steeds who stretch themselves as &#146;twere for food who wears the helm defends them with his jaws.\np:The Mighty sang with Lofty Ones: the Hero fashioned with his strength, like skilful M&#257;tari&#347;van with his power and might,\np:The bolt, which pierced at once the vitals of the Dasyu easy to be slain, with jaw uninjured like the wondrous Firmament.\np:Grind off our sins: with song will we conquer the men who sing no hymns: Not easily art thou pleased with prayerless offering.\np:When threefold flame burns high for thee, to rest on poles of offering, Thou with the living joyest in the self-bright Ship.\np:Thy glory was the speckled cup, thy glory was the flawless scoop. Wherewith thou pourest into thy receptacle.\np:As hundreds, O Immortal Deva, have sung to thee, so hath Sumitra, yea, Durmitra praised thee here, what time thou holpest Kutsa's son, when Dasyus fell, yea, holpest Kutsa's darling when the Dasyus died.",
    "next": "10106",
    "previous": "10104",
    "book": "10"
  },
  "created": 1638557993884,
  "updated": 1638790698652
}