{
  "key": "10119",
  "title": "RigVeda Hymn 10119",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CXIX. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10119.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10118.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10120.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXIX. Indra.</h3>  \n<p>1. THIS, even this was my resolve, to win a cow, to win a steed:<br> Have I not drunk of Soma juice?<br> 2 Like violent gusts of wind the draughts that I have drunk have lifted me<br> Have I not drunk of Soma juice?<br> 3 The draughts I drank have borne me up, as fleet-foot horses draw a car:<br> Have I not drunk of Soma juice?<br> 4 The hymn hath reached me, like a cow who lows to meet her darling calf:<br> Have I not drunk of Soma juice?<br> 5 As a wright bends a chariot-seat so round my heart I bend the hymn:<br> Have I not drunk of Soma juice?<br> 6 Not as a mote within the eye count the Five Tribes of men with me:<br> Have I not drunk of Soma juice?<br> 7 The heavens and earth themselves have not grown equal to one half of me<br> Have I not drunk of Soma juice?<br> 8 I in my grandeur have surpassed the heavens and all this spacious earth<br> Have I not drunk of Soma juice?<br> 9 Aha! this spacious earth will I deposit either here or there<br> Have I not drunk of Soma juice?<br> 10 In one short moment will I smite the earth in fury here or there:<br> Have I not drunk of Soma juice?<br> 11 One of my flanks is in the sky; I let the other trail below:<br> Have I not drunk of Soma juice?<br> 12 1, greatest of the Mighty Ones, am lifted to the firmament:<br> Have I not drunk of Soma juice?<br> 13 I seek the worshipper's abode; oblation-bearer to the Gods:<br> Have I not drunk of Soma juice?</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10120.htm\">Next: HYMN CXX. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10119.html",
  "api": "json/hymns/10119.json",
  "data": {
    "title": "HYMN CXIX. Indra.",
    "describe": "THIS, even this was my resolve, to win a cow, to win a steed: Have I not drunk of Soma juice?",
    "feecting": "p:THIS, even this was my resolve, to win a cow, to win a steed: Have I not drunk of Soma juice?\np:Like violent gusts of wind the draughts that I have drunk have lifted me Have I not drunk of Soma juice?\np:The draughts I drank have borne me up, as fleet-foot horses draw a car: Have I not drunk of Soma juice?\np:The hymn hath reached me, like a cow who lows to meet her darling calf: Have I not drunk of Soma juice?\np:As a wright bends a chariot-seat so round my heart I bend the hymn: Have I not drunk of Soma juice?\np:Not as a mote within the eye count the Five Tribes of men with me: Have I not drunk of Soma juice?\np:The heavens and Earth themselves have not grown equal to one half of me Have I not drunk of Soma juice?\np:I in my grandeur have surpassed the heavens and all this spacious Earth Have I not drunk of Soma juice?\np:Aha! this spacious Earth will I deposit either here or there Have I not drunk of Soma juice?\np:In one short moment will I smite the Earth in fury here or there: Have I not drunk of Soma juice?\np:One of my flanks is in the sky; I let the other trail below: Have I not drunk of Soma juice?\np:1, greatest of the Mighty Ones, am lifted to the Firmament: Have I not drunk of Soma juice?\np:I seek the worshipper's abode; oblation-bearer to the Devas: Have I not drunk of Soma juice?",
    "next": "10120",
    "previous": "10118",
    "book": "10"
  },
  "created": 1638558067736,
  "updated": 1638791253678
}