{
  "key": "10114",
  "title": "RigVeda Hymn 10114",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CXIV. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10114.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10113.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10115.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXIV. Vi&#347;vedevas.</h3>  \n<p>1. Two perfect springs of heat pervade the Threefold, and come for their delight is M&#257;tari&#347;van.<br> Craving the milk of heaven the Gods are present: well do they know the praisesong and the S&#257;man.<br> 2 The priests beard far away, as they are ordered, serve the three Nirrtis, for well they know them.<br> Sages have traced the cause that first produced them, dwelling in distant and mysterious chambers.<br> 3 The Youthful One, well-shaped, with four locks braided, brightened with oil, puts on the ordinances.<br> Two Birds of mighty power are seated near her, there where the Deities receive their portion.<br> 4 One of these Birds hath passed into the sea of air: thence he looks round and views this universal world.<br> With simple heart I have beheld him from anear: his Mother kisses him and he returns her kiss.<br> 5 Him with fair wings though only One in nature, wise singers shape, with songs, in many figures.<br> While they at sacrifices fix the metres, they measure out twelve chalices of Soma.<br> 6 While they arrange the four and six-and-thirty, and duly order, up to twelve, the measures,<br> Having disposed the sacrifice thoughtful sages send the Car forward with the Rc and S&#257;man.<br> 7 The Chariot's majesties are fourteen others: seven sages lead it onward with their Voices.<br> Who will declare to us the ford Apnana, the path whereby they drink first draughts of Soma?<br> 8 The fifteen lauds are in a thousand places that is as vast as heaven and earth in measure.<br> A thousand spots contain the mighty thousand. V&#257;k spreadeth forth as far as Prayer extendeth.<br> 9 What sage hath learned the metres' application? Who hath gained V&#257;k, the spirit's aim and object?<br> Which ministering priest is called eighth Hero? Who then hath tracked the two Bay Steeds of Indra?<br> 10 Yoked to his chariot-pole there stood the Coursers: they only travel round earth's farthest limits.<br> These, when their driver in his home is settled, receive the allotted meed of their exertion.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10115.htm\">Next: HYMN CXV. Agni.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10114.html",
  "api": "json/hymns/10114.json",
  "data": {
    "title": "HYMN CXIV. Vi&#347;vedevas.",
    "describe": "Two perfect springs of heat pervade the Threefold, and come for their delight is M&#257;",
    "feecting": "p:Two perfect springs of heat pervade the Threefold, and come for their delight is M&#257;tari&#347;van.\np: Craving the milk of Heaven the Devas are present: well do they know the praisesong and the S&#257;man.\r\np:The Monks beard far away, as they are ordered, serve the three Nirrtis, for well they know them. Sages have traced the cause that first produced them, dwelling in distant and mysterious chambers.\np:The Youthful One, well-shaped, with four locks braided, brightened with oil, puts on the ordinances. Two Birds of mighty power are seated near her, there where the Deities receive their portion.\np:One of these Birds hath passed into the sea of air: thence he looks round and views this universal world. With simple heart I have beheld him from anear: his Mother kisses him and he returns her kiss.\np:Him with fair wings though only One in nature, wise singers shape, with songs, in many figures. While they at offers fix the metres, they measure out twelve chalices of Soma.\np:While they arrange the four and six-and-thirty, and duly order, up to twelve, the measures, Having disposed the offering thoughtful sages send the Car forward with the Rc and S&#257;man.\np:The Chariot's majesties are fourteen others: seven sages lead it onward with their Voices. Who will declare to us the ford Apnana, the path whereby they drink first draughts of Soma?\np:The fifteen lauds are in a thousand places that is as vast as Heaven and Earth in measure. A thousand spots contain the mighty thousand. V&#257;k spreadeth forth as far as Prayer extendeth.\np:What sage hath learned the metres' application? Who hath gained V&#257;k, the spirit's aim and object? Which ministering priest is called eighth Hero? Who then hath tracked the two Bay Steeds of Indra?\np:Yoked to his chariot-pole there stood the Coursers: they only travel round Earth's farthest limits. These, when their driver in his home is settled, receive the allotted meed of their exertion.",
    "next": "10115",
    "previous": "10113",
    "book": "10"
  },
  "created": 1638558041431,
  "updated": 1638791592246
}