{
  "key": "10111",
  "title": "RigVeda Hymn 10111",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CXI. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10111.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10110.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10112.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXI. Indra.</h3>  \n<p>1. BRING forth your sacred song ye prudent singers, even as are the thoughts of human beings.<br> Let us draw Indra with true deeds anear us: he loves our songs, the Hero, and is potent.<br> 2 The hymn shone brightly from the seat of worship: to the kine came the Bull, the Heifer's Offipring<br> With mighty bellowing hath he arisen, and hath pervaded even the spacious regions.<br> 3 Indra knows, verily, how to hear our singing, for he, victorious, made a path for S&#363;rya.<br> He made the Cow, and be became the Sovran of Heaven, primeval, matchless, and unshaken.<br> 4 Praised by A&#7749;girases, Indra demolished with might the works of the great watery monster<br> Full many regions, too, hath he pervaded, and by his truth supported earth's foundation.<br> 5 The counterpart of heaven and earth is Indra: he knoweth all libations, slayeth &#346;u&#7779;&#7751;a.<br> The vast sky with the Sun hath he extended, and, best otpillars, stayed it with a pillar.<br> 6 The V&#7771;tra-slaver with his bolt felled V&#7771;tra: the magic of the godless, waxen mighty,<br> Here hast thou, Bold Assailant, boldly conquered. Yea, then thine arms, O Maghavan, were potent.<br> 7 When the Dawns come attendant upon S&#363;rya their rays discover wealth of divers colours.<br> The Star of heaven is seen as &#146;twere approaching: none knoweth aught of it as it departeth.<br> 8 Far have they gone, the first of all these waters, the waters that flowed forth when Indra sent them.<br> Where is their spring, and where is their foundation? Where now, ye Waters, is your inmost centre?<br> 9 Thou didst free rivers swallowed by the Dragon; and rapidly they set themselves in motion,<br> Those that were loosed and those that longed for freedom. Excited now to speed they run unresting.<br> 10 Yearning together they have sped to Sindhu: the Fort-destroyer, praised, of old, hath loved them.<br> Indra, may thy terrestrial treasures reach us, and our full songs of joy approach thy dwelling.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10112.htm\">Next: HYMN CXII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10111.html",
  "api": "json/hymns/10111.json",
  "data": {
    "title": "HYMN CXI. Indra.",
    "describe": "BRING forth your sacred song ye prudent singers, even as are the thoughts of human beings.",
    "feecting": "p:BRING forth your sacred song ye prudent singers, even as are the thoughts of human beings.\np: Let us draw Indra with true deeds anear us: he loves our songs, the Hero, and is potent.\r\np:The hymn shone brightly from the seat of worship: to the kine came the Bull, the Heifer's Offipring With mighty bellowing hath he arisen, and hath pervaded even the spacious regions.\np:Indra knows, verily, how to hear our singing, for he, victorious, made a path for S&#363;rya. He made the Cow, and be became the Sovran of Heaven, primeval, matchless, and unshaken.\np:Praised by A&#7749;girases, Indra demolished with might the works of the great watery monster Full many regions, too, hath he pervaded, and by his truth supported Earth's foundation.\np:The counterpart of Heaven and Earth is Indra: he knoweth all libations, slayeth &#346;u&#7779;&#7751;a. The vast sky with the Sun hath he extended, and, best otpillars, stayed it with a pillar.\np:The V&#7771;tra-slaver with his bolt felled V&#7771;tra: the magic of the godless, waxen mighty. Here hast thou, Bold Assailant, boldly conquered. Yea, then thine arms, O Indra, were potent.\np:When the Dawns come attendant upon S&#363;rya their rays discover wealth of divers colours. The Star of Heaven is seen as &#146;twere approaching: none knoweth aught of it as it departeth.\np:Far have they gone, the first of all these waters, the waters that flowed forth when Indra sent them. Where is their spring, and where is their foundation? Where now, ye Waters, is your inmost centre?\np:Thou didst free rivers swallowed by the Dragon; and rapidly they set themselves in motion, Those that were loosed and those that longed for freedom. Excited now to speed they run unresting.\np:Yearning together they have sped to Sindhu: the Fort-destroyer, praised, of old, hath loved them. Indra, may thy terrestrial treasures reach us, and our full songs of joy approach thy dwelling.",
    "next": "10112",
    "previous": "10110",
    "book": "10"
  },
  "created": 1638558025663,
  "updated": 1638791781264
}