{
  "key": "10112",
  "title": "RigVeda Hymn 10112",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CXII. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10112.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10111.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10113.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXII. Indra.</h3>  \n<p>1. DRINK of the juice, O Indra, at thy plea. sure, for thy first draught is early morn's libation.<br> Rejoice, that thou mayst slay our foes, O Hero, and we with lauds will tell thy mighty exploits.<br> 2 Thou hast a car more swift than thought, O Indra; thercon come hither, come to drink the Soma.<br> Let thy Bay Steeds, thy Stallions, hasten hither, with whom thou cornest nigh and art delighted.<br> 3 Deck out thy body with the fairest colours, with golden splendour of the Sun adorn it.<br> O Indra, turn thee hitherward invited by us thy friends; be seated and be joyful.<br> 4 O thou whose grandeur in thy festive transports not even these two great worlds have comprehended.<br> Come, Indra, with thy dear Bay Horses harnessed, come to our dwelling and the food thou lovest.<br> 5 Pressed for thy joyous banquet is the Soma, Soma whereof thou, Indra, ever drinking,<br> Hast waged unequalled battles with thy foemen, which prompts the mighty flow of thine abundance.<br> 6 Found from of old is this thy cup, O Indra: &#346;atakratu, drink therefrom the Soma.<br> Filled is the beaker with the meath that gladdens, the beaker which all Deities delight in.<br> 7 From many a side with proffered entertainment the folk are calling thee, O Mighty Indra.<br> These our libations shall for thee be richest in sweet meath: dvink thereof and find them pleasant.<br> 8 I will declare thy deeds of old, O Indra, the mighty acts which thou hast first accomplished.<br> In genuine wrath thou loosenedst the mountain so that the Brahman easily found the cattle.<br> 9 Lord of the hosts, amid our bands be seated: they call thee greatest Sage among the sages.<br> Nothing is done, even far away, without thee: great, wondrous, Maghavan, is the hymn I sing thee.<br> 10 Aim of our eyes be thou, for we implore thee, O Maghavan, Friend of friends and Lord of treasures.<br> Fight, Warrior strong in truth, fight thou the battle: give us our share of undivided riches.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10113.htm\">Next: HYMN CXTII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/10112.html",
  "api": "hymns/10112json",
  "data": {
    "title": "HYMN CXII. Indra.",
    "describe": "DRINK of the juice, O Indra, at thy plea.",
    "feecting": "p:DRINK of the juice, O Indra, at thy plea. sure, for thy first draught is early morn's libation.\np: Rejoice, that tho. Mayst subdue our . O Hero, and we with lauds will tell thy mighty exploits.\r\np:Thou hast a car more swift than thought, O Indra; thercon come hither, come . Let thy Bay Steeds, thy Stallions, hasten hither, with whom thou cornest nigh and art delighted.\np:Deck out thy body with the fairest colours, with golden splendour of the Sun adorn it. O Indra, turn thee hitherward invited by us thy friends; be seated and be joyful.\np:O thou whose grandeur in thy festive transports not even these two great worlds have comprehended. Come, Indra, with thy dear Bay Horses harnessed, come to our dwelling and the food thou lovest.\np:Pressed for thy joyous banquet is the Soma, Soma whereof thou, Indra, ever drinking, Hast waged unequalled battles with thy foemen, which prompts the mighty flow of thine abundance.\np:Found from of old is this thy cup, O Indra: Śatakratu, drink therefrom the Soma. Filled is the beaker with the meath that gladdens, the beaker which all Deities delight in.\np:From many a side with proffered entertainment the folk are calling thee, O Mighty Indra. These our libations shall for thee be richest in sweet meath: dvink thereof and find them pleasant.\np:I will declare thy deeds of old, O Indra, the mighty acts which thou hast first accomplished. In genuine wrath thou loosenedst the mountain so that the Brahman easily found the cattle.\np:Lord of the hosts, amid our bands be seated: they call thee greatest Sage among the sages. Nothing is done, even far away, without thee: great, wondrous, Indra, is the hymn I sing thee.\np:Aim of our eyes be thou, for we implore thee, O Indra, Friend of friends and Lord of treasures. Fight, Warrior strong in truth, fight thou the battle: give us our share of undivided riches.",
    "next": "10113",
    "previous": "10111",
    "book": "10"
  },
  "created": 1638558030925
}