{
  "key": "10137",
  "title": "RigVeda Hymn 10137",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CXXXVII Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10137.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10136.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10138.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXXXVII Vi&#347;vedevas.</h3>  \n<p>1. YE Gods, raise up once more the man whom ye have humbled and brought low.<br> O Gods, restore to life again the man who hatb committed sin.<br> 2 Two several winds are blowing here, from Sindhu, from a distant land.<br> May one breathe energy to thee, the other blow disease away.<br> 3 Hither, O Wind, blow healing balm, blow all disease away, thou Wind;<br> For thou who hast all medicine comest as envoy of the Gods.<br> 4 I am come nigh to thee with balms to give thee rest and keep thee safe.<br> I bring thee blessed strength, I drive thy weakening malady away.<br> 5 Here let the Gods deliver him, the Maruts&#146; band deliver him:<br> All things that be deliver him that he be freed from his disease.<br> 6 The Waters have their healing power, the Waters drive disease away.<br> The Waters have a balm for all: let them make medicine for thee.<br> 7 The tongue that leads the voice precedes. Then with our ten-fold branching hands,<br> With these two chasers of disease we stroke thee with a gentle touch.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10138.htm\">Next: HYMN CXXXVIII. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10137.html",
  "api": "json/hymns/10137.json",
  "data": {
    "title": "HYMN CXXXVII Vi&#347;vedevas.",
    "describe": "YE Devas, raise up once more the man whom ye have humbled and brought low.",
    "feecting": "p:YE Devas, raise up once more the man whom ye have humbled and brought low.\np: O Devas, restore to life again the man who hatb committed sin.\r\np:Two several winds are blowing here, from Sindhu, from a distant land. May one breathe energy to thee, the other blow disease away.\np:Hither, O Wind, blow healing balm, blow all disease away, thou Wind; For thou who hast all medicine comest as envoy of the Devas.\np:I am come nigh to thee with balms to give thee rest and keep thee safe. I bring thee blessed strength, I drive thy weakening malady away.\np:Here let the Devas deliver him, the Devas&#146; band deliver him: All things that be deliver him that he be freed from his disease.\np:The Waters have their healing power, the Waters drive disease away. The Waters have a balm for all: let them make medicine for thee.\np:The tongue that leads the voice precedes. Then with our ten-fold branching hands, with these two chasers of disease we stroke thee with a gentle touch.",
    "next": "10138",
    "previous": "10136",
    "book": "10"
  },
  "created": 1638558163158,
  "updated": 1638647073199
}