{
  "key": "10130",
  "title": "RigVeda Hymn 10130",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CXXX. Creation.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10130.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10129.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10131.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXXX. Creation.</h3>  \n<p>1. THE sacrifice drawn out with threads on every side, stretched by a hundred sacred ministers and one,&#151;<br> This do these Fathers weave who hitherward are come: they sit beside the warp and cry, Weave forth, weave back.<br> 2 The Man extends it and the Man unbinds it: even to this vault of heaven hath he outspun, it.<br> These pegs are fastened to the seat of worship: they made the S&#257;ma-hymns their weaving shuttles.<br> 3 What were the rule, the order and the model? What were the wooden fender and the butter?<br> What were the hymn, the chant, the recitation, when to the God all Deities paid worship?<br> 4 Closely was G&#257;yatr&#299; conjoined with Agni, and closely Savitar combined with Usnih.<br> Brilliant with Ukthas, Soma joined Anustup: B&#7771;haspati's voice by Brhati was aided.<br> 5 Vir&#257;j adhered to Varu&#7751;a and Mitra: here Tri&#7779;&#7789;up day by day was Indra's portion.<br> Jagat&#299; entered all the Gods together: so by this knowledge men were raised to &#7770;&#7779;is.<br> 6 So by this knowledge men were raised to &#7770;&#7779;is, when ancient sacrifice sprang up, our Fathers.<br> With the mind's eye I think that I behold them who first performed this sacrificial worship.<br> 7 They who were versed in ritual and metre, in hymns and rules, were the Seven Godlike &#7770;&#7779;is.<br> Viewing the path of those of old, the sages have taken up the reins like chariot-drivers.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10131.htm\">Next: HYMN CXXXI. Indra.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "rigveda/hymns/10130.html",
  "api": "hymns/10130json",
  "data": {
    "title": "HYMN CXXX. Creation.",
    "describe": "THE offering drawn out with threads on every side, stretched by a hundred sacred ministers and one,— This do these Fathers weave who hitherward are come: they sit beside the warp and cry, Weave forth, weave back.",
    "feecting": "p:THE offering drawn out with threads on every side, stretched by a hundred sacred ministers and one,— This do these Fathers weave who hitherward are come: they sit beside the warp and cry, Weave forth, weave back.\np:The Man extends it and the Man unbinds it: even to this vault of Heaven hath he outspun, it.\np: These pegs are fastened to the seat of worship: they made the Sāma-hymns their weaving shuttles.\r\np:What were the rule, the order and the model? What were the wooden fender and the butter? What were the hymn, the chant, the recitation, when to the Deva all Deities paid worship?\np:Closely was Gāyatrī conjoined with Agni, and closely Indra combined with Usnih. Brilliant with Ukthas, Soma joined Anustup: Soma's voice by Brhati was aided.\np:Virāj adhered to Indra and Mitra: here Triṣṭup day by day was Indra's portion. Jagatī entered all the Devas together: so by this knowledge men were raised to Ṛṣis.\np:So by this knowledge men were raised to Ṛṣis, when ancient offering sprang up, our Fathers. With the mind's eye I think that I behold them who first performed this sacrificial worship.\np:They who were versed in ritual and metre, in hymns and rules, were the Seven Godlike Ṛṣis. Viewing the path of those of old, the sages have taken up the reins like chariot-drivers.",
    "next": "10131",
    "previous": "10129",
    "book": "10"
  },
  "created": 1638558125939
}