{
  "key": "10134",
  "title": "RigVeda Hymn 10134",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CXXXIV. Indra.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10134.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10133.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10135.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXXXIV. Indra.</h3>  \n<p>1. As, like the Morning, thou hast filled, O Indra, both the earth and heaven.<br> So as the Mighty One, great King of all the mighty world of men, the Goddess Mother brought thee forth, the Blessed Mother gave thee life.<br> 2 Relax that mortal's stubborn strength whose heart is bent on wickedness.<br> Trample him down beneath thy feet who watches for and aims at us. The Goddess Mother brought thee forth, the Blessed Mother gave thee life.<br> 3 Shake down, O Slayer of the foe, those great all splendid enemies.<br> With all thy powers, O &#346;akra, all thine helps, O Indra, shake them down:<br> 4 As thou, O &#346;atakratu, thou, O Indrv, shakest all things down<br> As wealth for him who sheds the juice, with thine assistance thousandfold.<br> 5 Around, on every side like drops of sweat let lightning-flashes fall.<br> Let all malevolence pass away from us like threads of Darva grass.<br> 6 Thou bearest in thine hand a lance like a long hook, great Counsellor!<br> As with his foremost foot a goat, draw down the branch, O Maghavan.<br> 7 Never, O Gods, do we offend, nor are we ever obstinate: we walk as holy texts command.<br> Closely we clasp and cling to you, cling to your sides, beneath your arms.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10135.htm\">Next: HYMN CXXXV. Yama.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10134.html",
  "api": "json/hymns/10134.json",
  "data": {
    "title": "HYMN CXXXIV. Indra.",
    "describe": "As, like the Morning, thou hast filled, O Indra, both the Earth and Heaven.",
    "feecting": "p:As, like the Morning, thou hast filled, O Indra, both the Earth and Heaven.\np: So as the Mighty One, great King of all the mighty world of mendess Mother brought thee forth, the Blessed Mother gave thee life.\r\np:Relax that mortal's stubborn strength whose heart is bent on wickedness. Trample him down beneath thy feet who watches for and aims at us. The Goddess Mother brought thee forth, the Blessed Mother gave thee life.\np:Shake down, O Slayer of the foe, those great all splendid enemies. With all thy powers, O &#346;akra, all thine helps, O Indra, shake them down:\np:As thou, O &#346;atakratu O Indrv, shakest all things down As wealth for him who sheds the juice, with thine assistance thousandfold.\np:Around, on every side like drops of sweat let lightning-flashes fall. Let all malevolence pass away from us like threads of Darva grass.\np:Thou bearest in thine hand a lance like a long hook, great Counsellor! As with his foremost foot a goat, draw down the branch, O Indra.\np:Never, O Devas, do we offend, nor are we ever obstinate: we walk as holy texts command. Closely we clasp and cling to you, cling to your sides, beneath your arms.",
    "next": "10135",
    "previous": "10133",
    "book": "10"
  },
  "created": 1638558147273,
  "updated": 1638647073197
}