{
  "key": "10140",
  "title": "RigVeda Hymn 10140",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CXL. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10140.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10139.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10141.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXL. Agni.</h3>  \n<p>1. AGNI, life-power and fame are thine: thy fires blaze mightily, thou rich in wealth of beams!<br> Sage, passing bright, thou givest to the worshipper, with strength, the food that merits laud.<br> 2 With brilliant, purifying sheen, with perfect sheen thou liftest up thyself in light.<br> Thou, visiting both thy Mothers, aidest them as Son: thou joinest close the earth and heaven.<br> 3 O J&#257;tavedas, Son of Strength, rejoice ihyself, gracious, in our fair hymns and songs.<br> In thee are treasured various forms of strengthening food, born nobly and of wondrous help.<br> 4 Agni, spread forth, as Ruler, over living things: give wealth to us, Immortal God.<br> Thou shinest out from beauty fair to look upon: thou leadest us to conquering power.<br> 5 To him, the wise, who orders sacrifice, who hath great riches un der his control,<br> Thou givest blest award of good, and plenteous food, givest him wealth that conquers all.<br> 6 The men have set before them them for their welfare Agni, strong, visible to all, the Holy.<br> Thee, Godlike One, with ears to hear, most famous, men's generations magnify with praise-songs.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10141.htm\">Next: HYMN CXLI. Vi&#347;vedevas.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10140.html",
  "api": "json/hymns/10140.json",
  "data": {
    "key": "10140",
    "title": "HYMN CXL. Agni.",
    "describe": "AGNI, life-power and fame are thine: thy fires blaze mightily, thou rich in wealth of beams!",
    "feecting": "p:AGNI, life-power and fame are thine: thy fires blaze mightily, thou rich in wealth of beams! Sage, passing bright, thou givest to the worshipper, with strength, the food that merits laud.\np:With brilliant, purifying sheen, with perfect sheen thou liftest up thyself in light.\np: Thou, visiting both thy Mothers, aidest them as Son: thou joinest close the Earth and Heaven.\r\np:O Jātavedas, Son of Strength, rejoice ihyself, gracious, in our fair hymns and songs. In thee are treasured various forms of strengthening food, born nobly and of wondrous help.\np:Agni, spread forth, as Ruler, over living things: give wealth to us, Immortal Deva. Thou shinest out from beauty fair to look upon: thou leadest us to conquering power.\np:To him, the wise, who orders offerings, who hath great riches un der his control, Thou givest blest award of good, and plenteous food, givest him wealth that conquers all.\np:The men have set before them them for their welfare Agni, strong, visible to all, the Holy. Thee, Godlike One, with ears to hear, most famous, men's generations magnify with praise-songs.",
    "meta": {
      "next": "10141",
      "previous": "10139",
      "book": "10",
      "original": "https://sacred-texts.com/hin/rigveda/rv10140.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv10140.htm"
    },
    "deities": [
      {
        "name": "O Jātavedas",
        "hymns": [
          {
            "key": "10140",
            "title": "HYMN CXL. Agni."
          }
        ]
      }
    ]
  },
  "created": 1638558179011,
  "updated": 1667440428500
}