{
  "key": "10142",
  "title": "RigVeda Hymn 10142",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CXLII. Agni.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10142.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10141.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10143.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CXLII. Agni.</h3>  \n<p>1. WITH thee, O Agni, was this singer of the laud: he hath no other kinship, O thou Son of Strength.<br> Thou givest blessed shelter with a triple guard. Keep the destructive lightning far away from us.<br> 2 Thy birth who seekest food is in the falling flood, Agni: as Comrade thou winnest all living things.<br> Our coursers and our songs shall be victorious: they of themselves advance like one who guards the herd.<br> 3 And thou, O Agni, thou of Godlike nature, sparest the stones, while caring up the brushwood.<br> Then are thy tracks like deserts in the corn-lands. Let us not stir to wrath thy mighty arrow.<br> 4 O'er hills through vales devouring as thou goest, thou partest like an army fain for booty<br> As when a barber shaves a beard, thou shavest earth when the wind blows on thy flame and fans it.<br> 5 Apparent are his lines as he approaches the course is single, but the cars are many,<br> When, Agni, thou, making thine arms resplendent, advancest o&#146;er the land spread out beneath thee.<br> 6 Now let thy strength, thy burning flames fly upward, thine energies, O Agni, as thou toilest.<br> Gape widely, bend thee, waxing in thy vigour: let all the Vasus sit this day beside thee.<br> 7 This is the waters' reservoir, the great abode of gathered streams.<br> Take thou another path than this, and as thou listest walk thereon.<br> 8 On thy way hitherward and hence let flowery Durva grass spring up<br> Let there be lakes with lotus blooms. These are the mansions of the flood.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10143.htm\">Next: HYMN CXLIII. A&#347;vins.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10142.html",
  "api": "json/hymns/10142.json",
  "data": {
    "title": "HYMN CXLII. Agni.",
    "describe": "WITH thee, O Agni, was this singer of the laud: he hath no other kinship, O thou Son of Strength.",
    "feecting": "p:WITH thee, O Agni, was this singer of the laud: he hath no other kinship, O thou Son of Strength.\np: Thou givest blessed shelter with a triple guard. Keep the destructive lightning far away from us.\r\np:Thy birth who seekest food is in the falling flood, Agni: as Comrade thou winnest all living things. Our coursers and our songs shall be victorious: they of themselves advance like one who guards the herd.\np:And thou, O Agni, thou of Godlike nature, sparest the stones, while caring up the brushwood. Then are thy tracks like deserts in the corn-lands. Let us not stir to wrath thy mighty arrow.\np:O'er hills through vales devouring as thou goest, thou partest like an army fain for booty As when a barber shaves a beard, thou shavest Earth when the wind blows on thy flame and fans it.\np:Apparent are his lines as he approaches the course is single, but the cars are many, when, Agni making thine arms resplendent, advancest o&#146;er the land spread out beneath thee.\np:Now let thy strength, thy burning flames fly upward, thine energies, O Agni, as thou toilest. Gape widely, bend thee, waxing in thy vigour: let all the Devas sit this day beside thee.\np:This is the waters' reservoir, the great abode of gathered streams. Take thou another path than this, and as thou listest walk thereon.\np:On thy way hitherward and hence let flowery Durva grass spring up Let there be lakes with lotus blooms. These are the mansions of the flood.",
    "next": "10143",
    "previous": "10141",
    "book": "10"
  },
  "created": 1638558189801,
  "updated": 1638791781293
}