{
  "key": "10165",
  "title": "RigVeda Hymn 10165",
  "orig": "<HTML>\n<HEAD>\n<link rel=\"stylesheet\" type=\"text/css\" href=\"../../css/marg.css\">\n<META HTTP-EQUIV=\"Content-Type\" CONTENT=\"text/html; charset=UTF-8\">\n<META name=\"description\" content=\"Rig Veda, tr. by Ralph T.H. Griffith, [1896], full text etext at sacred-texts.com\">\n<META name=\"keywords\" content=\"Rig Veda Hinduism Vedic Rik\">\n<TITLE>Rig Veda: Rig-Veda, Book 10: HYMN CLXV. Vi&#347;vedevas.</TITLE>\n</HEAD>\n<BODY>\n<CENTER>\n<A HREF=\"../../cdshop/index.htm\"><IMG SRC=\"../../cdshop/cdinfo.jpg\" BORDER=\"0\"></A><BR>\n<A HREF=\"../../index.htm\">Sacred Texts</A>&nbsp;\n<A HREF=\"../index.htm\">Hinduism</A>&nbsp;\n<A HREF=\"index.htm\">Index</A>&nbsp;\n\n<BR>\n<A HREF=\"../rvsan/rv10165.htm\">Sanskrit</A>&nbsp;\n\n<BR>\n<BR><A HREF=\"rvi10.htm\">Rig-Veda, Book 10 Index</A><BR>\n&nbsp;\n<A HREF=\"rv10164.htm\">Previous</A>&nbsp;\n<A HREF=\"rv10166.htm\">Next</A>&nbsp;\n<HR><A HREF=\"http://www.amazon.com/exec/obidos/ASIN/B001VEIA6U/internetsacredte\">Buy this Book at Amazon.com</A></CENTER>\n<HR>\n<P ALIGN=\"CENTER\"><FONT SIZE=\"-1\" COLOR=\"GREEN\"><I>Rig Veda</I>, tr. by Ralph T.H. Griffith, [1896], at sacred-texts.com</FONT></P><HR></p>  <h3 align=\"center\" align=\"center\">HYMN CLXV. Vi&#347;vedevas.</h3>  \n<p>1. GODS, whatsoe&#146;er the Dove came hither seeking, sent to us as the envoy of Destruction,<br> For that let us sing hymns and make atonement. Well be it with our quadrupeds and bipeds.<br> 2 Auspicious be the Dove that hath been sent us, a harmless bird, ye Gods, within our dwelling.<br> May Agni, Sage, be pleased with our oblation, and may the Missile borne on wings avoid us.<br> 3 Let not the Arrow that hath wings distract us: beside the fire-place, on the hearth it settles.<br> May, it bring welfare to our men and cattle: here let the Dove, ye Gods, forbear to harm us.<br> 4 The screeching of the owl is ineffective and when beside the fire the Dove hath settled,<br> To him who sent it hither as an envoy, to him be reverence paid, to Death, to Yama.<br> 5 Drive forth the Dove, chase it with holy verses: rejoicing, bring ye hither food and cattle,<br> Barring the way against all grief and trouble. Let the swift bird fly forth and leave us vigour.</p>  \n<p><HR>\n<CENTER>\n<A HREF=\"rv10166.htm\">Next: HYMN CLXVI. Sapatnan&#257;&#347;anam.</A></CENTER>\n</BODY>\n</HTML>\n",
  "link": "hymns/10165.html",
  "api": "json/hymns/10165.json",
  "data": {
    "key": "10165",
    "title": "HYMN CLXV. Devas.",
    "describe": "GODS, whatsoe’er the Dove came hither seeking, sent to us as the envoy of Destruction, for that let us sing hymns and make atonement.",
    "feecting": "p:GODS, whatsoe’er the Dove came hither seeking, sent to us as the envoy of Destruction, for that let us sing hymns and make atonement. Well be it with our quadrupeds and bipeds.\np:Auspicious be the Dove that hath been sent us, a harmless bird, ye Devas, within our dwelling.\np: May Agni, Sage, be pleased with our oblation, an. May the Missile borne on wings avoid us.\r\np:Let not the Arrow that hath wings distract us: beside the fire-place, on the hearth it settles. May, it bring welfare to our men and cattle: here let the Dove, ye Devas, forbear to harm us.\np:The screeching of the owl is ineffective and when beside the fire the Dove hath settled, to him who sent it hither as an envoy, to him be reverence paid, to Death, to Yama.\np:Drive forth the Dove, chase it with holy verses: rejoicing, bring ye hither food and cattle, Barring the way against all grief and trouble. Let the swift bird fly forth and leave us vigour.",
    "meta": {
      "next": "10166",
      "previous": "10164",
      "book": "10",
      "source": "https://sacred-texts.com/hin/rigveda/rv10165.htm",
      "sanskrit": "https://sacred-texts.com/hin/rvsan/rv10165.htm"
    },
    "deities": []
  },
  "created": 1638558311398,
  "updated": 1638830293252
}